function getOption() {
    var obj = document.getElementById("mySelect");
	if (obj.options[obj.selectedIndex].value == "A") {  Learn() };
	if (obj.options[obj.selectedIndex].value == "B") { Exam() };
};

function Start(){

	java.style.display="none";
	numb.style.display="none";
	btn4.style.display="none";
	test_status.style.display="none";
	timeleft.style.display="none";
	test.style.display="none";
};
function Learn() {
	form1.style.display="none";
	setFirstQuestion();
	
	};
	
	function Exam() {
		
	form1.style.display="none";
	test_status.style.display="block";
    test.style.display="block";
	timeleft.style.display="block";
	
	setmaxtimelimit() ;
	setmaxNumberOfQuestions();
	setQuestionOrder2(); 
    renderQuestion(); 
    setupTimer();
	};
	
function setFirstQuestion() {
    var x, text;

    // Get the value of the input field with id="numb"
    x = document.getElementById("numb").value;

    // If x is Not a Number or less than one or greater than 10
    if (isNaN(x) || x < 1 || x > maxNumberOfQuestions2) {
        text = "<h5>Въведете стойност между 1 и "+maxNumberOfQuestions+"</h5>";
		
		java.style.display="block";
	numb.style.display="inline";
	btn4.style.display="inline";
		
		
		
    } else {
        text = "Input OK";
		test_status.style.display="block";
		test.style.display="block";
		//timeleft.style.visibility="visible";
		java.style.display="none";
	numb.style.display="none";
	btn4.style.display="none";
	demo.style.display="none";
		setQuestionOrder(); 
        renderQuestion(); 
		//setupTimer();
    }
    document.getElementById("demo").innerHTML = text;
}

var myVar; 
function startTimer() { 
  myVar = setInterval(function(){myTimer()},1000); 
  timelimit = maxtimelimit; 
} 

function myTimer() { 
  if (timelimit > 0) { 
    curmin=Math.floor(timelimit/60); 
    cursec=timelimit%60; 
    if (curmin!=0) { curtime="остават "+curmin+" минути и "+cursec+" секунди"; } 
              else { curtime="остават "+cursec+" секунди"; } 
    $_('timeleft').innerHTML = curtime; 
  } else { 
    $_('timeleft').innerHTML = timelimit+' - Просрочихте времето - няма да получите точки за този отговор'; 
 //clearInterval(myVar); 
    //checkAnswer(); 
	renderResults()
	{   
  $_("test_status").innerHTML = "Просрочихте времето. Приключихте теста"; 
} ;
  } 
  timelimit--; 
}   



var pos = 0, posn, choice, correct = 0, rscore = 0; 
var maxtimelimit = 6000, timelimit = maxtimelimit;  // 20 seconds per question 
function setmaxtimelimit() { 
   maxtimelimit = 3600;
}




var questions = [ 
  [ "Кое съпротивление на изолацията на една електрическа машина в процеса на експлоатацята се счита за нормално?", "Над 0,1 МΩ.", "Над 0,7 МΩ.", "Над 2 МΩ.", "Над 10 МΩ.", "Б", "1. " ],
[ "С какъв уред може да се измери съпротивлението на изолацията на елементите на корабното електрообзавеждане?", "Комбиниран волт-ампер-омметър.", "Волтметър и амперметър.", "Омметър.", "Мегаомметър.", "Г", "2. " ],
[ "В кой диапазон трябва да се намира токът при нормално зареждане на киселинен акумулатор 12V 160Ah?", "1 ÷ 6 А.", "8 ÷ 16 А.", "20 ÷ 32 А.", "50 ÷ 100 А.", "Б", "3. " ],
[ "Колко трябва да бъде плътността на електролита на киселинния акумулатор в напълно заредено състояние?", "1,08 ÷ 1,10.", "1,18 ÷ 1,20.", "1,28 ÷ 1,30.", "1,38 ÷ 1,48.", "В", "4. " ],
[ "Колко ампера е токът на силов диод в трифазен токоизправител, ако товарният ток е 60А?", "60 А.", "30 А.", "20 А.", "10 А.", "В", "5. " ],
[ "В какви граници обикновено е напрежението за управление на тиристора?", "0,01 ÷ 0,1 V.", "0,1  ÷ 1 V.", "5 ÷ 1,5 V.", "50 ÷ 100 V.", "В", "6. " ],
[ "Как ще монтираме търкалящ лагер на пресова сглобка към вала на центробежна помпа?", "Ще пришлайфаме лагерната кутия с шкурка.", "Ще пришлайфаме вала, в мястото на лагера с шкурка.", "Ще използваме пластмасов чук.", "Ще нагреем в масло лагера и ще го монтираме нагрят към вала.", "Г", "7. " ],
[ "Хладилен компресор , който се управлява от пресостат , при малък недостиг на хладилен агент:", "Намалява работното си налягане.", "Постепенно увеличава времето на цикъла си на работа до непрекъсната работа.", "Увеличава работното си налягане.", "Работата му не се променя съществено.", "Б", "8. " ],
[ "При голям недостиг на хладилен агент, хладопроизводителността на компресора :", "Намалява постепенно.", "Нараства.", "Не се променя чувствително.", "Нараства скокообразно.", "А", "9. " ],
[ "Ако компресорът на хладилната инсталация работи продължително без да изключи, въпреки че е постигнал програмните температури, каква може да е причината?", "Контактът за високо налягане на пресостата е заклинил в отворено положение.", "Термичният балон на ТРВ не работи.", "Контактът за ниско налягане на маноконтролера е заклинил в затворено положение.", "Начална фаза на голям недостиг на хладилен агент.", "В", "10. " ],
[ "Какво ще се случи, ако пуснем центробежна помпа със затворен нагнетателен клапан?", "Ще претоварим по ток електродвигателя на задвижването и.", "Помпата няма да се завърти.", "Ще разтоварим задвижващия електродвигател от пускови ток.", "Ще се отвори предпазния клапан между помпата и клапана.", "В", "11. " ],
[ "Follow-up механизма при електрохидравличните рулеви машини:", "Освобождава излишното налягане в системата.", "Спира работата на помпата когато се достигне желаното положение на балера.", "Синхронизира положението на руля и балера.", "Връща балера в средно положение когато руля се освободи.", "Б", "12. " ],
[ "Ще се промени ли честотата на въртене на работещ асинхронен двигател с навит ротор, ако се увеличи съпротивлението в роторната му верига?", "Няма да се промени.", "Честотата на въртене ще се намали.", "Честотата на въртене ще се увеличи.", "Ако товарът нараства ще се увеличи.", "Б", "13. " ],
[ "Как конструктивно трябва да бъде изпълнено преминаването на електрически кабели през водонепроницаеми прегради?", "Трябва да са заземени от двете страни на преградата.", "Трябва да бъдат бандажирани радиално на дължина шест диаметъра.", "През салникова кутия подходящ размер, уплътнена с подходящ тип набивки .", "Кабелите трябва да са добре заскобени.", "В", "14. " ],
[ "Повредите на контактите във вътрешността на контролните станции на товарните винчове, причинени от конденза, могат да се намалят (превантивно избегнат) чрез: ", "Зачохляне на станцията с брезент.", "Вътрешно боядисване на контактната кутия с епоксиден уплътнител.", "Периодично вентилиране на контактната кутия .", "Използване на лентови нагреватели във вътрешноста на контактната кутия.", "Г", "15. " ],
[ "За да се поддържа половинчасова готовност на турбоелектрическа паросилова уредба трябва:", "Турбините да са непрекъснато подгряти.", "Подгрева да се включва на всеки половин час.", "Да работят на празен ход.", "За половин час режима може да бъде постигнат и при неподгрята турбина.", "В", "16. " ],
[ "Какви датчици се използват за контрол на вибрациите на ТКА ?", "Пиезо-електрични датчици, монтирани в компресорната част.", "Тензометрични датчици, монтирани на вала в компресорната част.", "Капацитивни датчици, монтирани на корпуса  в областа на крепежите.", "Индуктивни датчици на работното колело на компресора.", "А", "17. " ],
[ "На табелката на трифазен АД е означено 230/380 V. Как ще свържем фазите на статорната му намотка  за включването му към стандартно напрежение от 380 V ?", "Паралелно.", "Последователно.", "Триъгълник.", "Звезда.", "Г", "18. " ],
[ "Колко пускателя се използват за пускане, спиране и реверсиране на двускоростен АД, в каналите на статора на който са разположени две независими трифазни намотки?", "Три реверсивни магнитни пускателя.", "Четири реверсивни магнитни пускателя.", "Два реверсивни магнитни пускателя.", "Един реверсивен магнитен пускател.", "В", "19. " ],
[ "Коя от изброените документации е в списъка на технологичните в структурата на документите на електрообзавеждането на кораба?", "Проектна.", "Принципни електротехнически схеми.", "Чертежи за разположение на апаратурата в основните места.", "Електромонтажна.", "А", "20. " ],
[ "При коя от посочените аварии генераторът за постоянен ток може да дава по-високо, но и по-ниско от нормалното напрежение?", "Съпротивлението на веригата  за възбуждане е малко поради неизправност в нея.", "Четките са изместени от неутралната линия.", "Увеличен е луфта под главните полюси.", "Последователно свързаната намотка на генератора е включена срещу паралелната.", "Б", "21. " ],
[ "Колко пъти ще се увеличи топлинното натоварване върху статорните намотки, ако токовото натоварване на асинхронен генератор се удвои?", "Остава същото.", "Два пъти.", "Четири пъти.", "Осем пъти.", "В", "22. " ],
[ "Съпротивление с неизвестна стойност може да бъде проверено/измерено използвайки метода волтметър-амперметър. Как трябва да са свързани двата прибора към съпротивлението?", "Двата прибора последователно на съпротивлението.", "Двата прибора паралелно на съпротивлението.", "Амперметъра последователно а волтметъра паралелно на съпротивлението.", "Амперметъра паралелно а волтметъра последователно на съпротивлението.", "В", "23. " ],
[ "Какъв тип зареждане / зарядно устройство / трябва да се използва за зарядка на киселинни акумулатори за да се подържа “пълна зарядка” при условие, че не се използват продължителен период? ", "Нормална зарядка/устрoйство.", "Устройство за бърза зарядка (quick charging).", "Устройство за бавна, продължителна зарядка (trickle charging).", "Устройство за зареждане със висок ампераж.", "В", "24. " ],
[ "Защитата от претоварване на рулево електрозадвижване въздейства на:", "Изключва захранването на електрозадвижването.", "Включва сигнализацията.", "Изключва захранването на електрозадвижването и влючва сигнализацията.", "Включва резервната електрохидравлична помпа.", "Б", "25. " ],
[ "Коя защита на рулевото задвижване предизвиква изключване на електродвигателя?", "Защитата по ниско напрежение.", "Защитата от претоварване.", "Защитата от късо съединение.", "Всички изброени.", "В", "26. " ],
[ "Контакторът се включва, но след отпускане на бутона “старт” се изключва веднага. Каква е причината?", "Прекъсната верига на блок-контакта, шунтиращ бутона “старт”.", "Неплътно прилегнала котва поради замърсяване .", "Много голям натяг на изключващата пружина.", "Всички изброени.", "А", "27. " ],
[ "С каква цел се въвежда закъснение на заработването на генераторния автоматичен прекъсвач при възникване на късо съединение?", "Закъснение в заработването на генераторния прекъсвач при късо съединение не се предвижда.", "Закъснението се въвежда за предпазване от лъжливи сработвания на защитата.", "Закъснение се предвижда при реализиране на селективност по време.", "Закъснението е необходимо за съчетаване на работата на защитата от късо съединение с Майеровата защита.", "В", "28. " ],
[ "Какво ще стане при пробив на изолацията на фаза към корпус на ел.машина, включена в трифазна мрежа без изведен нулев проводник и изолиран звезден център?", "Ще изгори предпазител.", "Ще изгори намотка на ел. двигател.", "Ел. двигателят работи нормално, но става опасен за екипажа.", "Ел. двигателят няма да може да се пусне.", "В", "29. " ],
[ "Статизмът на регулаторните характеристики е от съществено значение за експлоатацията на КДВГ при :", "Ускоряване на кораба.", "При паралелна работа.", "Работа в маневрени режими.", "Работа при изключен ТКА.", "Б", "30. " ],
[ "С каква цел в системите за кондициониране е поставя диференциален пресостат?", "Подобряване на регулирането на компресора.", "За предпазване от авария компресора.", "Предпазване от вакуумиране.", "По-добро регулиране на налягането на изпарение.", "Б", "31. " ],
[ "Предназначението на стартера в пусковата система е:", "Да създаде външен момент развъртащ коляновия вал ДВГ.", "Устройство разпределящо въздуха в цилиндрите.", "Източник на енергия.", "Зависи от конструкцията на двигателя.", "А", "32. " ],
[ "Как е свързан стартера на ДВГ с вала на двигателя?", "Непрекъснато.", "Само по време на пуск.", "Зависи от пусковата система.", "Зависи от конструкцията на двигателя.", "Б", "33. " ],
[ "Електростартерът представлява:", "Електродвигател.", "Акумулаторно устройство.", "Трансформатор.", "Нищо от изброеното.", "А", "34. " ],
[ "Нагревните свещи са спомагателни устройства при:", "КДВГ с малка мощност.", "“V” образни КДВГ.", "Кръстоглавни КДВГ.", "Нищо от изброеното.", "А", "35. " ],
[ "При аварийно ниско ниво на водата в парния котел автоматиката на котела: ", "Изключва горелката.", "Включва ел.захранването на питателната помпа.", "Изключва ел.захранването на питателната помпа.", "Нито едно от изброените.", "А", "36. " ],
[ "Електромагнитните горивни клапани на горелката на котела трябва да бъдат от тип “принудително възстановяване”:", "Така, че операторът да може да изключи всяка горелка по време на блекаут.", "Така, че операторът да може да изключи всяка горелка след блекаут.", "За предотвратяване напълването на пещта с гориво при прекъсване на електрозахранването.", "За предотвратяване напълването на пещта с гориво при възстановяване на електрозахранването.", "Г", "37. " ],
[ "При кoй от следните случаи е възможен взрив в спомагателен ПК?", "Много бързо отваряне на въздушния регистър.", "Много висока температура на горивото.", "Много високо налягане на горивото.", "Опит за запалване от температурата на пещта.", "Г", "38. " ],
[ "При стартиране на въздушен компресор продухвателният клапан трябва да бъде отворен. Защо?", "За да сме сигурни, че компресорът няма обратно налягане поради пропуск на смукателен клапан.", "За да сме сигурни, че всички нагнетателни клапани на тръбопровода ВН към бутилките за пусков въздух са отворени.", "За да сме сигурни, че няма вода в цилиндрите при стартиране на компресора.", "За да се уверим, че електродвигателят не е с малък въртящ момент при стартиране.", "В", "39. " ],
[ "Коя е нормалната експлоатационна граница на иглата на изодрома на регулатора тип UG-8?", "Отворена на (¼ ÷¾) оборот.", "Напълно отворена.", "Отворена максимум  до ¼  оборот.", "Отворена на (1÷1,5) оборот.", "А", "40. " ],
[ "Как влияе отварянето на иглата на изодрома върху работата на САР на оборотите?", "Системата става мудна.", "Системата става по-бърза, но и по-склонна към колебания.", "Изменя се статизмът на процеса.", "Нито един от посочените способи.", "Б", "41. " ],
[ "Как влияят хлабините в лостовата система между регулатора на обороти и горивните рейки?", "Не оказват влияние.", "Системата става мудна.", "Появяват се непрекъснати колебания на оборотите.", "Системата става по-бърза.", "В", "42. " ],
[ "Преди запалване на горелката на котела кое от споменатите действия има най-голямо значение?", "Проверка действието на предпазителните клапани.", "Проверка наличието на вода в котела чрез извършване на долно продухване.", "Добро вентилиране на пещта преди запалване на горелката.", "Отваряне на главния парен кран.", "В", "43. " ],
[ "Как трябва да работи сепараторът, за да се получат най-добри резултати при сепарирането?", "Сепариране при необходимата температура и ниска скорост.", "Висока скорост и ниска температура.", "Висока скорост и висока температура.", "Скоростта и температурата не оказват влияние.", "А", "44. " ],
[ "Галваничната /ел. химическа/ защита на корабния корпус предпазва от:", "Корозионно износване на анодните участъци.", "Корозионно износване на катодните участъци.", "Корозионно износване и обрастване на анодните участъци.", "От всички посочени повреди.", "Б", "45. " ],
[ "Целта на дефектацията е:", "Да се открият наличието, характерът и големината на повредите.", "Да се установят причините, предизвикали появяването на тези повреди.", "Да се набележи пътят и определи технологията за отстраняване на повредите.", "Всички изброени причини.", "Г", "46. " ],
[ "За откриване наличието, характера и големината на повредите е необходимо да се извърши:", "Прегледи и транспорт в кораборемонтен завод.", "Измервания и снимки.", "Проверки.", "Прегледи, проверки и измервания.", "Г", "47. " ],
[ "Целта на измерване на детайлите е да се установи: ", "Фирмата производител.", "Стуктурата на материала от който са изработени детайлите.", "Качеството на детайлите.", "Отклоненията от първоначалните размери и увеличението на хлбината между задружно работещите детайли.", "Г", "48. " ],
[ "Как трябва да се извършва описанието на ремонтната ведомост?", "Общо описание.", "Посочване съответния механизъм.", "По преценка на кораборемонтния завод.", "Ясно, изключващо различни тълкувания.", "Г", "49. " ],
[ "При достигане на каква плътност на електролита трябва да се прекрати зареждането на основните акумулатори?", "Плътността на електролита на основните акумулатори е постоянна и не зависи от степента на зареденост.", "1,28.", "1,58.", "2,28.", "А", "50. " ],
[ "Стартирането на ГД се деблокира окончателно при следните случаи:", "Поставяне на щамбайна в позиция за реверсиране.", "По време на реверсиране на разпределителния вал.", "След завъртане на разпределителния вал в крайна позиция.", "При продължителна работа на двигателя на леко гориво.", "В", "51. " ],
[ "В кой от изброените случаи се деблокира горивоподаването?", "След поставяне на щамбайна в позиция за реверсиране.", "След завъртване на разпределителния вал в крайна позиция.", "След завъртане на ГД в правилната посока.", "По време на реверсиране на разпределителния вал.", "В", "52. " ],
[ "Защо ел.двигател за постоянен ток се включва към захранващатата мрежа през пускови съпротивления?", "Запазване мрежата от претоварване.", "Плавно регулиране честотата на въртене.", "Ограничаване големината на пусковия ток.", "Подобряване КПД на задвижването.", "В", "53. " ],
[ "Защо в установен режим на двигател за постоянен ток пусковите съпротивления трябва да бъдат изключени?", "За достигане на максимална честота на въртене.", "За икономия на електроенергия.", "Подготовка за ново пускане.", "За предпазване съпротивленията от прегряване.", "Г", "54. " ],
[ "Каква е причината асинхронен двигател с накъсо съединен ротор да бръмчи, а да не се развъртва (включен в мрежата) при механично изправни ел. двигател и работна мрежа?", "Задействана защита от претоварване.", "Изгорял предпазител в една от фазите.", "Пробив на изолация към корпус.", "Недостатъчен магнитен поток.", "Б", "55. " ],
[ "Как може да се промени посоката на въртене на трифазен асинхронен двигател?", "Чрез превключване на броя на полюсите на статорната му намотка.", "Чрез промяна на посоката на тока в роторната му намотка.", "Чрез промяна на включването на два от трите изводи на роторната намотка.", "Чрез промяна на включването на два от трите захранващи линейни проводника.", "Г", "56. " ],
[ "Колко е ориентировъчно ниското налягане на изключване на компресора на провизионна хладилна инсталация?", " + 5.0 Bar.", " + 2 Bar.", " - 0.5 Bar.", " - 0.8 Bar.", "Б", "57. " ],
[ "Какво означава понятието “статизъм” при САР на оборотите на КДВГ?", "Зависимостта на оборотите в установени режими от натоварването.", "Независимостта на оборотите в установени режими от натоварването.", "Зависимостта на оборотите от времето.", "Закъснението в изпълнението на командите от регулиращия орган.", "А", "58. " ],
[ "Какъв закон осигуряват регулаторите на обороти с пряко действие?", "Интегрален.", "Пропорционален.", "Пропорционално - интегрален.", "Пропорционално-интегрално-диференциален.", "Б", "59. " ],
[ "Какви предимства осигурява системата за автоматичен контрол на горивния процес при корабните парни котли?", "Икономия на гориво поради по-добра организация на горивния процес.", "Намаляване на количеството на дима и саждообразуването.", "Контролира температурата в пещта, предпазвайки зидарията на котела от разрушаване.", "Всичко изброено.", "Г", "60. " ],
[ "Коя функция е основна за системата за автоматичен контрол на горивния процес?", "Да регулира количеството на горивото за обеспечаване на изискуемата паропроизводителност.", "Да осигурява точното количество въздух, необходим за горенето при оптимален коефициент на излишен въздух.", "Да контролира отношението въздух-гориво за целия диапазон от натоварвания за най-висока ефективност.", "Всичко изброено.", "Г", "61. " ],
[ "Кой от посочените типове регулатори за обороти няма регулираща функция, а само защитава двигателя от разгон? ", "Еднорежимен.", "Всережимен.", "Граничен.", "Няма такъв сред изброените.", "В", "62. " ],
[ "Коя регулаторна характеристика на КДВГ се нарича астатична:", "При която няма изменение на честотата на въртене.", "При която изменението на честотата на въртене е в рамките на статизма.", "При която има изменение на честотата на въртене само на празен ход.", "При която изменението на честотата на въртене е по П-закон.", "А", "63. " ],
[ "Коя регулаторна характеристика на КДВГ има статизъм:", "При която няма изменение на честотата на въртене.", "При която изменението на честотата на въртене е в рамките на статизма.", "При която има изменение на честотата на въртене само на празен ход.", "При която има изменение на честотата на въртене само при неустановени режими.", "Б", "64. " ],
[ "Има ли разлика между товарната и астатичната регулаторна характеристика на КДВГ?", "Няма разлика.", "Има съществена разлика.", "Разликата е във формата на кривите.", "Б) и В)", "А", "65. " ],
[ "Кога се налага регулаторната характеристика на КДВГ да има статизъм: ", "За да може да реагира по-бързо регулатора.", "За да може да реагира по-бавно регулатора.", "За да може да се реализира паралелна работа на двигателите.", "Статизма не е от съществено значение.", "В", "66. " ],
[ "Какви трябва да бъдат регулаторните характеристики когато има два Гл.КДВГ:", "Астатични характеристики.", "Със статизъм.", "Вида на регулаторните характеристики е без значение.", "Статизма не е от съществено значение.", "Б", "67. " ],
[ "Сулфатизацията на плочите на един киселинен акумулатор се предотвратява чрез:", "Поддържане на минимален заряден ток през цялото време.", "Поддържане гъстотата на електролита в рамките препоръчани от производителя.", "Поддържане на силен киселинен разтвор.", "А или Б.", "Б", "68. " ],
[ "Какъв е начинът на практика да се разбере дали един електродвигател е претоварен:", "На пипане да се провери за прегряване.", "Да се намали товара и да се отчетат показанията на измерителните прибори.", "Да се измери тока и да се сравни с фирмената табелка.", "Да се проверят термодвойките.", "В", "69. " ],
[ "3ащо трябва да се вентилира акумулаторното помещение?", "За да се предпазят хората от агресивна среда.", "За да се охлаждат акумулаторните батерии.", " За предотвратяване взрив в акумулаторното помещение.", "Нищо от изброените.", "В", "70. " ],
[ "Как е правилно да се следи за заредеността на акумулаторите:", "По гъстотата на електролита за киселинните  и по напрежението за основните.", "По гъстотата на електролита и за двата вида акумулатори.", "По напрежението и за двата вида акумулатори.", "Нищо от изброените.", "А", "71. " ],
[ "Подава се команда за пускане на асинхронен двигател но двигателя бръмчи и не се развърта, какво трябва да се направи?", "Да се повтори опита за стартиране.", "Да се натисне бутона “стоп” и и да се провери за прекъсване на фаза.", "Да се смени редуването на фазите.", "Нищо от изброените.", "Б", "72. " ],
[ "Какво най-напред трябва да се направи в случай на попаднал човек под токов удар?", "Да се изключи електрозахранването.", "Да се отстрани човека от мястото на допира.", "Да се провери човека дали диша.", "Нищо от изброените.", "А", "73. " ],
[ "С какво трябва да се доливат акумулаторите (основни и киселинни) при спадане нивото на електролита вследствие на изпарение?", "С електролит със същата концентрация.", "С дестилирана вода.", "С питейна вода.", "Нищо от изброените.", "Б", "74. " ],
[ "Ако на синхронен генератор, работещ в паралел, се промени стойността на тока на възбуждането, какво ще стане?", "Ще се промени активното натоварване.", "Ще се промени честотата на генерираното напрежение.", "Ще се променят стойностите на генерираното напрежение и реактивния товар.", "Нищо от изброените.", "В", "75. " ],
[ "Плътността на електролита на киселинен акумулатор е 1,28. На каква част от номиналния капацитет (в проценти) може да се разчита при разреждането му?", "0,2", "0,5", "100%.", "Нищо от изброените.", "В", "76. " ],
[ "Защитата на СГ от преминаване в двигателен режим се осъществява с помощта на:", "Максимални изключватели.", "Минимално напреженов изключвател.", "Реле за обратна мощност.", "Нищо от изброените.", "В", "77. " ],
[ "Кой е основният недостатък на желязно-никеловите акумулатори спрямо оловните?", "По-високата стойност.", "По-малката устойчивост на удар.", "По-ниският К.П.Д .", "По-малката устойчивост на претоварване.", "В", "78. " ],
[ "При теста на електрическа машина след ремонт кои параметри проверяваме в действие първо?", "Температурите на отделните части на  електрическата машина.", "Работата на колектора и четките.", "Стойността на напрежението, развивано от генератора или тока на празен ход от електродвигателя.", " Боядисването на корпуса на  машините.", "В", "79. " ],
[ "Каква е препоръчителната норма за износване за 1 000 работни часа съответно на колектора /пръстените/ и  на четките?", "0.2 мм. и 5 мм.", "0.2 мм. и 8 мм.", "0.5 мм. и 2 мм.", "0.5 мм. и 8 мм.", "А", "80. " ],
[ "На какво се дължи искренето под целия край на четките при  постояннотокови машини с праволинейна комутация?", "Натоварвания над 70%.", "Повишена влажност на околната среда.", "Следи от почерняване на колектора и следи от  нагар по четките.", "Всичко изброено.", "В", "81. " ],
[ "За кои акумулатори е характерно бурно газоотделяне в края на зареждането ?", "Киселинните.", "Основните.", "Йонните.", "Никел -металхидритните.", "А", "82. " ],
[ "Кой от видовете зареждания на алкалните акумулатори се използва  само в случай на крайна  необходимост?", "Нормално.", "Усилено.", "Предварително.", "Ускорено.", "Г", "83. " ],
[ "Какво трябва да се направи, за да се увеличи индуктивният товар на паралелно работещ синхронен генератор?", "Трябва да се увеличи възбудителният му ток.", " Трябва да се намали възбудителният му ток.", "Трябва да се увеличи въртящият момент на вала му.", "Трябва да се намали въртящият момент на вала му.", "А", "84. " ],
[ "Може ли електродвигател за продължителен режим на работа да се използва за кратковременен или повторно-кратковременен режим ?", "Може, но трябва да се преизчисли мощността му.", "Не може, защото ще се прегрее.", "Не може, защото няма да има необходимия въртящ момент.", "Може, ако се включи през пускови съпротивления.", "А", "85. " ],
[ "Защо в съвременните терморегулатори се използва като параметър на настройка “мъртва зона”?", "За да се увеличи животът на скъпоструващия изпълнителен орган.", "За да се подобри динамиката на системата.", "За да се намали статичната грешка на системата.", "Всичко изброено.", "А", "86. " ],
[ "При паралелна работа на два  ДГ  кой от тях ще се натовари повече при увеличаване на общия товар?", "Този с по-голям статизъм.", "Този с по-малък статизъм.", "Статизмът не оказва влияние.", "Нищо от изброените.", "Б", "87. " ],
[ "При калибровката на измервателния уред, коя обикновено е първата стъпка?", "Настройка на линейността и обхвата.", "Настройка на нулевата точка и обхвата.", "Настройка на диапазона и амплитудата.", "Настройка на диапазона и нулевата точка.", "Б", "88. " ],
[ "“Замасяване” на електрическа машина вследствие на нарушение на изолацията може да бъде причинено от:", "Влошаване поради дълга употреба без техн.подържане.", "Прегряване.", "Продължителна работа във вибрационна среда.", "Всички изброени.", "Г", "89. " ],
[ "При използване на волтметър за проследяване на повреди/неизправности на електронни вериги, за намаляване на “натоварването” на веригата обикновенно волтметъра се използва с/чрез/през:", "Входящо съпротивление по-голямо от съпротивлението, през което е измерен волтажа.", "Входящо съпротивление по-малко от съпротивлението през което е измерен волтажа.", "Чувствителност по-малка от 1000 ом/волта.", "Чувствителност по-голяма от 1000 ом/волта.", "А", "90. " ],
[ "Кое от изброените причинява най-сериозна повреда на електрооборудване в бездействие (например ел.мотори на карго помпи на кораби в продължителен преход)?", "Загубват остатъчния си магнетизъм.", "Абсорбират влага в изолацията.", "Изолационният лак се напуква.", "Натрупва се мръсотия по намотките.", "Б", "91. " ],
[ "При разчитането на схеми за управление на електродвигатели е полезно да знаем че:", "Контролните вериги са начертани с удебелени линии а силовите с тънки линии.", "Контролните вериги са начертани с  тънки линии а силовите с надебелени линии.", "Линиите, през които протича ток с напрежение с и над 500 волта са начертани с надебелени линии, а останалите с тънки.", "Линиите, през които протича ток с напрежение с и над 500 волта са начертани с  тънки линии, а останалите с надебелени  линии.", "Б", "92. " ],
[ "Кое е най-точно като отговор на въпроса: Защо трябва да се вентилира акумулаторното помещение ?", "За охлаждане на акумулаторните батерии.", "За предотвратяване от корозия помещението.", "За предотвратяване на взрив.", "Намаляване на рисковете за здравето на хората.", "В", "93. " ],
[ "Заземяване на електродвигател може да се дифинира като връзка на корпуса му и:", "Шунтовото поле.", "Главния прекъсвач.", "Металния фундамент.", "Полюсите.", "В", "94. " ],
[ "Колко ампера е токът на силов диод в трифазен токоизправител ако товарния ток е 60 А", "20 А.", "10 А.", "35 А.", "60 А.", "А", "95. " ],
[ "Преди измерване на изолация с мегаомметър, намотките на големите електрически машини трябва да се замасят за около 15 минути преди началото на измерването защото:", "Възможно е да се повреди изолацията.", "Възможно е изолацията да е овлажнена.", "Намотките на котвата ще имат редица утечки.", "Големите машини е възможно да натрупат статическо електричество.", "Г", "96. " ],
[ "При паралелна работа на два  ДГ  кой от тях ще се натовари повече при увеличаване на общия товар?", "Този с по-голям статизъм.", "Този с по-малък статизъм.", "Статизмът не оказва влияние.", "Нищо от изброените.", "Б", "97. " ],
[ "Плътността на електролита на киселинен акумулатор е 1,28. На каква част от номиналния капацитет (в проценти) може да се разчита при разреждането му?", "0,2", "0,5", "100%.", "Нищо от изброените.", "В", "98. " ],
[ "Подава се команда за пускане на асинхронен двигател но двигателя бръмчи и не се развърта, какво трябва да се направи?", "Да се повтори опита за стартиране.", "Да се натисне бутона “стоп” и и да се провери за прекъсване на фаза.", "Да се смени редуването на фазите.", "Нищо от изброените.", "Б", "99. " ],
[ "Follow-up механизма при електрохидравличните рулеви машини:", "Освобождава излишното налягане в системата.", "Спира работата на помпата когато се достигне желаното положение на балера.", "Синхронизира положението на руля и балера.", "Връща балера в средно положение когато руля се освободи.", "Б", "100. " ],
[ "Какво ще стане при пробив на изолацията на фаза към корпус на ел.машина, включена в трифазна мрежа без изведен нулев проводник и изолиран звезден център?", "Ще изгори предпазител.", "Ще изгори намотка на ел. двигател.", "Ел. двигателят работи нормално, но става опасен за екипажа.", "Ел. двигателят няма да може да се пусне.", "В", "101. " ],
[ "Какво най-напред трябва да се направи в случай на попаднал човек под токов удар?", "Да се изключи електрозахранването.", "Да се отстрани човека от мястото на допира.", "Да се провери човека дали диша.", "Нищо от изброените.", "А", "102. " ],
[ "Сулфатизацията на плочите на един киселинен акумулатор се предотвратява чрез:", "Поддържане на минимален заряден ток през цялото време.", "Поддържане гъстотата на електролита в рамките препоръчани от производителя.", "Поддържане на силен киселинен разтвор.", "А или Б.", "Б", "103. " ],
[ "На табелката на трифазен АД е означено 230/380 V. Как ще свържем фазите на статорната му намотка  за включването му към стандартно напрежение от 380 V ?", "Паралелно.", "Последователно.", "Триъгълник.", "Звезда.", "Г", "104. " ],
[ "Ще се промени ли честотата на въртене на работещ асинхронен двигател с навит ротор, ако се увеличи съпротивлението в роторната му верига?", "Няма да се промени.", "Честотата на въртене ще се намали.", "Честотата на въртене ще се увеличи.", "Ако товарът нараства ще се увеличи.", "Б", "105. " ],
[ "При аварийно ниско ниво на водата в парния котел автоматиката на котела: ", "Изключва горелката.", "Включва ел.захранването на питателната помпа.", "Изключва ел.захранването на питателната помпа.", "Нито едно от изброените.", "А", "106. " ],
[ "При коя от посочените аварии генераторът за постоянен ток може да дава по-високо, но и по-ниско от нормалното напрежение?", "Съпротивлението на веригата  за възбуждане е малко поради неизправност в нея.", "Четките са изместени от неутралната линия.", "Увеличен е луфта под главните полюси.", "Последователно свързаната намотка на генератора е включена срещу паралелната.", "Б", "107. " ],
[ "При теста на електрическа машина след ремонт кои параметри проверяваме в действие първо?", "Температурите на отделните части на  електрическата машина.", "Работата на колектора и четките.", "Стойността на напрежението, развивано от генератора или тока на празен ход от електродвигателя.", " Боядисването на корпуса на  машините.", "В", "108. " ],
[ "Кога се налага регулаторната характеристика на КДВГ да има статизъм: ", "За да може да реагира по-бързо регулатора.", "За да може да реагира по-бавно регулатора.", "За да може да се реализира паралелна работа на двигателите.", "Статизма не е от съществено значение.", "В", "109. " ],
[ "Какъв тип зареждане / зарядно устройство / трябва да се използва за зарядка на киселинни акумулатори за да се подържа “пълна зарядка” при условие, че не се използват продължителен период? ", "Нормална зарядка/устрoйство.", "Устройство за бърза зарядка (quick charging).", "Устройство за бавна, продължителна зарядка (trickle charging).", "Устройство за зареждане със висок ампераж.", "В", "110. " ],
[ "“Замасяване” на електрическа машина вследствие на нарушение на изолацията може да бъде причинено от:", "Влошаване поради дълга употреба без техн.подържане.", "Прегряване.", "Продължителна работа във вибрационна среда.", "Всички изброени.", "Г", "111. " ],
[ "Галваничната /ел. химическа/ защита на корабния корпус предпазва от:", "Корозионно износване на анодните участъци.", "Корозионно износване на катодните участъци.", "Корозионно износване и обрастване на анодните участъци.", "От всички посочени повреди.", "Б", "112. " ],
[ "Какво трябва да се направи, за да се увеличи индуктивният товар на паралелно работещ синхронен генератор?", "Трябва да се увеличи възбудителният му ток.", " Трябва да се намали възбудителният му ток.", "Трябва да се увеличи въртящият момент на вала му.", "Трябва да се намали въртящият момент на вала му.", "А", "113. " ],
[ "Как е правилно да се следи за заредеността на акумулаторите:", "По гъстотата на електролита за киселинните  и по напрежението за основните.", "По гъстотата на електролита и за двата вида акумулатори.", "По напрежението и за двата вида акумулатори.", "Нищо от изброените.", "А", "114. " ],
[ "При използване на волтметър за проследяване на повреди/неизправности на електронни вериги, за намаляване на “натоварването” на веригата обикновенно волтметъра се използва с/чрез/през:", "Входящо съпротивление по-голямо от съпротивлението, през което е измерен волтажа.", "Входящо съпротивление по-малко от съпротивлението през което е измерен волтажа.", "Чувствителност по-малка от 1000 ом/волта.", "Чувствителност по-голяма от 1000 ом/волта.", "А", "115. " ],
]; 

var questionOrder = []; 
var maxNumberOfQuestions = questions.length;  // do NOT make BIGGER than number of 'questions' array 
function setmaxNumberOfQuestions() { 
   maxNumberOfQuestions = 60;
}
// var maxNumberOfQuestions = 2;  // do NOT make BIGGER than number of 'questions.length' array 
var maxNumberOfQuestions2 = questions.length;
function setQuestionOrder() { 
  questionOrder.length = 0; 
  for (var i=0; i<maxNumberOfQuestions2; i++) { questionOrder.push(i); } 
 //questionOrder.sort(randOrd);   // alert(questionOrder);  // shuffle display order 
  pos = document.getElementById("numb").value-1;  posn = questionOrder[pos]; 
} 

function setQuestionOrder2() { 
  questionOrder.length = 0; 
  for (var i=0; i<maxNumberOfQuestions2; i++) { questionOrder.push(i); } 
  questionOrder.sort(randOrd);   // alert(questionOrder);  // shuffle display order 
  pos = 0;  posn = questionOrder[pos]; 
} 


function $_(IDS) { return document.getElementById(IDS); } 
function randOrd() { return (Math.round(Math.random())-0.5); } 
function renderResults(){ 
  var test = $_("test"); 
  test.innerHTML = "<h2>Имате "+correct+" от "+maxNumberOfQuestions+" правилно отговорени въпроси</h2>"; 
  test.innerHTML +=  +(correct/maxNumberOfQuestions*100).toFixed(0)+'% правилни отговори<br>';
  $_("test_status").innerHTML = "Приключихте теста"; 
  $_('timeleft').innerHTML = ' '; 
  test.innerHTML += "<br><img src='images/curies.gif' align='bottom' width='500' height='247' alt='Lubopitko'><br><br>";
  test.innerHTML += "<button  class= 'button' onclick='location.reload()'>Повторете теста</button>"; 
  
 
  setQuestionOrder(); 
  correct = 0; 
  clearInterval(myVar); 
  return false; 
} 




function renderQuestion() { 
  var test = $_("test"); 
  $_("test_status").innerHTML = "Въпрос "+(pos+1)+" от "+maxNumberOfQuestions; 
  //if (rscore != 0) { $_("test_status").innerHTML += '<br>Текущ въпрос: '+(correct/rscore*100).toFixed(0)+'% правилни отговори'; } 
   if (rscore != 0 && correct == 1 && maxNumberOfQuestions != 60) { $_("test_status").innerHTML += '<br>Имате '+correct+' правилeн отговор'; }
   if (rscore != 0 && correct > 1 && maxNumberOfQuestions != 60) { $_("test_status").innerHTML += '<br>Имате '+correct+' правилни отговора'; } 
  var question = questions[posn][0]; 
  var chA = questions[posn][1]; 
  var chB = questions[posn][2]; 
  var chC = questions[posn][3];
 var chD = questions[posn][4];
 var chЕ = questions[posn][6];
  if (maxNumberOfQuestions != 60) { test.innerHTML = "<h3>"+chЕ+question+"</h3>"; } 
  else  {test.innerHTML = "<h3>"+question+"</h3>"}; 
  test.innerHTML += "<label><input type='radio' name='choices' value='А'> А) "+chA+"</label><br>"; 
  test.innerHTML += "<label><input type='radio' name='choices' value='Б'> Б) "+chB+"</label><br>"; 
  test.innerHTML += "<label><input type='radio' name='choices' value='В'> В) "+chC+"</label><br>"; 
  test.innerHTML += "<label><input type='radio' name='choices' value='Г'> Г) "+chD+"</label><br><br><br><br>";
   
  test.innerHTML += "<button  id='btn3'  class= 'button' onclick='checkAnswer3()'>Назад</button>"
  test.innerHTML += "<button  id='btn1' class= 'button' onclick='checkAnswer()'>Напред</button><br><br>";
  test.innerHTML += "<button id='btn2'  class= 'button' onclick='checkAnswer2()' >Верен отговор</button>" ;
  ;
}
  //  setupTimer();  // for indivisible timer for each question
  function setupTimer() {
  timelimit = maxtimelimit; 
  clearInterval(myVar); 
  startTimer(); 
} 

function checkAnswer2(){ 
	//var answer = $_GET("answer");
	//var btn = $_GET("check");
	var choices = document.getElementsByName("choices"); 
  for (var i=0; i<choices.length; i++) { 
    if (choices[i].checked) { choice = choices[i].value; } 
  } 
	rscore++; 
	if (choice == questions[posn][5] || choice != questions[posn][5]){
		btn1.style.visibility="hidden";
		btn2.style.visibility="hidden";
		btn3.style.visibility="hidden"
		answer.style.visibility="visible";
		answer.innerHTML = "<h3>Правилен отговор: "+questions[posn][5] +"<br></h3>";
		answer.innerHTML += "<button class= 'button' onclick='proceed()'>Продължи</button>"; 
		}
	} 

function proceed() {
	//var answer = $_GET("answer");
	//var btn = $_GET("check");
	answer.style.visibility="hidden";
	btn1.style.visibility="visible";
	btn2.style.visibility="visible";
	btn3.style.visibility="visible";
	pos++;  posn = questionOrder[pos];
	if (pos < maxNumberOfQuestions) { renderQuestion(); } else { renderResults(); } 
	}

function checkAnswer3(){ 
  var choices = document.getElementsByName("choices"); 
  for (var i=0; i<choices.length; i++) { 
    if (choices[i].checked) { choice = choices[i].value; } 
  } 
  rscore++; 
  if (choice == questions[posn][5] && timelimit > 0) { correct--; } 
  pos--;  posn = questionOrder[pos]; 
  if (pos < maxNumberOfQuestions) { renderQuestion(); } else { renderResults(); } 
} 

function checkAnswer(){ 
  var choices = document.getElementsByName("choices"); 
  for (var i=0; i<choices.length; i++) { 
    if (choices[i].checked) { choice = choices[i].value; } 
  } 
  rscore++; 
  if (choice == questions[posn][5] && timelimit > 0) { correct++; } 
  pos++;  posn = questionOrder[pos]; 
  if (pos < maxNumberOfQuestions) { renderQuestion(); } else { renderResults(); } 
} 

window.onload = function() { 
  Start() ;
    // for total time for entire quiz
} 