function getOption() {
    var obj = document.getElementById("mySelect");
	if (obj.options[obj.selectedIndex].value == "A") {  Learn() };
	if (obj.options[obj.selectedIndex].value == "B") { Exam() };
};

function Start(){

	java.style.display="none";
	numb.style.display="none";
	btn4.style.display="none";
	test_status.style.display="none";
	timeleft.style.display="none";
	test.style.display="none";
};
function Learn() {
	form1.style.display="none";
	setFirstQuestion();
	
	};
	
	function Exam() {
		
	form1.style.display="none";
	test_status.style.display="block";
    test.style.display="block";
	timeleft.style.display="block";
	
	setmaxtimelimit() ;
	setmaxNumberOfQuestions();
	setQuestionOrder2(); 
    renderQuestion(); 
    setupTimer();
	};
	
function setFirstQuestion() {
    var x, text;

    // Get the value of the input field with id="numb"
    x = document.getElementById("numb").value;

    // If x is Not a Number or less than one or greater than 10
    if (isNaN(x) || x < 1 || x > maxNumberOfQuestions2) {
        text = "<h5>Въведете стойност между 1 и "+maxNumberOfQuestions+"</h5>";
		
		java.style.display="block";
	numb.style.display="inline";
	btn4.style.display="inline";
		
		
		
    } else {
        text = "Input OK";
		test_status.style.display="block";
		test.style.display="block";
		//timeleft.style.visibility="visible";
		java.style.display="none";
	numb.style.display="none";
	btn4.style.display="none";
	demo.style.display="none";
		setQuestionOrder(); 
        renderQuestion(); 
		//setupTimer();
    }
    document.getElementById("demo").innerHTML = text;
}

var myVar; 
function startTimer() { 
  myVar = setInterval(function(){myTimer()},1000); 
  timelimit = maxtimelimit; 
} 

function myTimer() { 
  if (timelimit > 0) { 
    curmin=Math.floor(timelimit/60); 
    cursec=timelimit%60; 
    if (curmin!=0) { curtime="остават "+curmin+" минути и "+cursec+" секунди"; } 
              else { curtime="остават "+cursec+" секунди"; } 
    $_('timeleft').innerHTML = curtime; 
  } else { 
    $_('timeleft').innerHTML = timelimit+' - Просрочихте времето - няма да получите точки за този отговор'; 
 //clearInterval(myVar); 
    //checkAnswer(); 
	renderResults()
	{   
  $_("test_status").innerHTML = "Просрочихте времето. Приключихте теста"; 
} ;
  } 
  timelimit--; 
}   



var pos = 0, posn, choice, correct = 0, rscore = 0; 
var maxtimelimit = 6000, timelimit = maxtimelimit;  // 20 seconds per question 
function setmaxtimelimit() { 
   maxtimelimit = 3600;
}




var questions = [ 
    [ "Подава се команда за пускане на асинхронен двигател но двигателя бръмчи и не се развърта, какво трябва да се направи?", "Да се повтори опита за стартиране.","Да се натисне бутона “стоп” и и да се провери за прекъсване на фаза.","Да се смени редуването на фазите.","Нищо от изброените.","Б", "1. "], 
    [ "Към последователно свързани резистори е приложено напрежение. Как ще се разпредели напрежението върху резисторите?", "Пропорционално на съпротивлението на резисторите.","Пропорционално на мощността на резисторите.", "В зависимост от габарита на резисторите.","Нищо от изброените.","А","2. "], 
	[ "При какъв асинхронен ел.двигател е възможно използването на пускател звезда/триъгълник:", "С фазови статорни намотки оразмерени за линейното напрежение.","С фазови роторни намотки оразмерени за линейното напрежение.", "За всеки двигател с накъсо съединен ротор.","Нищо от изброените.","А", "3. "],
	[ "При подаване команда за промяна честотата на въртене на многоскоростен асинхронен двигател, какво се променя в двигателя?", "Честотата на захранващото напрежение.","Броя на чифтовете магнитни полюси.", "Съпротивлението в ротора.","Нищо от изброените.","Б", "4. "],
	[ "Как се реверсира двигател за постоянен ток?", "Като се смени посоката на котвения ток.","Като се смени посоката на тока на възбуждане.", "И по двата начина посочени в A) и B).","Нищо от изброените.","А", "5. "],
    [ "Защо се ограничава пусковия ток на двигателите за постоянен ток?", "За да не изгори котвената намотка.", "За да се ограничи искренето между четките и колектора.", "За да не се претовари намотката на възбуждане.","Нищо от изброените.", "Б", "6. "], 
	[ "За осигурявяне на по-голям ток акумулаторите се свързват:", "Последователно.", "Паралелно.", "По схемата на Грец.","Нищо от изброените.", "Б", "7. "],
    [ "Как е правилно да се следи за заредеността на акумулаторите:", "По гъстотата на електролита за киселинните и по напрежението за основните.", "По гъстотата на електролита и за двата вида акумулатори.", "По напрежението и за двата вида акумулатори.", "Нищо от изброените.","А", "8. "], 
    [ "Как се разпределя активното натоварване между паралелно работещи синхронни генератори?", "Като се регулира мощността на първичните двигатели.", "Като се регулира възбуждането на генераторите.", "Като се регулират защитите от претоварване на генераторите.","Нищо от изброените.", "А", "9. "], 
    [ "Защо трябва да се вентилира акумулаторното помещение?", "За да се предпазят хората от агресивна среда.", "За да се охлаждат акумулаторните батерии.", "За предотвратяване взрив в акумулаторното помещение.","Нищо от изброените.", "В", "10. "], 
    [ "Коя защита на рулевото задвижване предизвиква изключване на ел.двигателя:","Минимално напреженовата.", "Защитата от претоварване.", "Защитата от късо съединение.","Нищо от изброените.", "В", "11. "], 
    [ "Коя защита на асинхронен двигател се нарича още “защита от самопускане”?", "Топлинната защита.", "Защитата от прекъсване на фаза.", "Минимално напреженовата защита.","Нищо от изброените.", "В", "12. "], 
    [ "Кое от следните не се изисква за синхронизиране на променливотокови генератори?", "Еднакво напрежение.", "Еднаква фаза.", "Еднакви обороти, изразени като честота.", "Еднакъв товар.", "Г", "13. "],
    [ "Какъв е начинът на практика да се рабере дали един постояннотоков мотор е претоварен?", "На пипане да се провери за прегряване.", "Да се намали товара и да се отчетат показанията на измерителните прибори.", "Да се измери тока и да се сравни с фирмената табелка.", "Да се проверят термодвойките.","В", "14. "], 
	[ "Оборотите на един асинхронен мотор в сравнение с оборотите на въртящото се магнитно поле в него:", "Са същите.", "Са незначително по-малки.", "Незначително ги превишават.", "Са равни на половината обороти.","Б", "15. "],
	[ "Съпротивлението на един проводник се променя:", "Обратно пропорционално на квадрата на диаметъра.", "Право пропорционално на квадрата на диаметъра.", "Право пропорционално на сечението.", "Обратно пропорционално на неговата дължина.","А", "16. " ],
	[ "Кое от следните устройства не се захранва от аварийните източници на ел.eнергия?", "Лодъчните устройства.", "Системите за пожарна сигнализация.", "Звуковите сигнални средства.", "Авралната сигнализация.","А", "17. " ],
	[ "Разпределението на реактивния товар се извършва чрез:", "Изменение тока на възбуждане.", "Изменение на активния товар.", "Изменение честотата на генератора.", "Изменение напреженението на мрежата.","А", "18. " ],
	[ "Честотата на напрежението на работещия дизелгенератор зависи от:", "Статизма на регулатора на първичния двигател.", "Честотата на въртене на първичния двигател.", "Възбуждането на генератора.", "Нищо от изброените.","Б", "19. " ],
	[ "Активната мощност се разпределя между паралелно работещи генератори за променлив ток, като се регулира:", "Честотата на въртене на първичния двигател.", "Мощността на първичния двигател.", "Възбуждането на генераторите.", "Нищо от изброените.","Б", "20. " ],
	[ "Какво се получава при претоварване на рулевото електрозадвижване:", "Защитата изключва електрозахранването.", "Включва се сигнализация.","Защитата изключва електрозахранването и се включва сигнализацията.", "Нищо от изброените.","Б", "21. " ],
	[ "Преди да бъде изключен единият от паралелно работещите генератори, разтоварването му по отношение на активния товар се извършва чрез въздействие върху:", "Регулатора за обороти на първичния двигател.", "Регулатора на напрежение на генератора.", "Генераторния автомат.", "Нищо от изброените.","А", "22. " ],
	[ "Какво ще стане при пробив на изолацията на фаза към корпус на ел.машина, включена в трифазна мрежа без изведен нулев проводник и изолиран звезден център?", "Ще изгори предпазител.", "Ще изгори намотка на ел.двигател.", "Ел.двигателят работи нормално, но става опасен за екипажа.", "Нищо от изброените.","А", "23. " ],
	[ "Коя намотка при машините за постоянен ток наричаме листовидна?", "Последователната намотка.", "Паралелната намотка .", "Серийната намотка.", "Вълнообразната намотка.","Б", "24. " ],
	[ "Кое твърдение е валидно за комутацията в машините с колектор?", "Токът протича винаги в една и съща посока- от положителната четка през консуматора до отрицателната четка.", "При машините за постоянен ток колекторът и проводниците се въртят , а магнитите и четките-не.", "Вътре в машината , т.е. В самите проводници, се индуктира променлив ток.", "Всичко изброено.","Г", "25. " ],
	[ "Кои системи за мониторинг и контрол са изградени на базата на радарната технология ?", "Системите за мониторинг и контрол на параметрите на рулевото устройство.", "Системите за мониторинг и контрол на параметрите на автопилота.", "Системите за мониторинг и контрол на параметрите на нефтоналивни танкове .", "Системите за мониторинг и контрол на параметрите на противопожарната сигнализация.","В", "26. " ],
	[ "Кой елемент на електрониката /ОУ/ се използва, когато трябва да се следи даден параметър дали е под или над даден праг ?", "Шифратор.", "Компаратор.", "Мултиплексор.", "Тригер.","В", "27. " ],
	[ "Скоростта на постояннотоковия двигател е:", "Правопропорционална на магнитния поток Ф и обратно пропорционална на приложеното напрежение.", "Правопропорционална на приложеното напрежение U и на магнитния поток Ф.", "Правопропорционална на приложеното напрежение U и обратно пропорционална на магнитния поток Ф.", "Обратнопропорционална на напрежението и потока.","В", "28. " ],
	[ "Колко процентно отклонение от синусоидалния характер на ЕДН в статора на синхронния генератор може да се допусне?", "0,05.", "0,03.", "0,02.", "0,07.","А", "29. " ],
	[ "Какво представлява реактанса в променливотоковите вериги?", "Реакцията на активното съпротивление.", "Определя активното съпротивление във веригата.", "Вътрешно съпротивление на източника на захранване.", "Имагинерна част от комплексното съпротивление- индуктивно и капацитивно.","Г", "30. " ],
	[ "За кои потребители защитата от претоварване не изключва потребителя, а подава само сигнал?", "Гребни електродвигатели.", "Пожарна помпа.", "Ел.задвижване на жирокомпаса.", "Рулеви машини.","Г", "31. " ],
    [ "Коя група сигнали не се подават към оповестителната система при безвахтено обслужване?", "Критични.", "Некритични.", "Наводнено МО.", "Навреме включена 'dead man' аларма.","Г", "32. " ], 
	[ "До колко минути следва да се квитира алармата за превишена стойност на параметър за да не се включи общата сигнализация на кораба?", "3 минути.", "4 минути.","5 минути.", "6 минути.","А", "33. " ],
    [ "Как определяме един сигнал за цифров?", "Сигнал, определящ 0 като ниско ниво и 1 като високо.", "Сигнал, индициращ волтаж.", "Сигнал за обороти в минута.", "Сигнал за сила на тока.","А", "34. " ], 
	[ "Кога се използва схемата емитерен повторител / общ колектор/ при биполярните транзистори?", "Когато е необходимо голямо входно съпротивление, малко изходно съпротивление или голям коефициент на усилване по ток .", "Когато колекторът трябва да се свърже с напрежения от порядъка на 10 V DC.", "Изходното напрежение е равно на входното.", "Когато е необходимо малко входно съпротивление, голямо изходно съпротивление или малък коефициент на усилване по ток.","А", "35. " ],
    [ "Ако в мрежа за променлив ток е свързан ватметър, коя от страните на триъгълника на мощностите ще отчита?", "P-активна мощност.", "Q-реактивна мощност.", "S-пълна мощност.", "Нищо от изброените.","А", "36. " ], 
	[ "Как се сменя редуването на фазите на трифазно захранване?", "Като се сменят местата на двата крайни проводника от ляво и дясно.", "Като се сменят местата на които и да са два проводника.", "Като се правят опити с трифазен асинхронен двигател докато се завърти обратно.", "Нищо от изброените.","Б", "37. " ],
    [ "Ако към трифазен източник има три еднакви импеданси свързани в звезда и се пресвържат в триъгълник, как ще се промени потребяваната мощност?" ,"Ще се увеличи три пъти.", "Ще се намали три пъти.", "Ще се запази по големина.", "Нищо от изброените.","А", "38. " ], 
	[ "Колко ампера ел. ток (средна стойност) ще се възбуди през диод в трифазен неуправляем токоизправител ако тока на товара е 60 (А)?", "60 А.", "30 А.", "20 А.", "Нищо от изброените.","В", "39. " ],
    [ "Пусковия ток на асинхронния двигател се ограничава по стойност:", "За да не се прегрее изолацията му по време на преходния процес.", "За да не се получи недопустимо голям спад на напрежението на шините на ГРТ.", "За да не се повреди задвижвания механизъм от недопустимо голям пусков момент.", "Нищо от изброените.","Б", "40. " ], 
	[ "Ако към бобина на апарат за променлив ток се приложи постоянно напрежение със същата стойност, какво ще стане?", "Ще работи нормално.", "Бобината на апарата ще изгори.", "Котвата на апарата ще вибрира.", "Нищо от изброените.","Б", "41. " ],
    [ "Как се разпределя мощността между паралелно работещи генератори за променлив ток при постоянна честота на генерираното напрежение ?", "Като се регулира честотата на въртене на първичните двигатели.", "Като се регулира мощността на първичните двигатели.", "Като се регулира възбуждането на генераторите.", "Нищо от изброените.","Б", "42. " ], 
	[ "Ако пускател звезда-триъгълник не превключи статорните намотки на асинхронен двигател, задвижващ помпа, в триъгълник, какво ще стане?", "Помпата ще се пусне нормално и ще работи нормално.", "Помпата ще се пусне нормално и ще работи с намален дебит.", "Помпата въобще няма да се развърти.", "Нищо от изброените.","Б", "43. " ],
    [ "Защо за асинхронните задвижвания се предвижда защита от работа на две фази?", "Защото при отпадане на фаза не може да се пусне след спиране.", "Защото може да се претовари и да изгори.", "Защото са налице и двата варианта посочени в A) и B) .", "Нищо от изброените.","В", "44. " ], 
	[ "С каква цел се въвежда закъснение на заработването на генераторния автоматичен прекъсвач при възникване на късо съединение?", "Закъснение в заработването на генераторния прекъсвач при късо съединение не се предвижда.", "Закъснението се въвежда за предпазване от лъжливи заработвания на защитата.", "Закъснение се предвижда при реализиране на селективност по време.", "Закъснението е необходимо за съчетаване на работата на защитата от късо съединение с Майеровата защита.","В", "45. " ],
    [ "При достигането на каква плътност на електролита трябва да се прекрати зареждането на основните акумулатори?","Плътността на електролита на основните акумулатори е постоянна и не зависи от степента на зареденост.", "1,28.", "1,58.", "2,28.","А", "46. " ], 
    [ "Инцидентно възникнало ниско съпротивление придружено с протичане на ненормално високи стойности на тока е познато като:", "Отворена верига.", "Заземен полюс.", "Претоварване по сила на тока.", "Късо съединение.","Г", "47. " ],
    [ "С какъв уред може да се измери съпротивлението на изолация на корабното електрообзавеждане?", "Комбиниран волт-ампер-омметър.", "Волтметър и амперметър.", "Омметър.", "Мегаомметър.","Г", "48. " ], 
	[ "Електрически уред/елемент който най-често използва принципа на електромагнитната индукция е:", "Диод.", "Трансформатор.", "Транзистор.", "Реостат.","Б", "49. " ],
    [ "Силициевите диоди използвани при електронните волтрегулатори и специално проектирани за “следене” на напрежението за обратна мощност се наричат:", "“Тунелни” диоди.", "Топлоотвеждащи диоди.", "Компенсиращи диоди.", "Ценер диоди.","Г", "50. " ], 
	[ "Силициевият токоизправител е неразглобяемо устройство, което се използва да промени:", "Прав ток в променлив ток и да контролира относително малък ток.", "Променлив ток в прав ток и да контролира относително голям ток.", "Прав ток в променлив ток и да контролира относително голям ток.", "Променлив ток в прав ток и да контролира относително малък ток.","Б", "51. " ],
    [ "Изходно напрежение 440 V на променливотоков генератор се подържа чрез:", "Оборотите на първичния двигател.", "Регулатора на възбуждането.", "Товара на генератора.", "Броя на полюсите.","Б", "52. " ], 
	[ "Защо ел.двигател за постоянен ток се включва през пускови съпротивления?", "За запазване на мрежата от претоварване.", "За плавно регулиране на честотата на въртене.", "За подобряване на К.П.Д на задвижването.", "За ограничаване големината на пусковия ток.","Г", "53. " ],
    [ "Каква е причината да бръмчи без да се развърта след пуск един механично изправен асинхронен ел.двигател?", "Задействала е защитата от претоварване.", "Изгорял е предпазитела на една от фазите.", "Недостатъчен магнитен поток.", "Пробив на изолация към корпус.","Б", "54. " ], 
	[ "Как може да се промени посоката на въртене на трифазен асинхронен ел.двигател?", "Чрез промяна на включването на два от трите захранващи линейни проводника.", "Чрез превключване на броя на полюсите на статорната му намотка.", "Чрез промяна посоката на тока в роторната намотка.", "Чрез промяна на включването на два от трите извода на роторната намотка.","А", "55. " ],
    [ "Безчетковите генератори са проектирани да работят без:", "Четки.", "Контактни пръстени.", "Комутатори.", "Всички изброени.","Г", "56. " ], 
	[ "Заземяване на електродвигател може да се дифинира като връзка на корпуса му и:", "Шунтовото поле.", "Главния прекъсвач.", "Металния фундамент.", "Полюсите.","В", "57. " ],
    [ "Увеличаване на възбуждането на генератора на дизел-електро пропулсивна система, ще причини на правотоковия гребен електродвигател:", "Увеличение на оборотите/скоростта.", "Намаление на оборотите/скороста.", "Отразява се само на оборотите на генератора.", "Оказва влияние на гребния ел.двигател само ако е обвързано с увеличение и на оборотите на генератора.","А", "58. " ], 
	[ "За коя от изброените системи ще инсталираме PID контролер?", "Контрол на налягане.", "Контрол на температура.", "Контрол на ниво.", "Контрол на дебит.","Б", "59. " ],
    [ "Каква е функцията на I / P трансдуктора ?", "Превръща измерения електрически ток в пропорционално на тока налягане.", "Усилва сигнала по налягане поради малката му стойност , недостатъчна за желания ефект.", "Инвертира сигнала по налягане.", "Превръща измереното налягане в пропорционален на налягането електрически сигнал.","А", "60. " ], 
	[ "Част от електрическото оборудване може да бъде маркирано със символите Ex i. Какво означават те?", "Взривобезопасни.", "Опасни във взривоопасна зона.", "Съществено безопасни.", "Безопасни към вътрешни експлозии.","В", "61. " ],
    [ "Колко пъти ще се увеличи топлинното натоварване върху статорните намотки, ако токовото натоварване на асинхронен генератор се удвои?", "Остава същото.", "Два пъти.", "Четири пъти.", "Осем пъти.","В", "62. " ], 
	[ "Какво включва ревизията, провеждана в края на ходовите изпитания на електрооборудването?", "Проверка на магазиите за запасни и резервни части по списък от завода-строител.", "Повторна проверка на алармите и сигнализацията в МКО.", "Проверка на готовността на личния състав за работа с електрочастта.", "Проверка на електрооборудване, което е дало дефекти при ходовите изпитания.","Г", "63. " ],
    [ "Кое от изброените устройства се подлага на специални изпитания по време на ходовите изпитания?", "Електрозадвижване на товарното устройство.", "Лодъчното спасително устройство.", "Аварийните генератори.", "Уредите за вътрешна свръзка и сигнализация.","Г", "64. " ], 
	[ "Коя от изброените документации е в списъка на технологичните в структурата на документите на електрообзавеждането на кораба?", "Проектна.", "Принципални електротехнически схеми.", "Чертежи за разположение на апаратурата в основните места.", "Електромонтажна.","А", "65. " ],
    [ "Кой е основния, най-важния проблем на централизираната система за комплексна автоматизация на кораба?", "Високата себестойност.", "Големите габарити на оборудването.", "Ниска надеждност.", "Сложно техническо обслужване.","В", "66. " ], 
	[ "Коя е основната система за автоматично управление на курса на кораба с цел повишаване надеждността на корабоплаването?", "Система за автоматично удържане на кораба на зададен курс при плаване в открито море.", "Всичко изброено.", "Система за автоматично управление на кораба по зададен фарватер.", "Система за автоматично управление на кораба по зададена траектория при плаване в открито море.","Б","67. "  ],
    [ "На кой параметър реагира звуковата и светлинна сигнализация за прекъсване на захранването на всяка от навигационните светлини?", "Напрежението.", "Съпротивлението.", "Тока.", "Индуктивността.","В","68. "  ], 
	[ "Регулаторните характеристики на синхронните генератори показват:", "Как трябва да се променя натоварването при постоянни обороти на ротора.", "Как трябва да се променя възбудителния ток при промяна на тока на натоварването, така че да се запази изходното напрежение постоянно.", "Как трябва да се променя тока при постоянно възбуждане, така че да се запазят постоянни оборотите.", "Как трябва да се променят оборотите при промяна на натоварването, така че да се запази изходното напрежение постоянно.","Б","69. "  ],
    [ "В управлението на кое електрозадвижване е предвидено ръчно шунтиране на защитата от претоварване на електродвигателя?", "На крановете.", "На пожарните помпи.", "На швартовия шпил.", "На рулевото задвижване.","В","70. "  ], 
	[ "На кой параметър реагира звуковата и светлинна сигнализация за прекъсване на захранването на всяка от навигационните светлини?", "Напрежението.", "Съпротивлението.", "Тока.", "Индуктивността.","В","71. "  ],
    [ "Акумулаторната батерия трябва да издържа аварийно натоварване без презареждане с напрежение в границите на:", "± 8% от номиналната му стойност.", "± 10% от номиналната му стойност.", "± 12% от номиналната му стойност.", "± 14% от номиналната му стойност.","В","72. "  ], 
	[ "Как може да се промени алгоритъма на действие на микропроцесорна схема за управление?","Като се препрограмира постоянната памет.", "Като се промени схемата.", "Като се смени микропроцесорът.", "Като се сменят интерфейсните схеми.","А" ,"73. " ],
    [ "Какво е минимално допустимото съпротивление на изолацията на корабната електроенергийна система?", "0,7 MΩ.", "0,5 MΩ.", "0,2 MΩ.", "Зависи от конкретната корабна електроенергийна система.","Г","74. "  ], 
	[ "Защо двигател за постоянен ток с последователно възбуждане не трябва да се оставя да работи на празен ход?", "Недопустимо нараства честотата на въртене.", "Намалява КПД на задвижването.", "Недостатъчно възбуждане.", "Опасност от пробив в изолацията.","А","75. "  ],
    [ "По какви причини може да се получи голямо намаление на напрежението (провал) на корабната мрежа?", "Вследствие на късо съединение.", "Включване на ел. двигател с относително голям пусков ток.", "Включване на генератор за паралелна работа при неспазени условия на синхронизация.", "Вследствие на всяка от горните причини.","Г","76. "  ], 
	[ "Как може да се промени алгоритъма на действие на микропроцесорна система за управление?", "Като се препрограмира постоянната памет.", "Като се промени схемата.", "Като се смени микропроцесорът.", "Като се сменят интерфейсните схеми.","А","77. "  ],
    [ "Какво трябва да се направи за да се увеличи активния товар на паралелно работеш синхронен генератор?", "Да се увеличи въртящия момент на вала му.", "Да се намали възбудителния му ток.", "Да се увеличи възбудителния му ток.", "Да се намали въртящия момент на вала му.","А","78. "  ], 
	[ "В случай на повреда (напр. прекратяване подаването на гориво) на единия от първичните двигатели на генератори работещи в паралел трябва:", "Да сработи защитата за обратна мощност на повредения дизелгенератор и избегне работа в двигателен режим.", "Да сработи защитата от свръхобороти на ДГ.", "Да сработи защитата на изправния ДГ по минимални обороти.", "Бързо да се възстанови подаването на гориво на проблемния ДГ.","А","79. "  ],
    [ "Прав ток протичащ през проводник намотан около мека желязна сърцевина е описание на прост:", "Магнитен екран.", "Електромагнит.", "Пиезоелектрично устройство.", "Електромагнитна зона/поле.","Б","80. "  ], 
	[ "Факторът определящ честотата Hz на променливотоков генератор е:", "Броя на завъртанията на проводника на котвената намотка.", "Скороста/оборотите на ротора.", "Силата използваните магнити.", "Силата на изходящото напрежение.","Б","81. "  ],
    [ "Електролита на никел-кадмиевите батерии е дестилирана вода и:", "Разредена сярна киселина.", "Калиев хидроокис." ,"Оловен сулфат.", "Цинков окис.","Б","82. "  ], 
	[ "Какво представлява Майеровата защита на корабната електроцентрала", "Изключване на работещия генератор при късо съединение.", "Автоматично изключване на неотговорните консуматори при късо съединение.", "Изключване на работещия генератор при претоварване.", "Изключване на работещия генератор при честота по-голяма с 10% от номиналната.","Б","83. "  ],
    [ "Кое е най-точно като отговор на въпроса: Защо трябва да се вентилира акумулаторното помещение ?", "За охлаждане на акумулаторните батерии.", "За предотвратяване от корозия помещението.", "За предотвратяване на взрив.", "Намаляване на рисковете за здравето на хората.","C","84. "  ], 
	[ "Броя на клетките на един киселинен акумулатор за 12V е:", "3.", "4.", "6.", "12.","В","85. "  ],
    [ "На електродвигателя на кое от изброените задвижвания се монтира незабавно действащо реле от/за претоварване ?", "Вентилатор.", "Помпа.", "Винч.", "Металорежещи машини.","В","86. "  ], 
	[ "Повредите на контактите във вътрешноста на контролните станции на товарните винчове, причинени от кондензат, могат да се намалят (превантивно избегнат) чрез:", "Инсталиране на осветителна лампа в колоната на контролната станция.", "Вътрешно боядисване на контактната кутия с епоксиден уплътнител.", "Периодично вентилиране на контактната кутия.", "Използване на лентови нагреватели във вътрешноста на контактната кутия.","Г","87. "  ],
    [ "Какво ще се случи ако изгори бобината/намотката на електромагнитната спирачка на товарен винч ?", "Спирачката ще се задейства от силата на пружината.", "Ел.мотора ще се 'разгони' / развие свръх обороти / и ще изгори.", "Товара провесен на стрелата на бигата ще падне.","Няма да се случи нищо и мотора ще продължи да работи като при нормални условия.","А","88. "  ], 
	[ "Защитата от претоварване на рулево електрозадвижване въздейства на:", "Изключва захранването на електрозадвижването.", "Включва сигнализацията.", "Изключва захранването на електрозадвижването и влючва сигнализацията.", "Включва резервната електрохидравлична помпа.","Б","89. "  ],
    [ "Кой е основният недостатък на желязно- никеловите акумулатори спрямо оловните?", "По-високата стойност.", "По-малката устойчивост на удар.", "По-ниският К.П.Д.", "По-малката устойчивост на претоварване.","В","90. "  ], 
	[ "С колко процента от капацитета си могат безопасно да се зареждат литиево - йонните батерии?", "1 /10 от капацитета си.", "1 /20 от капацитета си.", "1 /2 от капацитета си.", "Зарядката може да бъде равна на 100% от капацитета.","Г","91. "  ],
    [ "Единица мярка за какво е Лумена (символ lm) ?", "Лумен е единицата за светлинен поток в системата SI.", "Единица мярка за осветеност.", "Лумен е единицата за светлинно свъпротивление в системата SI.", "Единица мярка за радиация.","А","92. "  ], 
	[ "За какво допринася реакцията на котвата при постояннотоковите генератори?", "Деформира магнитния поток на главните полюси.", "Силно увеличава искренето под четките.", "Намаля полюсното напрежение.", "Всичко изброено .","Г","93. "  ],
    [ "В кои случаи при корабното електрозадвижване се използват трифазни асинхронни двигатели с двойнокафезни ротори?", "При машини, изискващи регулиране в широки граници.", "При машини, изискващи стъпково регулиране.", "При машини с голям пусков момент.", "При машини с големи максимални обороти и плавен старт.","В","94. "  ], 
	[ "За какви задвижвания се използват двигатели за постоянен ток с паралелно възбуждане?", "При машини, изискващи регулиране в тесни граници.", "При машините, изискващи големи стартови обороти.", "При машини, изискващи плавно регулиране в широки граници.", "При машини с големи максимални обороти и плавен старт.","В","95. "  ],
    [ "Как се избира термичната защита при асинхронните двигатели?", "По максималната допустима температура на изолацията.", "По номиналната температура на електродвигателя.","По номиналния ток на асинхронния двигател.", "По максималния ток на асинхронния двигател.","В","96. "  ], 
	[ "Кое е основното предимство на магнитния пускател пред ръчния прекъсвач при управлението на асинхронния двигател?", "Дистанционно управление.", "Защита от претоварване.", "Нулева защита.", "Всичко изброено","Г","97. "  ],
    [ "Кой елемент на електрониката може да се изключи чрез прекъсване на анодната верига;понижаване на анодния ток и напрежение под точката на изключване и промяна поляритета на анодното U?", "Тиристорите.", "Транзисторите.", "Оптроните.", "Стабилитроните.","А","98. "  ], 
	[ "Колко пускателя се използват за пускане, спиране и реверсиране на двускоростен АД, в каналите на статора на който са разположени две независими трифазни намотки?", "Три реверсивни магнитни пускателя.", "Четири реверсивни магнитни пускателя.", "Два реверсивни магнитни пускателя.", "Един реверсивен магнитен пускател.","В" ,"99. " ],
    [ "Какво е предназначението на постоянния магнит в микрофона на телефонната слушалка?","Да създава заедно с гласа на говорещия променливо Е.Д.Н.", "Да усилва звука.", "Да намалява изкривяванията.", "Всичко изброено.","Г","100. "  ], 
	[ "Защо магнитната система на контактора за променлив ток е шихтована:", "По технологични съображения.", "За намаляване на магнитното съпротивление.", "Предотвратяване вибрации на котвата при минаване през нулева стойност на тока на бобината.", "Намаляване загубите в стоманата.","Г","101. "  ],
    [ "Електрическите лампи с нажежаема жичка се класифицират според:", "Формата на 'крушата' и предназначението.", "Размера и вида на закрепването във фасунката.", "Работното напрежение / волтаж и мощност във ватове.", "Всички изброени.","Г","102. "  ], 
	[ "Кое от изброените се използва при измерване на налягане и преобразуването му в електрически сигнал?", "Преобразувател (Transducer).", "Понижител (Reducer).", "Трансформатор (Тransformer).", "Коректор (Rectifier).","А","103. "  ],
    [ "Как могат да са свързани намотките на трифазните трансформатори ?", "В триъгълник.", "В звезда.", "В зигзаг (пречупена звезда).", "Всичко изброено.","Г","104. "  ], 
	[ "Трансформаторът функционира нормално при напрежение 220 V променлив ток. Какво ще се случи, ако го свържем към 110 V постоянен ток ?", "Трансформаторът няма да функционира, защото е предназначен да работи само с променливи токове.", "Ще изгори, защото в първичната намотка ще има само активно съпротивление, а индуктивното ще липсва.", "Ще изгори при протичане на ток, който има ампераж със стойност по-голяма от номиналната.", "Ще понижи два пъти мощността си на изхода.","Б","105. "  ],
    [ "Термичната максималнотокова защита не може да се ресетира след изключване, защото:", "Биметалните пластини се нуждаят от време, за да изстинат.", "Включва се блокировка на мотора.", "Линейните пружини на контактора също трябва да се ресетират.", "Сработва интерлок устройство.","А","106. "  ], 
	[ "Какъв датчик се използва при / за измерване на ефективния въртящ момент на ГД?", "Пирометър.", "Ултразвуков датчик.", "Синхронометър.", "Тензодатчик.","Г","107. "  ],
    [ "При калибровката на измервателния уред, коя обикновено е първата стъпка?", "Настройка на линейността и обхвата.", "Настройка на нулевата точка и обхвата.","Настройка на диапазона и амплитудата.", "Настройка на диапазона и нулевата точка.","Б","108. "  ], 
	[ "По време на преход температурната сигнализация на единия от дизелгенераторите блокира. Какви ще бъдат незабавните действия?", "Незабавен ремонт на авариралата система.", "Включване на друг дизелгенератор /има такъв на разположение/.", "Всички споменати възможности.", "Ако повредата влияе на захранването на автоматиката, преминаваме в ръчен режим докато отстраним повредата.","В","109. "  ],
    [ "Кой тип контролер е най-често изпозван в корабната автоматика?", "П-Д контролер.", "П контролер.", "П-И-Д контролер.", "П -И контролер.","Г","110. "  ], 
	[ "Ако при 75% натоварване на два паралелно работещи генератора единия изключи, какви спешни действия ще предприемем?", "Изключване на всички неотговорни консуматори от шините на ГРТ.", "Стартиране и включване на авариен генаратор.", "Рестартиране на изключилия генератор.", "Проверка на главния прекъсвач на изключилия генератор.","А","111. "  ],
    [ "Кое определя фактора на мощността на генератор, работещ сам към шините на ГРТ?", "Генерираното напрежение.", "Броят на чифтовете полюси на възбудителната намотка.", "Товарът към шините на Главното Разпределително Табло /ГРТ/.", "Възбудителното напрежение.","В","112. "  ], 
	[ "Защо скалата на измервателните уреди от електромагнитната система е неравномерна?", "При електромагнитната система зависимостта м/у ъгъла на завъртане на подвижната част и силата на измервания ток е квадратична.", "При електромагнитната система зависимостта м/у ъгъла на завъртане на подвижната част и силата на измервания ток е кубична.", "Поради обхвата на уреда и мащаба на измерване при електромагнитната система.", "Няма неравномерни скали - това е за защита от грешки от паралакса.","А","113. "  ],
    [ "Кой е основният недостатък на груповото електрозадвижване?", "Сложната електрическа схема.","Сложната кинематична схема.", "Ниския К.П.Д.", "“б” и “в” .","Г","114. "  ], 
	[ "На табелката на трифазен АД е означено 230/380 V. Как ще свържем фазите на статорната му намотка за включването му към стандартно напрежение от 380 V?", "Паралелно.", "Последователно.", "Триъгълник.", "Звезда.","Г","115. "  ],
    [ "Кога няма да изгори трифазен асинхронен двигател, ако го пуснем със свързани в звезда, вместо в триъгълник статорни намотки?", "При активно охлаждане.", "Ако пусковото натоварване е три пъти по-малко от номиналното.","При понижаване на честотата на пусковия ток.", "Пускането в звезда е по-облекчено от това в триъгълник.","Б","116. "  ], 
	[ "Как се променя големината на магнитния поток в сърцевината на трансформатора при увеличаване на товарния ток?", "Ще се увеличи нищожно.", "Зависи от характера на товара- при индуктивен товар ще намалява.", "Няма да се промени.","Товарният ток е пропорционален на магнитния поток в сърцевината.","В","117. "  ],
    [ "Честотата на въртене на ротора на асинхронните двигатели е:", "По-голяма от честотата на въртене на статорното въртящо се магнитно поле.", "По-малка от честотата на въртене на статорното магнитно поле.", "Равна на честотата на въртене на статорното магнитно поле.", "Нищо от изброените.","Б","118. "  ], 
	[ "Металният корпус на електрическите машини задължително се “заземява”:", "За да задейства защитите при повреда на изолацията на машината и да изключи двигателя от мрежата.", "За намаляване на напрежението върху човека при допир до машината при повреда на изолацията.", "За да не възникне ток на късо съединение при повреда на изолацията на машината.", "Нищо от изброените.","Б","119. "  ],
    [ "Кои електродвигатели се използват най- често в корабното обзавеждане?", "Постояннотокови двигатели със смесено възбуждане.", "Трифазни асинхронни електродвигатели с късо съединен ротор.", "Синхронни двигатели.", "Нищо от изброените.","Б","120. "  ], 
	[ "Неподвижните части на асинхронният електродвигател се наричат:","Ротор.", "Статор.", "Колектор.", "Нищо от изброените.","Б","121. "  ],
    [ "Подвижните части на асинхронният електродвигател се наричат:", "Ротор.", "Статор.", "Котва.", "Нищо от изброените.","А","122. "  ], 
	[ "В кои електрически машини индукторът се намира на ротора и се захранва от постоянно токов източник?", "Асинхронната електрическа машина.", "Правотоковата електрическа машина.", "Синхронната електрическа машина.", "Нищо от изброените.","В","123. "  ],
    [ "Към ротора на кои електрически машини не се подава напрежение от външен източник?", "Правотоковите двигатели.", "Асинхронните електрическа машина.", "Синхронните двигатели", "Нищо от изброените.","Б","124. "  ], 
	[ "Предназначението на компенсиращите намотки на синхронните ел.двигатели е:", "Да елиминират преплъзването.", "Да осигурят възбуждане.", "Да осигурят стартов въртящ момент.", "Да увеличат ефективноста.","В","125. "  ],
    [ "Какво показва спирането на стрелката на синхроноскопа при запаралелването на два генератора?", "Честотата на тока на запаралелвания генератор е еднаква с тази на шините на ГРТ.", "Синхроноскопа не работи прецизно и трябва да бъде проверен.", "Напрежението на запаралелвания генератор е равно на това на шините на ГРТ.", "Запаралелвания генератор е с еднакви фази на тока с този на шините, но честотите им са различни.","А","126. "  ], 
	[ "Кога включваме главния прекъсвач на запаралелвания генератор към шините на ГРТ?", "В никой от изброените случаи.", "При най-висока честота на въртене на стрелката и мигане на двете светлини.", "Когато стрелката на синхроноскопа застане на 0 /12часа/ и двете светлини изгаснат.", "Когато стрелката на синхроноскопа спре и двете светлини светнат едновременно.","В","127. "  ],
    [ "Регулаторната характеристика е характеристика на:", "Само на регулатора на обороти.", "Само на двигателя.", "На двигателя с включен към него регулатор на обороти.", "Нищо от изброените.","В","128. "  ], 
	[ "Как влияят хлабините в лостовата система между регулатора на обороти и горивните рейки?", "Не оказват влияние.", "Системата става по-мудна.", "Появяват се непрекъснати колебания на оборотите.", "Системата става по-бърза.","В","129. "  ],
    [ "По кой от изброените канали обектът на регулиране е най-сложен?", "По температурата на маслото пред двигателя.", "По температурата на охлаждащата вода за цилиндрите на изхода от двигателя.", "По температурата на охлаждащата течност за буталата на входа на двигателя.", "По температурата на въздуха след въздушния охладител.","Б","130. "  ], 
	[ "Може ли електродвигател за продължителен режим на работа да се използва за кратковременен или повторно- кратковременен режим?", "Може, но трябва да се преизчисли мощността му.", "Не може, защото ще се прегрее.", "Не може, защото няма да има необходимия въртящ момент.", "Може, ако се включи през пускови съпротивления.","А","131. "  ],
    [ "Как можем да регулираме оборотите на постояннотоков електродвигател?", "Чрез промяна на съпротивлението на котвата.", "Чрез промяна на големината на магнитния поток на възбуждането.", "Чрез промяна на големината на захранващото напрежение.", "Всичко изброено.","Г","132. "  ], 
	[ "Накъсо съединен ротор (кафезен ротор) имат:", "Постояннотоковите генератори.", "Асинхронните двигатели.", "Постояннотоковите двигатели.", "Синхронните генератори.","В","133. "  ],
    [ "В корабни условия пускането на АД трябва да се контролира, защото:", "Да не се получава провал в напрежението на централата ΔU по- голям от 20% от Uн.", "Пусковият момент Мп на АД да е по- голям от съпротивителния момент Мс, за да може да се развърти машината.", "Защото поради голямата стойност на пусковия ток Iп се получава голямо натоварване на централата.", "Всичко изброено.","Г","134. "  ], 
	[ "Как регулираме честотата на въртене на асихронните двигатели?", "Регулираме ЧВ чрез промяна на броя на чифтовете полюси.", "Регулираме ЧВ чрез промяна на хлъзгането S.", "Регулираме ЧВ чрез изменение на честотата на мрежата.", "Всичко изброено.","Г","135. "  ],
    [ "Защо статорните и роторните пакети на асинхронния двигател се изработват от листова електротехническа ламарина?", "За намаляване на загубите от вихровите токове.", "За намаляване на плъзгането s.", "За увеличаване на пусковия момент.", "Нищо от изброените.","А","136. "  ], 
	[ "Под понятието фазов ротор разбираме:", "Накъсосъединен ротор.", "Навит ротор.", "Кафезен ротор.", "Нищо от изброените.","Б","137. "  ],
    [ "Кафезен ротор имаме тогава когато:", "Активните проводници на роторната намотка се съединяват накъсо в двата края.", "Краищата на роторната намотка се запояват към колекторните пластини.", "Роторната намотка се изпълнява непрекъсната.", "Нищо от изброените.","А","138. "  ], 
	[ "Трифазният ток на статорната намотка на асинхронния двигател възбужда:", "Постоянно магнитно поле.", "Променливо магнитно поле.", "Въртящо се магнитно поле.", "Нищо от изброените.","В","139. "  ],
    [ "Въртящият момент на АД възниква вследствие на електромагнитното взаимодействие на:", "Токовете на роторните проводници и постоянно магнитно поле.", "Токовете на роторните проводници и пулсиращо магн. поле.", "Токовете на роторните проводници и въртящо се магнитно поле.", "Нищо от изброените.","В","140. "  ], 
	[ "Кога асинхронният двигател не развива въртящ момент?", "Когато роторът се върти синхронно със статорното въртящо се магнитно поле.", "Когато роторът се върти по-бавно от статорното въртящо се магнитно поле.", "Когато роторът се върти по посока обратна на въртенето на статорното поле.", "Нищо от изброените.","А","141. "  ],
    [ "Чрез смяна редуването на фазите/размяна на два от трите извода на статорната намотка на асинхронния двигател получаваме:", "По-бързо въртене на ротора.", "Реверсиране на ротора/електродвигателя.", "По-бавно въртене на ротора.", "Нищо от изброените.","Б","142. "  ], 
	[ "Работните характеристики на асинхронните двигатели представляват графичните зависимости на честотата на въртене на ротора n<sub>2</sub>, двигателният момент М<sub>2</sub>, факторът на мощността cos φ и коефициентът на полезно действие η от:", "Напрежението U при полезна мощност на двигателя Р<sub>2</sub> и честота на напрежението f, равни на константа.", "Честотата на напрежението f, при полезна мощност на двигателя Р<sub>2</sub> и напрежение U, равни на константа.", "Полезната мощност на двигателя Р<sub>2</sub>, при напрежение и честота на напрежението равни на номиналните/константа.", "Нищо от изброените.","В","143. "  ],
    [ "Зависимостта на двигателния момент М<sub>2</sub>, от скоростта на ротора при асинхронните двигатели /M<sub>2</sub>=f(n<sub>2</sub>)/ се нарича:", "Работна характеристика.", "Механична характеристика.", "Регулировъчна характеристика.", "Нищо от изброените.","Б","144. "  ], 
	[ "Коя намотка на еднофазния асинхронен двигател обикновенно се изключва след развъртане на ротора?", "Компенсационната.", "Пусковата.", "Статорната.", "Нищо от изброените.","Б","145. "  ],
    [ "Акумулаторът е предназначен да:", "Акумулира и преобразува честотата на електроенергията.", "Акумулира и преобразува напрежението на електроенергията.", "Акумулира и отдава електроенергия.", "Нищо от изброените.","В","146. "  ], 
	[ "Електролитът на оловните акумулатори представлява:", "Чиста солна киселина, разредена с дестилирана вода.", "Чиста сярна киселина, разредена с дестилирана вода.", "Калиева основа, разредена с дестилирана вода.", "Нищо от изброените.","Б","147. "  ],
    [ "Kакво представлява и какво приложение има синхронния компенсатор?", "СК е синхронен двигател, работещ при постоянен съпротивителен момент в режим на превъзбуждане и черпи капацитивен ток от мрежата.", "Подобрява фактора на мощността на енергийната система (разпределителната мрежа), като черпи капацитивен ток.", "СК се превъзбужда и отдава IC в мрежата, без да товари първичния двигател и разтоварва синхр. генератор по ток.", "Всичко изброено .","Г","148. "  ], 
	[ "Нулевата защита е защита от:", "Самопускане.", "Незамасена нула на инсталацията.", "Нулева мощност на консуматора.", "Нулево съпротивление във веригата /защита от късо съединение/.","А","149. "  ],
    [ "Какво разбираме под “усилено зареждане” на алкалните акумулатори?", "Прилага се, когато електролитът е сменен след дълбоко разреждане, когато напрежението му се е намалило под допуст. стойност.", "Протича на два етапа, като първия е 6 часа с ток по режима на нормално зареждане, без този ток да се променя.", "Втория етап е 6 часов, но токът по величина е половината от силата на тока при нормално зареждане.", "Всичко изброено .","Г","150. "  ], 
	[ "Кой от видовете зареждания на алкалните акумулатори се използва само в случай на крайна необходимост?", "Нормално.", "Усилено.", "Предварително.", "Ускорено.","Г","151. "  ],
    [ "За кои акумулатори разреждане до напрежения по- ниски от 1.1 V се считат за безопасни /напрежението се измерва под натоварване/?", "Никел-кадмиевите.", "Никел-металхидридните.", "Железно-никеловите.", "Нищо от изброените.","Г","152. "  ], 
	[ "За кои акумулатори е характерно бурно газоотделяне в края на зареждането?", "Киселинните.", "Основните.", "Йонните.", "Никел -металхидритните.","А","153. "  ],
    [ "Kога трябва да се проверява задължително апаратурата на авторулевите устройства?", "Веднъж на месец.", "Ежегодно.", "Преди излизане на рейс.", "Ежеседмично.","В","154. "  ], 
	[ "Кое от посочените твърдения за качествата на асинхронните трифазни електродвигатели е вярно?", "АД с навит (фазен) ротор са по-сложни и скъпи, но имат по-висок фактор на мощността и КПД.", "АД с кафезен (накъсо съединен) ротор са с проста и евтина конструкция, но не са издръжливи на претоварване.", "АД с кафезен (накъсо съединен) ротор са със сложно регулиране на честотата на въртене.", "АД с навит(фазен) ротор са много чувствителни към колебания на захранващото напрежение.","В","155. "  ],
    [ "Реактивната мощност, която генератора отдава в мрежата се регулира от:", "Честотата на въртене на първичния двигател.", "Силата на тока на изхода.", "Заглушителна (демпферна) намотка.", "Възбудителния ток.","Г","156. "  ], 
	[ "При индуктивен характер на товара реакцията на котвата:", "Действа размагнитващо и компенсира увеличаването на потока, вследствие на превъзбуждането.", "Намагнитва допълнително и увеличава потока следствие на недовъзбуждането.", "Реакцията на котвата не влияе на потока от възбудителната намотка.", "Действа размагнитващо и увеличава интензитета на потока, вследствие на превъзбуждането.","А","157. "  ],
    [ "Кой елемент от генератора за постоянен ток служи за механичен токоизправител?", "Индуктора.", "Котвата.", "Колектора.", "Четковия апарат.","В","158. "  ],
	[ "При разреждане и зареждане на киселинните акумулатори електролитът:", "Не участва в химическата реакция.", "Променя плътността си.", "Е натриева основа разредена с дестилирана вода.", "Нищо от изброените.","Б","159. "  ],
    [ "За какво служат сепараторите между плочите на акумулаторните батерии:", "За комутационна връзка между активните плочи.", "За изолация между активните плочи.", "За катализатор на химическите процеси.", "Нищо от изброените.","Б","160. "  ], 
	[ "При разреждане на киселинните акумулатори:", "Плътността на електролита се увеличава.", "Плътността на електролита не се променя.", "По повърхността на активната маса се получава оловен сулфат.", "Нищо от изброените.","В","161. "  ],
    [ "Електролитът на алкалните акумулатори е разтвор на:", "Калиева или натриева основа.", "Магнезиева или калциева основа.", "Натриев хлорид.", "Нищо от изброените.","А","162. "  ], 
	[ "Електролитът при алкалните акумулатори:", "При разреждане на акумулатора намалява плътността си.", "При зареждане на акумулатора увеличава плътността си.", "Не променя плътността си.", "Нищо от изброените.","В","163. "  ],
    [ "За осигуряване на по-голям ток акумулаторите се свързват:", "Последователно.", "Паралелно.", "Съгласно схемата на Грец.", "Нищо от изброените.","Б","164. "  ], 
	[ "За осигуряване на по-голямо напрежение акумулаторите се свързват:", "Последователно.", "Паралелно.", "Съгласно схемата на Грец.", "Нищо от изброените.","А","165. "  ],
    [ "Акумулаторът се зарежда от токоизточника, ако:", "Напрежението на акумулатора е по- голямо от това на токоизточника.", "Напрежението на акумулатора е равно на това на токоизточника.", "Напрежението на акумулатора е по- малко от това на токоизточника.", "Нищо от изброените.","В","166. "  ], 
	[ "За осъществяване на процеса зареждане акумулаторите се включват към източник за постоянен ток:", "Свързват се едноименните полюси на акумулатора и източника.", "Свързват се разноименните полюси на източника и акумулатора.", "Свързването няма значение.", "Нищо от изброените.","А","167. "  ],
    [ "Трансформаторът е статична електромагнитна машина с две или повече индуктивно свързани намотки и служи за преобразуване на:", "Постояннотокова електрическа енергия с едно напрежение в променливотокова електрическа енергия с друго напрежение.", "Променливотокова ел.енергия с едно напрежение в променливотокова ел.енергия с друго напрежение, но със същата честота.", "Променливотокова ел.енергия с едно напрежение в променливотокова ел.енергия с друго напрежение, но със друга честота.", "Нищо от изброените.","Б","168. "  ], 
	[ "Трансформаторите се захранват от мрежи за:", "Постоянен ток.", "Всякакви електрически мрежи.", "Променлив ток.", "Нищо от изброените.","В","169. "  ],
    [ "Коефициентът на трансформация представлява число, показващо:", "Мощността на трансформатора.", "Загубите в трансформатора.", "Отношението на броя на навивките на първичната намотка към броя на навивките на вторичната намотка.", "Нищо от изброените.","В","170. "  ], 
	[ "Коефициентът на трансформация може да бъде:", "Винаги равен на единица.", "По-голям, равен или по-малък от единица.", "По-голям, равен или по-малък от нула.", "Нищо от изброените.","Б","171. "  ],
    [ "Kое мероприятие способства за ограничаване преноса на реактивна енергия?", "Използване на ненатоварени тежко асинхронни двигатели.", "Трансформаторите във веригата да бъдат с по-голяма мощност от разчетната.", "Включване на кондензаторни батерии с голям капацитет в близост до работещите електродвигатели.", "Нищо от изброените.","В","172. "  ], 
	[ "Кой от посочените датчици не е генераторен?", "Термоелектрически.", "Пиезоелектрични.", "Тахометрични.", "Тензометрични.","Г","173. "  ],
    [ "Кое твърдение за луминисцентното осветление не е вярно?", "Луминесцентни осветителни тела (или луминесцентни лампи) са тип газоразрядни лампи.", "Дроселът създава условия за самоиндукция на високо напрежение (около 1000 V ), което е необходимо за запалване на лампата.", "Дроселът осигурява високо напрежение за запалване на лампата и след това да ограничава протичащия през нея ток.", "Луминофорът, превръща произведената в лампата невидима ултравиолетова светлина във видима светлина.","Б","174. "  ], 
	[ "При кой тип осветление cosφ /факторът на мощността / е най-висок?", "Крептоново.", "Халоново.", "Неоново.", "Лампа с нажежаема жичка.","Г","175. "  ],
    [ "Увеличаване на кой показател няма да повиши искренето в четките?", "Скоростта на въртене на ротора.", "Съпротивлението на материала от който са изработени четките.", "Брой на навивки в една бобина.", "Нищо от изброените.","Б","176. "  ], 
	[ "Веднага след включването в паралел на два генератора трябва:", "Да се изключи АВП на включения генератор за да се провери напрежението и честотата му преди да се включи отново.", "Да се повишат оборотите на току-що включения и да се намалят на този, който работи преди включването.", "Да се регулира автоматичния регулатор на напрежението на нововключения.", "Да се повишат оборотите на работещия и да се намалят на включения.","Б","177. "  ],
    [ "Какво определя фактора на мощността cosφ на генератор, който работи самостоятелно към шините на ГРТ?","Броят на чифтовете полюси на възбудителката.", "Напрежението на изхода от генератора.", "Товарът, включен към шините на ГРТ.", "Токът на възбуждане.","В","178. "  ], 
	[ "Ако от два генератора работещи в паралел при 80% натоварване единият отпадне, какви ще бъдат незабавните ни действия?", "Проверяваме АВП /автоматичния въздушен прекъсвач/ на изключилия генератор.", "Спираме всички неотговорни консуматори, включени към шините на ГРТ.", "Рестартиране на изключилия генератор.", "Стартираме и включваме аварийния генератор.","Б","179. "  ],
    [ "Какво означава намаляването на скоростта и спирането на въртенето на стрелката на синхроноскопа по време на процедура по запаралелване на два генератора?", "Синхроноскопа не работи прецизно.", "Честотата на включвания генератор се е изравнила с честотата на шините.", "Фазите на тока от алтернатора и от ГРТ са се изравнили, но честотата още не е.", "Равенство на напреженията на генератора и на шините на ГРТ.","Б","180. "  ], 
	[ "В кой момент ще включим АВП на запаралелвания генератор за включването му към шините на ГРТ?", "Когато стрелката на синхроноскопа застане неподвижно в позиция “12 часа” и двете лампи изгаснат.", "При най-бързо въртене на синхроноскопа и изгаснали лампи.", "Когато стрелката на синхроноскопа застане неподвижно в каквато и да е позиция и двете лампи светнат най- силно.", "При нито едно от изброените положения.","А","181. "  ],
    [ "При натоварване на трансформатора се променя:", "Честотата на мрежата.", "Токът на вторичната намотка.", "Първичното напрежение на трансформатора.", "Нищо от изброените.","Б","182. "  ], 
	[ "Увеличаването на тока на вторичната намотка на трансформатора води до нарастване на тока на първичната намотка:", "Защото се увеличава честотата.", "Защото се увеличава изходното напрежение.", "Защото магнитният поток на трансформатора остава постоянен.", "Нищо от изброените.","В","183. "  ],
    [ "Магнитопроводът на трансформаторите е:", "Отворен тип.", "Затворен тип.", "Линеен тип.", "Нищо от изброените.","Б","184. "  ], 
	[ "Магнитопроводът на трансформатора служи за провеждане на:", "Магнитен поток.", "Електрически ток.", "Протонен поток.", "Нищо от изброените.","А","185. "  ],
    [ "Частите на магнитопровода, върху които се поставят намотките се наричат:", "Ядра.", "Яреми.", "Комутатори.", "Нищо от изброените.","А","186. "  ], 
	[ "Магнитопроводът на трансформаторите:", "Повишава взаимната индуктивност между намотките.", "Провежда електрическия ток на първичната намотка.", "Поддържа намотките неподвижни една спрямо друга.", "Нищо от изброените.","А","187. "  ],
    [ "Намотките на трансформатора се изработват от:", "Изолиран меден или алуминиев проводник с кръгло, правоъгълно или квадратно напречно сечение.", "Канталов проводник с високотемпературна изолация.", "Стоманен проводник с различно напречно сечение.", "Нищо от изброените.","А","188. "  ], 
	[ "Каква схема на свързване се получава когато краищата на фазните намотки се свържат в общ център?", "Звезда.", "Зигзаг.", "Триъгълник.", "Нищо от изброените.","А" ,"189. " ],
    [ "Каква схема на свързване се получава когато краят на всяка фазна намотка се свърже с началото на следващата?", "Звезда.", "Триъгълник.", "Зигзаг.", "Нищо от изброените.","Б","190. "  ], 
	[ "Групата на трифазен трансформатор представлява число от 0 до 12, определено от:", "Видовете свързване на намотките на първичната намотка.", "Коефициента на трансформация.","Начина на свързване на първичните и вторичните намотки.", "Нищо от изброените.","В","191. "  ],
    [ "Паралелната работа на трансформаторите се налага когато:", "Трябва да се увеличи инсталираната мощност за захранване на консуматорите.", "Трябва да се увеличи напрежението на мрежата.", "Трябва да се увеличи честотата на захранващото напрежение.", "Нищо от изброените.", "А","192. "  ], 
   [ "  Ненатоварените трансформатори работят при:", "Лош КПД и добър фактор на мощността.", "Добър КПД и лош фактор на мощността.", "Лош КПД и лош фактор на мощността.", "Нищо от изброените.","В" ,"193 ."],
[ "  Паралелната работа на трансформаторите се приема за нормална, ако:", "Общият товар на консуматорите се разпределя право пропорционално на номиналните им мощности без уравнителни токове.", "Общият товар на консуматорите се разпределя обратно пропорционално на номиналните им мощности без уравнителни токове.", "Общият товар на консуматорите се разпределя право пропор-ционално на номиналните им мощности със уравнителни токове.", "Нищо от изброените.","А" , "194 ."],
[ "  Броят на магнитните полюси в индуктора на електрическата машина е:", "Четно число.", "Нечетно число.", "Няма значение.", "Нищо от изброените.","А" , "195 ."],
[ "  Ако генератори 1 и 2 работят в паралел и първичният двигател на генератор 2 остане без гориво, какво ще се случи?", "Генератор 2 ще изключи по обратна мощност.", "Генератор 1 ще се претовари и ще изключи от претоварване.", "Първичния двигател на генератор 1 ще развие свръхобороти и граничния регулатор ще го спре.", "Първичния двигател на генератор 2 ще развие свръхобороти и граничния регулатор ще го спре.","А" ,"196 ."],
[ "  След успешно включване в паралел на два генератора, разпределението на мощността и изравняването на активния и реактивния им товар става чрез:", "Автоматичния напреженов регулатор /АVR/ и регулатора на тока.", "Регулатора за обороти и регулатора на тока.", "Автоматичния напреженов регулатор /АVR/ и регулатора за обороти.", "Регулатора за обороти и фактора на мощността.","В" , "197 ."],
[ "  По колко волта на клетка напрежение трябва да подадем при бавно зареждане на оловни акумулаторни батерии?", "2.0 V.", "2.15 V.", "1.2 V.", "2.5 V.","Б" ,"198 ."],
[ "  Кой е правилния ред от операции, които системата за ДАУ ще проведе при аварийна ситуация с определени автоматично управлявани механизми?", "Аларма, старт на резервния, намаляне на оборотите и спиране на проблемния.", "Старт на резервния, аларма, намаляне на оборотите и спиране на проблемния.", "Аларма, намаляне на оборотите на проблемния, старт на резервния и спиране на проблемния.", "Аларма, стартиране на резервния, спиране на проблемния.","А" , "199 ."],
[ "  Ако оборотите на работещият към шините СДГ паднат с 10% поради проблем в регулатора, какви последствия ще имат електродвигателите, работещи в момента?", "Консумираната от тях мощност ще се повиши с 10%.", "Оборотите им ще паднат с 10%.", "Оборотите им ще нараснат с 10%.", "Падът на напрежението във всеки мотор ще се понижи с 10%.","Б" ,"200 ."],
[ "  Кой механизъм е най-податлив към аварии при правотоковите електрически машини?", "Лагерните възли.", "Колекторно-четковия.", "Възбудителния.", "Статорната намотка.","Б" , "201 ."],
[ "  На какви допълнителни изисквания трябва да отговарят корабните електрически машини в сравнение с бреговите?", "Натоварване на лагерите от бордово и килево клатене.", "Влаго и водо защитеност.", "Защитеност от проникване на твърди тела.", "Всички изброени.","А" ,"202 ."],
[ "  Кой е най-икономичния способ за промяна на честотата на въртене на асинхронен електрически двигател?", "Изменение на броя полюси.", "Промяна на напрежението към ел. двигателя.", "Честотно регулиране.", "Редуктор след ел. двигателя.","А" , "203 ."],
[ "  Кое от определенията е невярно по отношение на релетата?", "Релето е електромагнитен превключвател, предназначен за комутация на електрическа верига.", "Основните части на електромагнитното реле са електромагнит, котва и превключвател.", "Скокообразно изменяне на изходната величина при зададено изменение на входната величина.", "Нищо от изброените.","Г" ,"204 ."],
[ "  Каква е разликата между контактора и релето?", "Няма разлика.", "Релето има значително облекчена контактна система.", "При релетата работните контактни тела могат да бъдат повече (когато едните се затварят, другите се отварят).", "Б) и В) .","В" , "205 ."],
[ "  Кога капацитетът на акумулаторите се променя?", "При промяна на околната температура.", "При разреждането му.", "При всички изброени случаи.", "При свързване в паралел.","В" ,"206 ."],
[ "  Комутацията на постояннотоковите машини се подобрява чрез:", "Поставяне на допълнителни полюси.", "Поставяне на възбудителна намотка.", "Поставяне на полюсни накрайници.", "Нищо от изброените.","А" , "207 ."],
[ "  Колекторът представлява набор от медни пластини, свързани с елементи на котвената намотка и изолирани една от друга с:", "Гетинакс.", "Миканит.", "Текстолит.", "Нищо от изброените.","Б" ,"208 ."],
[ "  Намотката на допълнителните полюси се свързва:", "Последователно на котвената намотка.", "Успоредно на котвената намотка.", "Успоредно на възбудителната намотка.", "Нищо от изброените.","А" , "209 ."],
[ "  Компенсационната намотка на машините за постоянен ток се поставя за:", "Усилване на реакцията на котвата.", "Намаляване на основния магнитен поток.", "Подобряване на комутацията.", "Нищо от изброените.","В" ,"210 ."],
[ "  Компенсационната намотка на машината за постоянен ток се поставя:", "В каналите на ротора.", "В каналите на полюсните накрайници.", "Върху основната намотка на главните полюси.", "Нищо от изброените.","Б" , "211 ."],
[ "  Защо се премества линията на четките по отношение на физическата неутрална линия?", "За подобряване натиска на четките.", "За подобряване на комутацията.", "За влошаване на комутацията.", "Нищо от изброените.","Б" ,"212 ."],
[ "  Най-доброто средство за подобряване комутацията на машините за постоянен ток е:", "Монтиране на компенсационна намотка.", "Увеличаване на преходното съпротивление на четките.", "Монтиране на допълнителни полюси.", "Нищо от изброените.","В" , "213 ."],
[ "  Увеличаването на въздушната междина между роторния пакет и полюсите на машина за постоянен ток предизвиква:", "Намаляване неблагоприятното влияние на реакцията на котвата.", "Подобряване на комутацията на машината.", "Намаляване на основния магнитен поток.", "Нищо от изброените.","В" ,"214 ."],
[ "  Реакцията на котвата в постояннотоковите машини има:", "Леко размагнитващо действие.", "Намагнитващо действие.", "Магнитният поток под полюса не се променя.", "Нищо от изброените.","А" , "215 ."],
[ "  Кое е преимуществото на постояннотоковите двигатели, заради което все още се използват широко в практиката?", "По-проста конструкция.", "По-лесна поддръжка.", "Плавно регулиране на честотата на въртене в широк диапазон.", "Нищо от изброените.","В" ,"216 ."],
[ "  Корабните консуматори на електрическа енергия се защитават от:", "Обратна мощност, претоварване, прегряване, късо съединение.", "Претоварване, работа на 2 фази, самопускане, работа при понижено напрежение, външно късо съединение.", "Понижена честота, понижено напрежение, външно късо съединение.", "Нищо от изброените.","Б" , "217 ."],
[ "  Tокът на настройката на максимално токовия изключвател е:", "По-малък от номиналния ток на двигателя.", "По-голям от номиналния ток на двигателя.", "Не зависи от номиналния ток на двигателя.", "Нищо от изброените.","Б" ,"218 ."],
[ "  Могат ли стопяеми предпазители да защитават ел.двигател от претоварване?", "Да, защитават го от малки претоварвания.", "Да, защитават го от големи претоварвания.", "Не могат да защитават двигателя от претоварване.", "Нищо от изброените.","В" , "219 ."],
[ "  От коя мрежа се захранва аварийното осветление по канижелите?", "Осветителна мрежа.", "Аварийна осветителна мрежа.", "Малоаварийна осветителна мрежа.", "Мрежа за аварийна сигнализация.","В" ,"220 ."],
[ "  Коя е основната причина за възникване на къси съединения?", "Форсмажорни условия на експлоатация.", "Аварийни ситуации по обективни причини.", "Грешки на обслужващият персонал.", "Производствени дефекти.","В" , "221 ."],
[ "  Кой е най-големия недостатък на автотрансформатора?", "Високата себестойност.", "Значително по-сложна конструкция.", "Липса на изолация между първична и вторична страна.", "Всичко изброено.","В" ,"222 ."],
[ "  Кое от изброените устройства е сравняващо?", "Суматор.", "Мостова схема.", "Компаратор.", "Всички изброени.","Г" , "223 ."],
[ "  При кое регулиране на корабните асинхронни задвижвания качеството на процеса е най-високо?", "Промяна на броя на чифтовете полюси.", "Честотно регулиране.", "Промяна на захранващото напрежение.", "Използване на многоскоростни ел. двигатели.","Б" ,"224 ."],
[ "  Какви са първите действия при Black-Out ?", "Информираме главния механик.", "Информираме мостика за причините и вероятното време за рестарт.", "Разследваме причината.", "Изключваме алармата.","Б" , "225 ."],
[ "  Коя електрическа мощност се измерва във Варове (VAr)?", "Реактивната мощност.", "Мощност на трансформация.", "Пълната мощност.", "Активната мощност.","А" ,"226 ."],
[ "  Коя електрическа мощност се измерва във Волт-ампери ( VA )?", "Реактивната мощност.", "Пълната мощност.", "Капацитивна мощност.", "Активната мощност.","Б" , "227 ."],
[ "  Коя електрическа мощност се измерва във Ватове ( W )?", "Реактивната мощност.", "Пълната мощност.", "Активната мощност.", "Капацитивната мощност.","В" ,"228 ."],
[ "  Как дефинираме привидната мощност на електрическите вериги?", "Цялата мощност, която консумира електрическа верига за променлив ток.", "Активната мощност, която консумира електрическа верига за променлив ток.", "Индуктивната мощност, която консумира електрическа верига за променлив ток.", "Капацитивната мощност, която консумира електрическа верига за променлив ток.","А" , "229 ."],
[ "  Графика на коя функционална зависимост са изкуствените характеристики на корабните електрозадвижвания?", "На въртящото се магнитно поле от въртящият момент на електродвигателя.", "На оборотите на ел. двигателя от въртящият момент.", "На тока през статорната намотка от напрежението към електродвигателя.", "На натоварването по механичен път от електрическата мощност, приложена за това натоварване.","Б" ,"230 ."],
[ "  Двигателят бучи силно. Нагряването на статорната намотка е неравномерно. Възможни причини?", "В статорната намотка има късо съединение.", "Статорната намотка е свързана неправилно.", "Броят на навивките в отделните секции на статорната намотка не е еднакъв.", "Всичко изброено.","Г" , "231 ."],
[ "  Еднофазния АД потегля добре без товар, а при наличие на товар потегля с понижена скорост. Възможна повреда?", "Натоварването при пускане е голямо.", "По-ниско от номиналното напрежение на входа.", "Проблеми в лагерните възли на ел. двигателя.", "Всичко изброено.","А" ,"232 ."],
[ "  Линейните контактори могат да защитават двигателите от:", "Работа на две фази.", "Претоварване.", "Понижено напрежение.", "Нищо от изброените.","В" , "233 ."],
[ "  Инсталационните прекъсвачи могат да се използват за защита на двигателите от:", "Къси съединения.", "Претоварване.", "Къси съединения и претоварване.", "Всичко изброено.","Г" ,"234 ."],
[ "  Кои електрически машини се използват като основни енергийни източници?", "Генератори за постоянен ток с паралелно възбуждане.", "Трифазни синхронни генератори.", "Трифазни синхронни двигатели.", "Нищо от изброените.","Б" , "235 ."],
[ "  Къде се възбужда основния магнитен поток на електрическата машина?", "В котвата.", "В индуктора.", "В допълнителните полюси.", "Нищо от изброените.","Б" ,"236 ."],
[ "  Къде се индуктира Е.Д.Н. на електрическата машина?", "В индуктора.", "В котвата.", "В допълнителните полюси.", "Нищо от изброените.","Б" , "237 ."],
[ "  Трифазната котвена намотка на синхронните генератори със средна и голяма мощност се разполага на:", "Ротора.", "Статора.", "Полюсите.", "Нищо от изброените.","Б" ,"238 ."],
[ "  Реакцията на котвата на синхронните генератори зависи от:", "Величината на честотата на напрежението.", "Величината на тока и характера на товара.", "Честотата на въртене на ротора.", "Нищо от изброените.","Б" , "239 ."],
[ "  При чисто активен товар реакцията на котвата на синхронните генератори се нарича:", "Напречна.", "Надлъжна размагнитваща.", "Надлъжна намагнитваща.", "Нищо от изброените.","А" ,"240 ."],
[ "  При чисто индуктивен товар реакцията на котвата на синхронните генератори се нарича:", "Напречна.", "Надлъжна размагнитваща.", "Надлъжна намагнитваща.", "Нищо от изброените.","Б" , "241 ."],
[ "  При чисто капацитивен товар реакцията на котвата на синхронните генератори се нарича:", "Напречна.", "Надлъжна размагнитваща.", "Надлъжна намагнитваща.", "Нищо от изброените.","В" ,"242 ."],
[ "  С какъв товар работят обикновенно синхронните генератори?", "Постояннотоков.", "Капацитивен.", "Активно-индуктивен.", "Нищо от изброените.","В" , "243 ."],
[ "  При кои електродвигатели колебанията в захранващото напрежение не оказват влияние върху честотата на въртене?", "Синхронните.", "Асинхронните.", "Двигателите с паралелно възбуждане.", "Нищо от изброените.","А" ,"244 ."],
[ "  В кои случаи е за предпочитане използването на синхронни двигатели?", "При редки пускания, отсъствие на необходимост от регулиране на скоростта и необходимост от подобряване на фактора на мощността на електроцентралата.", "При необходимост от регулиране на скоростта.", "При чести пускания.", "Нищо от изброените.","А" , "245 ."],
[ "  Кой от изброените електродвигатели има астатична механична характеристика?", "Синхронният.", "Асинхронният.", "Постояннотоковият с паралелно възбуждане.", "Нищо от изброените.","А" ,"246 ."],
[ "  Пусковата намотка на синхронните двигатели с асинхронно пускане се разполага:", "В каналите на ротора.", "В полюсните накрайници на статора.", "В каналите на котвената намотка.", "Нищо от изброените.","А" , "247 ."],
[ "  Какви са недостатъците на променливотоковите колекторни двигатели?", "По-високи обороти.", "Наличие на колекторно-четков апарат.", "Неустойчиви са в голям диапазон на натоварване.", "По-трудно се регулира скоростта.","Б" ,"248 ."],
[ "  Какви са недостатъците на асинхронния ел. двигател пред универсалния колекторен двигател?", "Невъзможност за постигане на по- високи обороти от синхронните.", "По-сложни схеми за регулиране на скоростта.", "А) и Б).", "Има по-малък моторесурс.","В" , "249 ."],
[ "  Кои са предимствата при използването на контактори за управление на електрозадвижванията?", "Разделяне на силовите вериги от веригите за управление на бобините (оперативните вериги).","Възможност за приложение на дистанционно автоматично управление СДАУ на електрозадвижванията.", "Облекчен ремонт.", "Всичко изброено.","Г" ,"250 ."],
[ "  Откъде произтича наименованието “нулева защита” на защитата от самопускане?", "От решението за защита от самопускане при управление на правотокови електрозадвижвания с пусков реостат.", "От нулевата стойност на тока при възстановяване на захранването.", "От нулева мощност на консуматора при включване на захранването.", "От нулевото напрежение към консуматорите.","А" , "251 ."],
[ "  От колко свързани помежду си машини се състои схемата за управление на електрозадвижванията за постоянен ток по система “генератор-двигател” ?", "От три.", "От две.", "От четири.", "От една.","А" ,"252 ."],
[ "  Правилната точка на включване на генератора при синхронизация е когато стрелката на синхроноскопа е в позиция “11 часа” към “12 часа” поради:", "Закъснение на стрелката на синхроноскопа.", "Грешка във фазите на генератора.", "За компенсация на грешка при синхронизацията.", "За компенсация на времето на включване на АВП /автоматичния въздушен прекъсвач/.","Г" , "253 ."],
[ "  Какво гласи първият закон на Кирхов?", "Алгебричната сума на всички токове в даден възел на една верига е равна на нула.", "Сумата на напреженията в затворен контур от електрическа верига е равна на сумата на електродвижещите напрежения в същия контур.", "Алгебричната сума на напреженията в който и да е възел на една верига е равна на нула.","Сумата от токовете в затворен контур на една верига е пропорционален на отношението на напрежението към импеданса.","А" ,"254 ."],
[ "  Болшинството от токоизправителите работят при:", "Активно-индуктивен товар.", "Активно-капацитивен товар.", "Активен товар.", "А) и Б) .","Г" , "255 ."],
[ "  Кой от случаите считаме за граничен по отношение на проблеми с искренето в колектора?", "Забавена комутация при която плътността на тока под четките става критична и се появява силно искрене.", "Значително искрене под целия край на четките с наличие на едри излитащи искри вследствие на значително почерняване на колектора.", "Искрене, при което искрите под отделните пластини прерастнат в плътна огнена обвивка около колектора.", "Всички изброени.","Г" ,"256 ."],
[ "  Кой от посочените електродвигатели се изпълнява за малки мощности /до 150 W/?", "Променливотоков еднофазен колекторен електродвигател.", "Синхронен реактивен електродвигател.", "Вентилен електродвигател.", "Реактивно-хистерезисен електродвигател.","Г" , "257 ."],
[ "  В коя от посочените видове техника Е.Д.Н. и токовете се изменят по синусоидален закон?", "Изчислителна техника.", "Електрически генератори.", "Автоматика.", "Всички изброени.","Б" ,"258 ."],
[ "  В кой от случаите на пускане на синхронните двигатели е необходим отделен източник на електрическа енергия?", "Асинхронно пускане.", "Пускане с помощта на помощен двигател.", "Честотно пускане.", "Нищо от изброените.","В" , "259 ."],
[ "  Защитата на СГ от външно късо съединение се осъществява с помощта на:", "Максимални изключватели.", "Минимално напреженов изключвател.", "Реле за обратна мощност.", "Нищо от изброените.","А" ,"260 ."],
[ "  Защитата на СГ от понижено напрежение се осъществява с помощта на:", "Максимални изключватели.", "Минимално напреженов изключвател.", "Реле за обратна мощност.", "Нищо от изброените.","Б" , "261 ."],
[ "  Защитата на СГ от преминаване в двигателен режим се осъществява с помощта на:", "Максимални изключватели.", "Минимално напреженов изключвател.", "Реле за обратна мощност.", "Нищо от изброените.","В" ,"262 ."],
[ "  Кое изпълнително устройство защитава СГ при ненормални режими?", "Автоматичният генераторен автомат.", "Термични релета.", "Стопяеми предпазители.", "Нищо от изброените.","А" , "263 ."],
[ "  В какви граници се намира задръжката по време на генераторните автомати при външно късо съединение?", "0.05 -1 sec.", "0.5 -2 sec.", "0 - 3 sec.", "Нищо от изброените.","А" ,"264 ."],
[ "  Съвременните електронни устройства за комплексна защита на синхронните генератори ги защитават от:", "Работа при всички ненормални и аварийни режими.", "Работа при всички ненормални и аварийни режими с изключение на късо съединение в синхронния генератор.", "Вътрешно късо съединение и работа на две фази.", "Нищо от изброените.","Б" , "265 ."],
[ "  Електролитът на киселинните /оловните/ акумулатори представлява:", "Чиста солна киселина, разредена с дестилирана вода.", "Чиста сярна киселина, разредена с дестилирана вода.", "Калиева основа, разредена с дестилирана вода.", "Нищо от изброените.","Б" ,"266 ."],
[ "  Кое е характерното за грубото синхронизиране на синхронния генератор?", "Честотата се установява неточно (грубо).", "Включването на синхронния генератор към шините става през дросел без да се контролира фазовия ъгъл на Е.Д.Н. на генератора спрямо напрежението на шините.", "Включването става при неточно установяване на Е.Д.Н. (в сравнение с напрежението на шините).", "Нищо от изброените.","Б" , "267 ."],
[ "  Кога напрежението на синхронния генератор без регулатор на възбуждането може да се повиши при натоварване?", "Когато генераторът се натоварва с активна мощност.", "Когато генераторът се натоварва с индуктивна мощност.", "Когато генераторът се натоварва с капацитивна мощност.", "Нищо от изброените.","В" ,"268 ."],
[ "  Зависи ли магнитният поток в магнитната система на електромагнита за постоянен ток от стойността на въздушната междина?", "Магнитният поток е постоянен и не зависи от стойността на междината.", "Потокът нараства линейно при увеличаването на въздушната междина.", "Магнитният поток намалява при нарастването на въздушната междина.", "Нищо от изброените.","В" , "269 ."],
[ "  Какви защити може да осигури на участък от електрическата мрежа един мрежов автоматичен прекъсвач?", "От обратна мощност.", "Майерова защита.", "От късо съединение.", "Нищо от изброените.","В" ,"270 ."],
[ "  При включване на автоматичната перална машина в перално отделение, двигателя се върти в една посока, а при обръщане на захранващия шнур в обратна посока. Къде е повредата?", "Късо съединение в пускова или работна намотка.", "Проблем в захранващия шнур.", "Късо съединение в програматора.", "Нищо от изброените.","А" , "271 ."],
[ "  Кой тип ротор е активно-реактивен", "Неявнополюсен с постоянни магнити и кафезна намотка.", "Явнополюсен с кафезна намотка.", "Явнополюсен с постоянни магнити и кафезна намотка.", "Хистерезисен.","В" ,"272 ."],
[ "  Почистването на колектора се извършва при:", "На малки обороти.", "При номинални обороти, но без товар.", "При превъртане с помощта на поворотно устройство.", "При спрян ротор.","Г" , "273 ."],
[ "  Има ли трансформатор само с една намотка /първична/ от която да е направен напреженов извод?", "Да, повишаващ автотрансформатор.", "Не, не е възможна електромагнитна индукция само с една намотка.", "Да, понижаващ автотрансформатор.", "Да, това е принципа на действие на високоволтовите бобини на принудителното запалване при бензиновите двигатели.","В" ,"274 ."],
[ "  При кои трансформатори е опасно да се отвори вторичната верига по време на работа?", "Токов трансформатор.", "Напреженов трансформатор.", "Автотрансформатор.", "Не е опасно при никой от трансформаторите.","А" , "275 ."],
[ "  От какво не зависят механичните загуби при електродвигателите?", "Оборотите.", "Натоварването.", "Триенето в лагерите.", "Вентилация на ротора.","Б" ,"276 ."],
[ "  Кои двигатели за постоянен ток не трябва да се пускат ненатоварени?", "Двигатели с постоянни магнити.", "Двигатели с независимо възбуждане.", "Двигатели с паралелно възбуждане.", "Двигатели с последователно възбуждане.","Г" , "277 ."],
[ "  Какво ще се получи, ако двигател с независимо или шунтово възбуждане продължи да работи при прекъсване на възбудителната му верига?", "Ще развие свръхобороти.", "Ще работи без промяна на оборотите.", "Ще намали драстично оборотите си.", "Не е възможно двигателя да продължи да работи без възбуждане.","А" ,"278 ."],
[ "  Коя от изброените електрически машини има най-ограничено приложение?", "Синхронни електродвигатели.", "Асинхронни генератори.", "Асинхронни двигатели.", "Монофазни трансформатори.","Б" , "279 ."],
[ "  Кое е общото в принципа на действие между асинхронния двигател и трансформатора с въздушна междина?", "И двете машини работят в състава на корабната електростанция като машини със самоиндукция.", "Енергията се пренася от първичната до вторичната страна чрез електромагнитна индукция, без галванична връзка.", "Регулирането им става чрез промяна на тока в управляващата верига.","Нищо от изброените.","Б" ,"280 ."],
[ "  Коя от изброените операции ще извършим първа, преди да пуснем електромашина, която е била в дълговременно бездействие?", "Намазване и превъртане.", "Проверка за забравени предмети в машината.", "Измерване и записване на съпротивлението на изолацията.", "Боядисване ка корпуса на машината.","В" , "281 ."],
[ "  Еднофазен еднополупериоден неуправляем изправител работи с противо Е.Д.Н., както е показано на схемата. Колко е максималното обратно напрежение върху диода, ако се изходи от приложената времедиаграма?<img src='images/el.diagram.png' align='center' alt='времедиаграма'>", "24 V.", "40 V.", "64 V.", "Нищо от изброените.","В" ,"282 ."],
[ "  Синхронен генератор работи паралелно на мощна мрежа при коефициент на мощността cosφ=1,0. Какво ще се получи, ако се увеличи възбуждането на генератора?", "Генераторът ще заработи в двигателен режим.", "Генераторът ще се натовари с индуктивна мощност и коефициентът на мощност ще стане по-малък от единица.", "Генераторът ще се натовари с капацитивна мощност и коефициентът на мощност ще стане по-малък от единица.", "Нищо от изброените.","Б" , "283 ."],
[ "  Регулаторите на напрежение на синхронните генератори на корабната електроцентрала имат статическа характеристика. С каква цел е приет статизмът на характеристиките?", "За точно стабилизиране на напрежението.", "За точно разпределение на активния товар при паралелна работа.", "За точно разпределение на реактивния товар при паралелна работа.", "Нищо от изброените.","В" ,"284 ."],
[ "  Плътността на електролита на киселинен акумулатор е 1,28. На каква част от номиналния капацитет (в проценти) може да се разчита при разреждането му?", "0,2", "0,5", "100%.", "Нищо от изброените.","В" , "285 ."],
[ "  Какво е необходимо, за да може валогенераторът да работи паралелно с дизелгенератор?", "Да бъде синхронизиран и натоварен с активна мощност чрез повдигане на статичната му характеристика с помощта на сервомотора.", "Мощностите на валогенератора и дизелгенератора да бъдат еднакви.", "Статичните характеристики “честота във функция от активната мощност” на дизелгенератора и валогенератора да имат еднакъв наклон .", "Нищо от изброените.","В" ,"286 ."],
[ "  Какво представлява микропроцесорният контролер?", "Блок от микропроцесора, който управлява цялата програма.", "Микрокомпютър, произвеждан специално за управление на технологични процеси.", "Блок от микропроцесора, който управлява работата на останалите блокове на микропроцесора.", "Нищо от изброените.","Б" , "287 ."],
[ "  Какво представлява заявката за прекъсване в микропроцесорната система?", "Сигнал от периферно устройство, който прекъсва нормалния ход на програмата и предизвиква изпълнението на определена подпрограма.", "Сигнал от микропроцесора към периферно устройство, който прекъсва работата на това устройство.", "Сигнал от паметта към микропроцесора, който прекъсва хода на програмата и поставя системата в състояние на очакване на следващ сигнал за продължение на работата.", "Нищо от изброените.","А" ,"288 ."],
[ "  Какви стойности на електрическите величини (U, I, P) показват измервателните уреди на таблата, ако корабно електрообзавеждане е за постоянен ток?", "Средни.", "Моментни.", "Ефективни.", "Нищо от изброените.","А" , "289 ."],
[ "  Какви стойности на електрическите величини (U, I, P) показват измервателните уреди на таблата, ако корабно електрообзавеждане е за променлив ток?", "Средни.", "Средни за Р и ефективни за U, I.", "Ефективни.", "Нищо от изброените.","Б" ,"290 ."],
[ "  Кои магнитни материали се използуват в магнитните вериги на електрическите машини и електрическите апарати?", "Диамагнити.", "Парамагнити.", "Феромагнити.", "Нищо от изброените.","В" , "291 ."],
[ "  Кои генератори наричаме компаудни и какво приложение имат те?", "Това са постоянно-токови генератори със смесено възбуждане с приложение в подемните механизми.", "Смесено възбуждане двете полета са едно срещу друго/обратно компаундиране/ големи токове на късо, електрозаваръчни генератори, правотокови.", "Правотокови, със смесено възбуждане двете полета са еднопосочни, големи токове при ниски обороти, електростартови генератори.", "Пускови правотокови генератори с еднакво насочени магнитни полета /право компаундиране/на двете възбудителки-лифтове.","Б" ,"292 ."],
[ "  Какво е характерно за дроселите за високи честоти?", "Характеризират се с голямо съпротивление за токовете с голяма честота.", "Тези дросели се изработват във вид на еднослойни и многослойни бобини, често пъти без магнитопроводи.", "Почти безпрепятствено пропускат нискочестотните токове.", "Всичко изброено.","Г" , "293 ."],
[ "  За какво служи кондензаторът и как се включва той във веригата на луминисцентната лампа?", "Схемата не включва в състава си кондензатор.", "Във веригата има два кондензатора - единия осигурява стартирането, а другия повишава cosφ на електрическата мрежа. Паралелно включване.", "Служи за компенсатор на пулсациите на тока във веригата - включва се паралелно на лампата.", "Включват се последователно за да повишат фактора на мощността cosφ на електрическата мрежа.","Б" ,"294 ."],
[ "  Кога се прилага паралелно свързване на две луминисцентни лампи?", "При необходимост от по-висока степен на осветеност на помещението.", "Практически това свързване се прилага само в случаи, когато желаем да имаме така наречената “сигурност на свързване”.", "Такова свързване не е приложимо.", "Б) и А).","Б" , "295 ."],
[ "  Какво представлява реакторът в силнотоковите вериги?", "Дросел без стоманено ядро и малък реактанс за ограничаване на токовете при късо съединение за големи генераторни мощности.", "Ограничител на натоварването на генератори с големи мощности.", "Силнотокова защита от късо съединение изпълнена чрез въздушни прекъсвачи.", "Елемент от котвата на гребния електродвигател при корабните електропропулсивни задвижвания.","А" ,"296 ."],
[ "  Фарад е единица мярка за:", "Индуктивност.", "Количество електричество.", "Магнитна проницаемост.", "Капацитет.","Г" , "297 ."],
[ "  Кое от посочените излъчвания има най-голяма честота на трептене?", "Ултрвиолетово.", "Видима светлина.", "Инфрачервено.", "Рентгеново.","Г" ,"298 ."],
[ "  Какъв е смисъла на понятието “1С - /Един кулон/” ?", "Единица мярка за количество електричество.", "Единица мярка за капацитет на акумулаторна батерия.", "Когато електрически ток със сила един ампер тече в продължение на една секунда, той пренася електрически заряд един кулон.", "Всичко изброено.","Г" , "299 ."],
[ "  Какво е общото правило за токовете - в коя от намотките на трансформатора токът е по-голям?", "Токът и напрежението на трансформатора в първичната и вторичната намотка са правопропорционални.", "Произведението от напрежението и силата на тока остава постоянно за двете намотки.", "При понижаващи трансформатори тока в първичната намотка е по-голям от тока във вторичната.", "При повишаващи трансформатори тока в първичната намотка е по-малък от тока във вторичната.","Б" ,"300 ."],
[ "  От какви магнитни материали се правят постоянните магнити?", "От магнитно меки материали.", "От магнитно твърди материали.", "От двата вида материали посочени в А) и Б).", "Нищо от изброените.","Б" , "301 ."],
[ "  Кое е основното свойство на полупроводниковия P/N преход?", "Усилва електрически сигнали.", "Има еднопосочна електропроводимост (вентилно свойство).", "Генерира импулсни електрически сигнали.", "Нищо от изброените.","Б" ,"302 ."],
[ "  Кои полупроводникови прибори се използуват в схеми за защита на електрически машини от прегряване?", "Варистори.", "Термистори.", "Тензорезистори.", "Нищо от изброените.","Б" , "303 ."],
[ "  Операционните усилватели се използуват:", "В аналогови схеми.", "В импулсни схеми.", "В аналогови и импулсни схеми.", "Нищо от изброените.","В" ,"304 ."],
[ "  Логическите схеми имат сигнали с:", "Две нива.", "Три нива.", "Произволен брой нива.", "Нищо от изброените.","А" , "305 ."],
[ "  В микропроцесорните системи информацията се представя:", "С аналогови електрически сигнали.", "С импулсни електрически сигнали.", "С кодова комбинация от определен брой импулси с две нива.", "Нищо от изброените.","В" ,"306 ."],
[ "  Как ще се измени средната стойност на напрежението на изхода на токоизправител ако се замени активен товар(реостат) с активно-индуктивен (бобина)?", "Увеличава се.", "Намалява се.", "Не се изменя.", "Нищо от изброените.","Б" , "307 ."],
[ "  На какво реагират стабилизаторите на напрежение?", "На стойността на захранващото напрежение в определени граници.", "На стойността на товарния ток.", "На двата фактора посочени в А) и Б).", "Нищо от изброените.","В" ,"308 ."],
[ "  3ащо външната характеристика U(1) на генератор за постоянен ток има статизъм?", "Поради реакцията на котвенния ток.", "Поради пад на напрежение в котвената намотка.", "Поради двете причини посочени в А) и Б) .", "Нищо от изброените.","В" , "309 ."],
[ "  Ако на синхронен генератор, работещ в паралел, се промени стойността на тока на възбуждането, какво ще стане?", "Ще се промени активното натоварване.", "Ще се промени честотата на генерираното напрежение.", "Ще се променят стойностите на генерираното напрежение и реактивния товар.", "Нищо от изброените.","В" ,"310 ."],
[ "  Ако се свържат в паралел два еднакви трансформатора с различни по стойност напрежения на късо съединение какво ще стане?", "Натоварването им ще се разпредели обратно пропорционално на напреженията на късо съединение.", "Право пропорционално.", "Ще работят с еднакво натоварване.", "Нищо от изброените.","А" , "311 ."],
[ "  При изпълнение на какво условие е възможно използуване на пускател Y/ D за асинхронен двигател?", "Двигателя да е с навит ротор.", "Двигателя да е с накъсо съединен ротор.", "Фазовите намотки на статора да са оразмерени за линейното напрежение на мрежата.", "Нищо от изброените.","В" ,"312 ."],
[ "  Кое определя режима (генераторен или двигателен) на работа на синхронен генератор, ако той е свързан към мрежа за променлив ток?", "Фактора на мощността на потребяваната електроенергия.", "Фазовата разлика между полюсите на възбуждането и полюсите на въртящото се магнитно поле.", "Стойността на тока на възбуждане.", "Нищо от изброените.","Б" , "313 ."],
[ "  Защо коефициента на трансформация се изчислява чрез отношение на напреженията при режим на празен ход?", "Поради малката относителна стойност на тока загубите при този режим се пренебрегват и отношението се прецизира.","Токовите загуби стават съизмерими с магнитните загуби , които са нищожни и не се отчитат при пресмятане на отношението.", "Загубите на празен ход са само магнитни (от хистерезис и вихрови токове) и отчитаме точното отношение.", "Измерването на параметрите на трансформатора на празен ход дават теоретичните показатели с много прецизни стойности.","В" ,"314 ."],
[ "  Какво представлява “скин-ефекта” при проводниците?", "Проблем при изолацията на кабелите.", "Повърхностен проблем при окисляваването на метала на проводниците, свързан с електропроводимостта на този слой.", "Нелинейност на проводимостта по радиуса на напречни сечения с над 200 квадратни милиметра площ.", "Нееднаква плътност на тока при премимаване през напречното сечение на проводници с малки диаметри в магнитно поле.","В" , "315 ."],
[ "  Кое от твърденията не е вярно по отношение на магнитната проницаемост μ?", "Магнитната проницаемост се изменя с магнитното поле.", "Степента на намагнитване на материал, изменящо се линейно (в определени граници, при определени условия) спрямо приложеното магнитно поле.", "Електрическото съпротивление на феритните метали е обратно пропорционално на магнитната проницаемост μ.", "Всичко изброено.","Г" ,"316 ."],
[ "  Потокът на магнитното поле се измерва във:", "Волтове - V.", "Ватове - W.", "Вебери - Wb.", "Фонове - phon.","В" , "317 ."],
[ "  Коя защита е предназначена за предпазване на човешкия организъм от поражение от електрически ток?", "Максималнотоковата.", "Защитата от късо съединение.", "Маеровата защита.", "Дефектнотоковата.","Г" ,"318 ."],
[ "  Има ли приложение дефектнотоковата защита в корабните електроцентрали и корабното електрооборудване?", "Не.", "Има приложение в хладилната техника.", "Намира приложение само при оборудване на корабните камбузи и битови помещения.", "Само при пасажерски кораби.","А" , "319 ."],
[ "  Кое е основното предимство на автотрансформаторите?", "Токовете на късо съединение са по- малки отколкото при трансформаторите с две намотки.", "Използва се, когато трябва да се свържат мрежи с ниско напрежение към мрежи с високо напрежение.", "Имат ниска себестойност.", "Имат по-висока степен на безопастност в сравнение с трансформаторите с две намотки.","В" ,"320 ."],
[ "  Гребните електродвигатели са обикновенно:", "Двукотвени машини, като двете котви са свързани последователно, паралелно или са самостоятелни.", "Еднокотвени машини.", "Трикотвени машини, като свързването на котвите зависи от схемата на генераторите.", "Многокотвени машини със свързване на котвите в управляеми групи -последователно, паралелно или смесено за оптим.върт. момент.","А" , "321 ."],
[ "  Коя намотка осигурява трансформирането на електрическия ток в магнитно поле?", "Първичната.", "Вторичната.", "И двете намотки.", "Всичко изброено.","А" ,"322 ."],
[ "  Кои заземявания се отнасят към работните?", "Заземяване на неутралната точка на генераторите и радиоапаратурите.", "Линейно и крайно заземяване на металните обвивки на кабелите.",  "Заземяване на магистрални тръбопроводи, отделните метални елементи на които са свързани електрически.", "Заземяване на мълнеуловителя.","А" , "323 ."],
[ "  Каква е разликата между генераторните и инсталационните автоматични прекъсвачи?", "Генераторните позволяват местна настройка на стойностите на параметрите, на които реагират, докато инсталационните имат фиксирана заводска настройка.", "Няма разлика.", "Разликата е в стойностите на номиналните токове.", "Нищо от изброените.","А" ,"324 ."],
[ "  Как се осъществява автоматично разпределение на натоварването между паралелно работещи генератори за постоянен ток?", "Чрез регулиране честотата на въртене на първичните двигатели.", "Чрез регулиране възбуждането на генераторите.", "Чрез регулиране статизма на външните характеристики.", "Нищо от изброените.","Б" , "325 ."],
[ "  При подготовката на главното разпределително табло за приемане на електрическа енергия, кое действие ще предприемем най-напред?", "Да се провери с мега-омметър състоянието на изолацията на таблото.", "Да се извърши външен оглед на ГРТ за сигурност, че върху тоководещите му части няма външни предмети.", "Да се провери отсъствието на напрежение в шините на ГРТ.", "Да се провери да не са включени въздушните автоматични прекъсвачи или други комутационни апарати.","В" ,"326 ."],
[ "  При теста на електрическа машина след ремонт кои параметри проверяваме в действие първо?", "Температурите на отделните части на електрическата машина.", "Работата на колектора и четките.", "Стойността на напрежението, развивано от генератора или тока на празен ход от електродвигателя.", "Боядисването на корпуса на машините.","В" , "327 ."],
[ "  Контакторът е апарат за управление с две устойчиви положения (включено и изключено), чието аварийно задвижване е:", "Електромагнитно.", "Ръчно.", "Пневматично.", "Хидравлично.","Б" ,"328 ."],
[ "  Как дефинираме свръхпроводимостта?", "В свръхпроводник при температури по-ниски от критичната, магнитният поток е нула - ефект на Майснер.", "Всичко изброено.", "Определени вещества достигат скокообразно до свръхпроводимост при температури близки до абсолютната нула.", "Характеризира се с пълно отсъствие на електрическо съпротивление","Г" , "329 ."],
[ " Кои опитно установени факти не е възможно да се обяснят с електромагнитната теория на светлината?", "Фотоефектът е безинерционен.", "Скоростта на светлината е пределна.", "Светлината поражда магнетизъм.", "Всичко изброено.","А" ,"330 ."],
[ "  Кое твърдение за ЕДН и за напрежението е вярно?", "Е.Д.Н. и напрежението имат една и съща физическа природа.", "В източника, Е.Д.Н. и напрежението имат различни посоки, те са насрещни.", "Е.Д.Н. и напрежението са потенциални разлики.", "А), Б) и В).","Б" , "331 ."],
[ "  Коя неизправност най-често се среща при соленоидните вентили?", "Самопроизволно отваряне при замърсяване на отверстията във вентила.", "Изгаряне на соленоида.", "Пропуски, следствие неплътност от износване.", "Заклинване.","Г" ,"332 ."],
[ "  Характеристиката на празен ход на генераторите за постоянен ток дават възможност да се определи:", "Необходимите обороти за достигане на номиналното Е.Д.Н.", "Необходимото съотношение между оборотите и номиналния ток на възбуждане.", "Необходимият ток на възбуждане за получаване на номинално Е.Д.Н. на машината.", "Съпротивителния момент от загубите в машината .","Г" , "333 ."],
[ "  Коя честота на въртене наричаме синхронна скорост при асинхронните машини?", "Скоростта на въртене на ротора в генераторен режим.", "Честотата на въртене на ротора в двигателен режим.", "Честотата на тока в ротора в спирачен режим.", "Честотата на въртене на магнитното поле.","Г" ,"334 ."],
[ "  Каква информация носят външните характеристики на синхронните генератори?", "Позволяват да се направи заключение за мощността на първичния двигател от оборотите на генератора под номинален товар.", "Позволяват да се определи процентния пад на напрежението при увеличаване на тока на натоварване от нула до номинална стойност при n = const.", "Позволява да се пресметне необходимия ток на възбуждане за номинален режим на натоварване / на номинален ток/.", "Позволява да се определи процентния пад на тока, съобразно с процентното намаляване на оборотите.","Б" , "335 ."],
[ "  Ако асинхронен двигател е изключен от топлинно биметално реле и след изстиване не се стартира, какво следва да се направи?", "Да се проверят стопяемите предпазители.", "Да се ресетира биметалното реле.", "Да се изключи и включи електрозахранването отново.", "Нищо от изброените.","Б" ,"336 ."],
[ "  Какво ще стане ако не се отвори капака за охлаждане на електродвигателя на швартови механизъм?", "Двигателя ще прегрее.", "Двигателя няма да може да се пусне.", "При подаване на команда за пускане ще сработи защита.", "Нищо от изброените.","Б" , "337 ."],
[ "  Крайните прекъсвачи в управлението на задвижването на количката на мостов кран са предназначени за:", "Изключване на задвижването при горно крайно положение на товара.", "Изключване на задвижването при крайни положения на количката.", "Изключване на задвижването при крайни положения на въртене на крана.", "Нищо от изброените.","Б" ,"338 ."],
[ "  Какъв е начинът на практика да се разбере дали един електродвигател е претоварен:", "На пипане да се провери за прегряване.", "Да се намали товара и да се отчетат показанията на измерителните прибори.", "Да се измери тока и да се сравни с фирмената табелка.", "Да се проверят термодвойките.","В" , "339 ."],
[ "  Импедансът се влияе от изменението на:", "Индуктивността.", "Съпротивлението.", "Капацитета.", "Всяко от горните.","Г" ,"340 ."],
[ "  Как се осъществява автоматично разпределение на натоварването между паралелно работещи генератори за променлив ток?", "Чрез регулиране мощността на първичните двигатели, като се запазва честотата им на въртене.", "Чрез регулиране възбуждането на генераторите.", "Чрез регулиране статизма на външните характеристики.", "Нищо от изброените.","А" , "341 ."],
[ "  Подобряване на фактора на мощността (cos φ) на корабната електроенергийна система е доближаване до явлението:", "Паралелен резонанс (резонанс на токовете).", "Последователен резонанс (резонанс на напреженията).", "Никое от посоченото в А) и Б).", "Нищо от изброените.","А" ,"342 ."],
[ "  С какво трябва да се доливат акумулаторите (основни и киселинни) при спадане нивото на електролита вследствие на изпарение?", "С електролит със същата концентрация.", "С дестилирана вода.", "С питейна вода.", "Нищо от изброените.","Б" , "343 ."],
[ "  Какво най-напред трябва да се направи в случай на попаднал човек под токов удар?", "Да се изключи електрозахранването.", "Да се отстрани човека от мястото на допира.", "Да се провери човека дали диша.", "Нищо от изброените.","А" ,"344 ."],
[ "  Как се регулира честотата на въртене на многоскоростните асинхронни електродвигатели?", "Като се изменя стойността на захранващото напрежение.", "Като се изменя стойността на честотата на захранващото напрежение.", "Като се изменя броя на чифтовете полюси на статорната намотка.", "Нищо от изброените.","В" , "345 ."],
[ "  На какво положение трябва да бъде превключвателя за избор на режима на управление на автоматизирано рулево задвижване по време на маневра?", "Дистанционно (просто) управление.", "Следящо управление.", "Автоматично управление.", "Нищо от изброените.","Б" ,"346 ."],
[ "  Какво се променя в действието на “Аварийно предупредителната система” при превключване от “вахтено” на “безвахтено” обслужване?", "Нищо не се променя.", "Аварийните сигнали се подават и към “системата за оповестяване”.", "Аварийните сигнали се подават и към “авралната сигнализация”.", "Нищо от изброените.","Б" , "347 ."],
[ "  Към резистор със стойност 100 ома е приложено напрежение 220 волта. Каква е стойността на възбудения ток?", "11 ампера.", "22 ампера.", "2.2 ампера.", "Нищо от изброените.","В" ,"348 ."],
[ "  Какво означава съкращението „Hz”?", "Честота на променливотоков сигнал.", "Честота на постоянния ток.", "Електрическо съпротивление.", "Нищо от изброените.","А" , "349 ."],
[ "  Двата главни източника на аварийната електрическа енергия са:", "Акумулатори и авариен дизел-генератор.", "Изправители и аварийни дизел-генератори.", "Първични и вторични акумулатори.", "Преобразователи и аварийни генератори.","А" ,"350 ."],
[ "  Когато работи един трифазен генератор, свързан по схема “звезда”, то неутралния проводник:", "Подържа постоянен ток във всяка фаза.", "Подържа постоянна мощност във всяка фаза.", "Подържа постоянно напрежение във всяка фаза.", "Няма протичане на ток, когато мощностите не са изравнени.","В" , "351 ."],
[ "  В случай, че първичния двигател се повреди, променливотоковия генератор е защитен от завъртане като двигател чрез:", "Напреженов регулатор.", "Реле за обратна мощност.", "Ограничител за обратен ток.", "Ватметър.","Б" ,"352 ."],
[ "  Когато е снет товара от вала на един синхронен електродвигател оборотите му ще:", "Намалеят.", "Се увеличат.", "Останат постоянни.", "Се удвоят.","В" , "353 ."],
[ "  Мощността, която се губи в топлина в намотките, когато протича ток през тях е известна като:", "Хистерезисни загуби.", "Вихрови загуби.", "Загуби в медта.", "Топлинни загуби.","В" ,"354 ."],
[ "  Един променливотоков генератор няма да развие работното си напрежение, ако:", "Не може да достигне честотата на въртене.", "Няма възбуждане.", "Регулаторът е повреден.", "Всяко от горните.","Г" , "355 ."],
[ "  Дилектричната якост е:", "Противоположна на потенциалната разлика.", "Възможност на един проводник да пренася силен ток.", "Способност на изолатора да издържа потенциална разлика.", "Якост на магнитното поле.","В" ,"356 ."],
[ "  Кой от следните материали осигурява ниски хистерезисни загуби и се използува за трансформаторни сърцевини?", "Силициева стомана.", "Въглеродна стомана.", "Меко желязо.", "Всяко от горните.","А" , "357 ."],
[ "  На каква вероятна причина би могло да се дължи бързото образуване на пълзящи соли по клемите на киселинна акумулаторна батерия?", "Повредена вентилация на клетките.", "Признак за разреден акумулатор.", "Повишена плътност на електролита.", "Повишен над номиналния ток на зареждане.","В" ,"358 ."],
[ "  Кой експлоатационен фактор определящо влияе върху вътрешното съпротивление на киселинен акумулатор?", "Тока от и към акумулатора.", "Времето на зареждане.", "Периода на разреждане.", "Определя се конструктивно и не зависи от експлоатационни фактори, освен от връзката в клемите.","А" , "359 ."],
[ "  Слънчевите клетки са източник на:", "Пулсиращ ток.", "Постоянен ток.", "Променлив ток.", "Галваничен ток.","Б" ,"360 ."],
[ "  Осцилоскопът представлява инструмент за наблюдение изменението и измерване на:", "Импеданса на електрическите вериги.", "Напрежението.", "Тока.", "Магнитната проницаемост.","Б" , "361 ."],
[ "  Кой от изброените типове амперметри може да се използва за измерване само на променливи токове?", "Магнитоелектрически.", "Детекторен.", "Електродинамичен.", "Термоелектрически.","Г" ,"362 ."],
[ "  Синхронните двигатели се използват за:", "Малки мощности - до 20 kW.", "Средни мощности - до 50 kW.", "Големи мощности - над 100 kW.", "Всички изброени.","В" , "363 ."],
[ "  Асинхронните двигатели се използват за:", "Малки мощности - до 20 kW.", "Средни мощности - до 50 kW.", "Големи мощности - до 100 kW.", "Всички изброени.","Г" ,"364 ."],
[ "  Прехвърлянето на електрически сигнали между две електронни устройства се осъществява чрез галванично разделяне. За целта се използват:", "Биполярни транзистори.", "Полеви транзистори.", "Магнетрони.", "Оптрони.","Г" , "365 ."],
[ "  Кое твърдение не е вярно по отношение на електрическата индукция?", "Източници (стоци) на линии на електричното поле са електричните заряди.", "Линиите на електричната индукция са непрекъснати. Започват от положителните заряди и завършват в отрицателните или в безкрайността.", "Изискването зарядът q да е в центъра на сферичната повърхнина, ограничаваща полето е съществено.", "Броят на линиите, които тръгват от заряда q числено е равен на самия заряд q.","В" ,"366 ."],
[ "  Кое от твърденията се отнася за проводниците?", "Вещества, в които всички заряди са свързани.", "Под въздействие на електричното поле зарядите могат да се местят на микроскопични разстояния.", "Под въздействието на електрично поле зарядите могат да се движат на големи разстояния по целия обем на телата.", "Под въздействие на ел. поле зарядите се местят в молекулите или в йонната им решетка.","В" , "367 ."],
[ "  От какво не зависи капацитета на кондензатора?", "Формата на пластините.", "Взаимното разположение на пластините.", "Диелектрика между тях.", "От заряда на пластините му.","Г" ,"368 ."],
[ "  Според електростатиката, кой е носител на електричната енергия?", "Според електростатиката - полето.", "Според електростатиката - електричните заряди.", "Според електростатиката - капацитета", "Електростатиката не може да определи - определя го електродинамиката.","Г" , "369 ."],
[ "  Забранява се намазването с консистентни смазочни вещества на кои елементи от електрическите машини?", "Колектори.", "Всичко изброено.", "Медни, хромирани или никелирани контакти.", "Детайли, които се затварят херметично.","Б" ,"370 ."],
[ "  Сулфатизацията на плочите на един киселинен акумулатор се предотвратява чрез:", "Поддържане на минимален заряден ток през цялото време.", "Поддържане гъстотата на електролита в рамките препоръчани от производителя.", "Поддържане на силен киселинен разтвор.", "А) или Б).","Б" , "371 ."],
[ "  Свързването на трифазни намотки в схема “триъгълник” се означава със знака:<img src='images/triangle.star.png' align='center'  alt='Star'>", "А", "Б", "В", "Г","Б" ,"372 ."],
[ "  Свързването на трифазни намотки в схема “звезда” се означава със знака:<img src='images/triangle.star.png' align='center'  alt='Star'>", "А", "Б", "В", "Г","А" ,"373 ."],
[ "  На кой параметър реагира звуковата и светлинна сигнализация за прекъсване на захранването на всяка от навигационните светлини?", "Напрежението.", "Съпротивлението.", "Тока.", "Индуктивността.","В" ,"374 ."],
[ "  Какво е минимално допустимото съпротивление на изолацията на корабната електроенергийна система?", "0,7 MΩ.", "0,5 MΩ.", "0,2 MΩ.", "Зависи от конкретната корабна електроенергийна система.","А" , "375 ."],
[ "  Коя грешка при отчитане на показанията на измервателните уреди дефинираме като грешка на паралакса?", "Паралелното отчитане показанията на два уреда едновременно.", "Отчитането на показанието чрез гледане отстрани, а не фронтално отпред.", "Грешка, получена от произволно нулево положение на стрелката на уреда.", "Отчитане на резултата без да се вземе в предвид константата на прибора.","Б" ,  "376 ."],
 
]; 

var questionOrder = []; 
var maxNumberOfQuestions = questions.length;  // do NOT make BIGGER than number of 'questions' array 
function setmaxNumberOfQuestions() { 
   maxNumberOfQuestions = 60;
}
// var maxNumberOfQuestions = 2;  // do NOT make BIGGER than number of 'questions.length' array 
var maxNumberOfQuestions2 = questions.length;
function setQuestionOrder() { 
  questionOrder.length = 0; 
  for (var i=0; i<maxNumberOfQuestions2; i++) { questionOrder.push(i); } 
 //questionOrder.sort(randOrd);   // alert(questionOrder);  // shuffle display order 
  pos = document.getElementById("numb").value-1;  posn = questionOrder[pos]; 
} 

function setQuestionOrder2() { 
  questionOrder.length = 0; 
  for (var i=0; i<maxNumberOfQuestions2; i++) { questionOrder.push(i); } 
  questionOrder.sort(randOrd);   // alert(questionOrder);  // shuffle display order 
  pos = 0;  posn = questionOrder[pos]; 
} 


function $_(IDS) { return document.getElementById(IDS); } 
function randOrd() { return (Math.round(Math.random())-0.5); } 
function renderResults(){ 
  var test = $_("test"); 
  test.innerHTML = "<h2>Имате "+correct+" от "+maxNumberOfQuestions+" правилно отговорени въпроси</h2>"; 
  test.innerHTML +=  +(correct/maxNumberOfQuestions*100).toFixed(0)+'% правилни отговори<br>';
  $_("test_status").innerHTML = "Приключихте теста"; 
  $_('timeleft').innerHTML = ' '; 
  test.innerHTML += "<br><img src='images/curies.gif' align='bottom' width='500' height='247' alt='Lubopitko'><br><br>";
  test.innerHTML += "<button  class= 'button' onclick='location.reload()'>Повторете теста</button>"; 
  
 
  setQuestionOrder(); 
  correct = 0; 
  clearInterval(myVar); 
  return false; 
} 




function renderQuestion() { 
  var test = $_("test"); 
  $_("test_status").innerHTML = "Въпрос "+(pos+1)+" от "+maxNumberOfQuestions; 
  //if (rscore != 0) { $_("test_status").innerHTML += '<br>Текущ въпрос: '+(correct/rscore*100).toFixed(0)+'% правилни отговори'; } 
   if (rscore != 0 && correct == 1 && maxNumberOfQuestions != 60) { $_("test_status").innerHTML += '<br>Имате '+correct+' правилeн отговор'; }
   if (rscore != 0 && correct > 1 && maxNumberOfQuestions != 60) { $_("test_status").innerHTML += '<br>Имате '+correct+' правилни отговора'; } 
  var question = questions[posn][0]; 
  var chA = questions[posn][1]; 
  var chB = questions[posn][2]; 
  var chC = questions[posn][3];
 var chD = questions[posn][4];
 var chЕ = questions[posn][6];
  if (maxNumberOfQuestions != 60) { test.innerHTML = "<h3>"+chЕ+question+"</h3>"; } 
  else  {test.innerHTML = "<h3>"+question+"</h3>"}; 
  test.innerHTML += "<label><input type='radio' name='choices' value='А'> А) "+chA+"</label><br>"; 
  test.innerHTML += "<label><input type='radio' name='choices' value='Б'> Б) "+chB+"</label><br>"; 
  test.innerHTML += "<label><input type='radio' name='choices' value='В'> В) "+chC+"</label><br>"; 
  test.innerHTML += "<label><input type='radio' name='choices' value='Г'> Г) "+chD+"</label><br><br><br><br>";
   
  test.innerHTML += "<button  id='btn3'  class= 'button' onclick='checkAnswer3()'>Назад</button>"
  test.innerHTML += "<button  id='btn1' class= 'button' onclick='checkAnswer()'>Напред</button><br><br>";
  test.innerHTML += "<button id='btn2'  class= 'button' onclick='checkAnswer2()' >Верен отговор</button>" ;
  ;
}
  //  setupTimer();  // for indivisible timer for each question
  function setupTimer() {
  timelimit = maxtimelimit; 
  clearInterval(myVar); 
  startTimer(); 
} 

function checkAnswer2(){ 
	//var answer = $_GET("answer");
	//var btn = $_GET("check");
	var choices = document.getElementsByName("choices"); 
  for (var i=0; i<choices.length; i++) { 
    if (choices[i].checked) { choice = choices[i].value; } 
  } 
	rscore++; 
	if (choice == questions[posn][5] || choice != questions[posn][5]){
		btn1.style.visibility="hidden";
		btn2.style.visibility="hidden";
		btn3.style.visibility="hidden"
		answer.style.visibility="visible";
		answer.innerHTML = "<h3>Правилен отговор: "+questions[posn][5] +"<br></h3>";
		answer.innerHTML += "<button class= 'button'  onclick='proceed()' >Продължи</button>"; 
		}
	} 

function proceed() {
	//var answer = $_GET("answer");
	//var btn = $_GET("check");
	answer.style.visibility="hidden";
	btn1.style.visibility="visible";
	btn2.style.visibility="visible";
	btn3.style.visibility="visible";
	pos++;  posn = questionOrder[pos];
	if (pos < maxNumberOfQuestions) { renderQuestion(); } else { renderResults(); } 
	}

function checkAnswer3(){ 
  var choices = document.getElementsByName("choices"); 
  for (var i=0; i<choices.length; i++) { 
    if (choices[i].checked) { choice = choices[i].value; } 
  } 
  rscore++; 
  if (choice == questions[posn][5] && timelimit > 0) { correct--; } 
  pos--;  posn = questionOrder[pos]; 
  if (pos < maxNumberOfQuestions) { renderQuestion(); } else { renderResults(); } 
} 

function checkAnswer(){ 
  var choices = document.getElementsByName("choices"); 
  for (var i=0; i<choices.length; i++) { 
    if (choices[i].checked) { choice = choices[i].value; } 
  } 
  rscore++; 
  if (choice == questions[posn][5] && timelimit > 0) { correct++; } 
  pos++;  posn = questionOrder[pos]; 
  if (pos < maxNumberOfQuestions) { renderQuestion(); } else { renderResults(); } 
} 

window.onload = function() { 
  Start() ;
    // for total time for entire quiz
} 