function getOption() {
    var obj = document.getElementById("mySelect");
	if (obj.options[obj.selectedIndex].value == "A") {  Learn() };
	if (obj.options[obj.selectedIndex].value == "B") { Exam() };
};

function Start(){

	java.style.display="none";
	numb.style.display="none";
	btn4.style.display="none";
	test_status.style.display="none";
	timeleft.style.display="none";
	test.style.display="none";
};
function Learn() {
	form1.style.display="none";
	setFirstQuestion();
	
	};
	
	function Exam() {
		
	form1.style.display="none";
	test_status.style.display="block";
    test.style.display="block";
	timeleft.style.display="block";
	
	setmaxtimelimit() ;
	setmaxNumberOfQuestions();
	setQuestionOrder2(); 
    renderQuestion(); 
    setupTimer();
	};
	
function setFirstQuestion() {
    var x, text;

    // Get the value of the input field with id="numb"
    x = document.getElementById("numb").value;

    // If x is Not a Number or less than one or greater than 10
    if (isNaN(x) || x < 1 || x > maxNumberOfQuestions2) {
        text = "<h5>Въведете стойност между 1 и "+maxNumberOfQuestions+"</h5>";
		
		java.style.display="block";
	numb.style.display="inline";
	btn4.style.display="inline";
		
		
		
    } else {
        text = "Input OK";
		test_status.style.display="block";
		test.style.display="block";
		//timeleft.style.visibility="visible";
		java.style.display="none";
	numb.style.display="none";
	btn4.style.display="none";
	demo.style.display="none";
		setQuestionOrder(); 
        renderQuestion(); 
		//setupTimer();
    }
    document.getElementById("demo").innerHTML = text;
}


var myVar; 
function startTimer() { 
  myVar = setInterval(function(){myTimer()},1000); 
  timelimit = maxtimelimit; 
} 

function myTimer() { 
  if (timelimit > 0) { 
    curmin=Math.floor(timelimit/60); 
    cursec=timelimit%60; 
    if (curmin!=0) { curtime="остават "+curmin+" минути и "+cursec+" секунди"; } 
              else { curtime="остават "+cursec+" секунди"; } 
    $_('timeleft').innerHTML = curtime; 
  } else { 
    $_('timeleft').innerHTML = timelimit+' - Просрочихте времето - няма да получите точки за този отговор'; 
 //clearInterval(myVar); 
    //checkAnswer(); 
	renderResults()
	{   
  $_("test_status").innerHTML = "Просрочихте времето. Приключихте теста"; 
} ;
  } 
  timelimit--; 
}   



var pos = 0, posn, choice, correct = 0, rscore = 0; 
var maxtimelimit = 6000, timelimit = maxtimelimit;  // 20 seconds per question 
function setmaxtimelimit() { 
   maxtimelimit = 3600;
}




var questions = [ 
   [ "  Защо много производители на двигатели препоръчват при изпускателните и смукателните клапани, уплътнителните повърхности на клапана и седлото да имат половин градус разлика?", "Подобряване плътността между клапана и седлото при работа на двигателя (с цел компенсиране изкривяването на диска на клапана в резултат на налягането от горенето ).", "С цел компенсиране на топлинното разширение.", "За избягване на засядане между клапана и седлото при пълно натоварване.", "За минимизиране топлопредаването между седлото и клапана.", "А" ,"1 ."],
[ "  Как ще се отрази продължителната работа на ГД при ниско натоварване върху интервала на моточистка?", "Увеличава се времето за експлоатация поради работа на двигателя при по-ниско натоварване.", "Увеличава се времето за експлоатация поради карбонизация на цилиндровата глава, буталото и ТКА.", "Намалява интервалът за моточистка.", "Не оказва влияние.", "В" ,"2 ."],
[ "  При извършване на моточистка на четиритактов двигател, от значение ли е да не се разменят смукателните и изпускателни клапани?", "Важно е поради различния материал и различните условия за работа.", "Могат да бъдат разменени, ако се сменят седлата на клапаните.", "Могат да бъдат подменени, ако са един и същи размер.", "Важно е поради различния размер на водачите на клапаните.", "А" ,"3 ."],
[ "  Повечето производители на двигатели препоръчват да се подменят уплътненията между цилиндровата глава и цилиндровата втулка всеки път, когато се извършва моточистка. Защо?", "За да се увеличи продажбата на части и по този начин да спечелят повече финансови средства.", "За да се избегне топлопредаването до цилиндровата глава.", "За да се постигне необходимата плътност и запазване височината на горивната камера.", "За да се подобри охлаждането на цилиндровата втулка.", "В" ,"4 ."],
[ "  Препоръчва се да се регулира натягането на пружината на дюзите на ГД по време на работа с цел постигане на:", "Еднакво налягане на цилиндрите Pz.", "По-добро разпръскване на горивото.", "Изобщо не се препоръчва.", "Еднакви температури на изгорелите газове.", "В" ,"5 ."],
[ "  Продължителното използване на центробежна помпа при затворен нагнетателен клапан води до:", "Прегряване на помпата.", "Отваряне на предпазния вентил.", "Прегряване на двигателя.", "Сработване на защитата от претоварване на електродвигателя.", "А" ,"6 ."],
[ "  Колко пускателя се използват за пускане, спиране и реверсиране на двускоростен АД, в каналите на статора на който са разположени две независими трифазни намотки?", "Три реверсивни магнитни пускателя.", "Четири реверсивни магнитни пускателя.", "Два реверсивни магнитни пускателя.", "Един реверсивен магнитен пускател.", "В" ,"7 ."],
[ "  При коя от посочените аварии генераторът за постоянен ток може да дава по-високо, но и по-ниско от нормалното напрежение?", "Съпротивлението на веригата  за възбуждане е малко поради неизправност в нея.", "Четките са изместени от неутралната линия.", "Увеличен е луфта под главните полюси.", "Последователно свързаната намотка на генератора е включена срещу паралелната.", "Б" ,"8 ."],
[ "  Колко пъти ще се увеличи топлинното натоварване върху статорните намотки, ако токовото натоварване на асинхронен генератор се удвои?", "Остава същото.", "Два пъти.", "Четири пъти.", "Осем пъти.", "В" ,"9 ."],
[ "  Съпротивление с неизвестна стойност може да бъде проверено/измерено използвайки метода волтметър-амперметър. Как трябва да са свързани двата прибора към съпротивлението?", "Двата прибора последователно на съпротивлението.", "Двата прибора паралелно на съпротивлението.", "Амперметъра последователно а волтметъра паралелно на съпротивлението.", "Амперметъра паралелно а волтметъра последователно на съпротивлението.", "В" ,"10 ."],
[ "  Какъв тип зареждане / зарядно устройство / трябва да се използва за зарядка на киселинни акумулатори за да се подържа “пълна зарядка” при условие, че не се използват продължителен период? ", "Нормална зарядка/устрoйство.", "Устройство за бърза зарядка (quick charging).", "Устройство за бавна, продължителна зарядка (trickle charging).", "Устройство за зареждане със висок ампераж.", "В" ,"11 ."],
[ "  Водният економайзер повишава КПД на котела, утилизирайки топлина от отработените от КПК газове. За да повиши Т на питателната вода с 1 ºС той намаля Т на отработените газове  с :", "6 ºС.", "5 ºС.", "4 ºС.", "3 ºС.", "Г" ,"12 ."],
[ "  Коя от изброените операции не се препоръчва при пожар във водния економайзер?", "Да се байпасира економайзера.", "Да се включат парните банници.", "Да се включи системата за гасене на економайзера.", "Да се спре горенето в котела.", "А" ,"13 ."],
[ "  От какво зависи температурата на прегрятата пара?", "От вида и нагревната площ на паропрегревателя.", "От режима на натоварване на котела.", "От температурата на питателната вода след ВЕ.", "От вида на парната енергетична машина.", "Г" ,"14 ."],
[ "  С колко ºС трябва да повишим температурата на прегрятата пара, за да повишим КПД на котела с 1%?", "10 - 15  ºС.", "15 - 20  ºС.", "25 - 30  ºС.", "35 - 40  ºС.", "Б" ,"15 ."],
[ "  Коя промяна на изброените експлоатационни параметри ще предизвика увеличаване на температурата на прегрятата пара?", "Нисък коефициент на излишния въздух.", "Повишаване на количеството на водата в паропрегревателя, поради силно увеличено кипене в котела.", "Понижена температура на питателната вода.", "Увеличена алкалност на питателната вода.", "В" ,"16 ."],
[ "  Кое твърдение е невярно за регенеративните въздухоподгреватели?", "Използват се приоритетно при КПК.", "Повърхността им се обмива последователно от ИГ и свежия въздух.", "Получава се неизбежно смесване свежия заряд с ИГ.", "Имат въртяща се нагревна повърхност.", "А" ,"17 ."],
[ "  Много нисък дебит през горивния сепаратор може да се получи при:", "Замърсявания на гравитационния регулиращ диск.", "Ниско ниво на горивото в отстойната цистерна.", "Дебита  зависи от оборотите на барабана.", "Изхвърлен воден затвор.", "Г" ,"18 ."],
[ "  Ако хлоридите в морската вода достигнат до 50 РРМ, кое от действията е правилно?", " Повишава се дозировката на химикали.", "Намалява се дозировката на химикали.", "Долно продухване и третиране на водата с тринатриев фосфат.", "Не се прави нищо.", "Г" ,"19 ."],
[ "  Когато водоопреснителната установка работи с много ниска температура на задбордната вода е необходим подгрев на питателната вода за:", "Предпазване от  топлинни претоварвания вследствие големи температурни разлики.", "Поддържане на определена температура на кипене.", "Защита от препълване на установката.", "Повишаване на интервала между техническите обслужвания.", "Б" ,"20 ."],
[ "  Ако алкалността на котелната вода е Р =  450 РРМ калциев карбонат, какви ще бъдат адекватните действия?", "Повишаваме дозировката на добавяните химикали.", "Намаляваме дозировката на добавяните химикали.", "Продухваме котела и редуцираме третирането на котелната вода.", "Не са необходими никакви действия - алкалността е полезна.", "В" ,"21 ."],
[ "  Ако солеността на котелната вода е 500 РРМ какви действия следва да се предприемат?", "Не се прави нищо.", "Продухване  и проверка на  кондензатора за херметичност.", "Продухване и добавяне на четиринатриев фосфат.", "Подменя се цялото количество котелна вода чрез непрекъснато долно продухване.", "Б" ,"22 ."],
[ "  Температурата на изгорелите газове по цилиндрите на КДВГ е висока. Защо?", "Съдържание на вода в горивото.", " Недостатъчно горивоподаване в КДВГ.", " Износени или счупени бутални пръстени на буталата.", "Забита приемна решетка на турбината на ТКА на КДВГ.", "Г" ,"23 ."],
[ "  КДВГ работи с черен дим. Защо?", "Има проблеми в ГПВН и дюзите на двигателя.", "Някои от цилиндрите на двигателя са претоварени.", " Всичко изброено.", "Неплътност в клапаните на двигателя.", "В" ,"24 ."],
[ "  Нивомерните стъкла на КПК се продухват:", " На всеки  час.", "Веднъж през деня.", "Всяка вахта.", "По нареждане на главния механик.", "В" ,"25 ."],
[ "  В случай на пропуск на вода се предприемат следните действия по КПК:", "Прекратява се подаването на гориво, след което въздуха, и се затварят вентилаторите и регистрите.", "Прекратява се питанието.", "Внимателно ръчно се затваря главния стопорен клапан на парата след  намаляване налягането.", "Всичко изброено.", "Г" ,"26 ."],
[ "  При изхвърляне с трюмния сепаратор на танка за сантинни води достигаме до граничния слой вода-нефтопродукт. Какви действия предприемаме?", "Изпомпваме нефтопродукта към горивен танк на КПК за да бъде изгорен.", "Изпомпваме нефтопродукта към танка на инсинератора за да бъде изгорен.", "Спираме помпата на сепаратора за трюмни води.", " Продължаваме операцията -трюмния сепаратор изхвърля нефтопродукта единствено към танка на инсинератора.", "Б" ,"27 ."],
[ "  При какво натоварване на котела се извършва баникуването?", "При ниско налягане.", "При средно налягане.", "При нормално налягане.", "При високо налягане.", "Г" ,"28 ."],
[ "  Коя от посочените причини предизвиква “прегаряне” на материала на буталата на КДВГ?", "Газоабразивната ерозия.", "Съдържанието на ванадий, натрий и др. в тежките горива.", "Съдържанието на вода и сяра в тежките горива.", "Газовата корозия на материала.", "Г" ,"29 ."],
[ "  Какво е предназначението на цинковите аноди, използвани от страната на морската вода на томплообменниците?", "Предпазване на топлообменниците от корозия.", "Намаляване на солеността на задборната вода.", "Предотвратяване образуването на накип.", "Предотвравяне натрупването на морски организми по вътрешните повърхности на топлообмениците.", "А" ,"30 ."],
[ "  По какъв начин най-добре трябва да се намали производителността на центробежна помпа?", "Чрез регулиране на предпазния клапан.", "Чрез свързване на нагнетателната страна с тръбопровода за предварително запълване на помпата.", "Притваряне на нагнетателния клапан.", "Притваряне на смукателния клапан.", "В" ,"31 ."],
[ "  Коя от посочените помпи може да се повреди, ако се затвори нагнетателния клапан преди спиране на двигателя?", "Зъбната помпа.", "Вихровата помпа.", "Центробежната помпа.", "Турбинната помпа.", "А" ,"32 ."],
[ "  При влошаване работата на масления охладител на ГД трябва да се предприемат следните действия:", "Намаляване дебита на охлаждащата вода.", "Увеличаване дебита на охлаждащата вода.", "Почистване на охладителя.", "Увеличаване налягането на водата.", "В" ,"33 ."],
[ "  Ерозионно разрушение на тръбичка в топлообменника може да бъде в резултат от:", "Висока скорост на охлаждащата вода.", "Висока температура на охлаждащата вода.", "Обрастване на водната страна.", "Лош топлообмен.", "А" ,"34 ."],
[ "  Малък дебит, придружен от вибрации и шум от смукателната страна на центробежна помпа може да бъде в резултат от: ", "Хидродинамично триене.", "Високо налягане на флуида в смукателната страна.", "Кавитация.", "Хидравличен удар.", "В" ,"35 ."],
[ "  В топлообменника, когато се използва морска вода за охлаждане на сладка вода, налягането на морската вода трябва да се поддържа по-ниско от налягането на прясната вода. Защо?", "С цел предотвратяване осоляване на сладката вода.", "С цел предотвратяване образуването на накип от страна на морската вода.", "С цел намаляване на ерозията.", "С цел намаляване натоварването на помпа морска вода.", "В" ,"36 ."],
[ "  При стартиране на въздушен компресор продухвателният клапан трябва да бъде отворен. Защо?", "За да сме сигурни, че компресорът няма обратно налягане поради пропуск на смукателен клапан.", "За да сме сигурни, че всички нагнетателни клапани на тръбопровода ВН към бутилките за пусков въздух са отворени.", "За да сме сигурни, че няма вода в цилиндрите при стартиране на компресора.", "За да се уверим, че електродвигателят не е с малък въртящ момент при стартиране.", "В" ,"37 ."],
[ "  При износени О-пръстени на цилиндрова втулка на водоохлаждаем въздушен компресор, къде е най-голяма вероятността да се появи вода при стартиране на компресора?", "В картера, при което водата се смесва със смазващото масло.", "В тръбопровода НН, при водата което се смесва с въздуха от компресора.", "В тръбопровода ВН, при което водата се смесва с въздуха от компресора.", "В смукателния филтър за цилиндрите ВН.", "А" ,"38 ."],
[ "  Понякога по нагнетателните клапани ВН на ВК за много кратко време се образува нагар дори и при честа подмяна на клапаните ВН. Каква може да е причината?", "Износени маслообиращи и компресорни пръстени на буталото.", "Замърсен въздушен филтър.", "Ниска температура на охлаждащата вода.", "Съдържание на вода в смазващото масло.", "А" ,"39 ."],
[ "  Коя от изброените причини е най-вероятна за възникване на пожар във въздухоподгревателя?", "Продължителна работа при малки режими на натоварване на котела.", "Твърде високи температури на изходящите газове.", "Високо налягане на въздуха в подгревателя.", "Неплътности във въздухоподгревателя.", "Г" ,"40 ."],
[ "  Кое качество на парните въздухоподгреватели ги прави приложими при КПК ?", "Високия КПД на котелната уредба.", "Високата ефективност на подгрева.", "Пожарната им безопасност.", "Малките габарити и тегло на подгревателя.", "В" ,"41 ."],
[ "  Температурата в зоната на първия сноп тръби при водотръбните котли е до (1500 -1700)°С, а метала се топи при (1200 -1300)°С. Защо метала не се пластифицира при това?", "Поради конвективния топлообмен.", "Поради циркулацията на водата в котела.", "Поради тягата  в котела.", "Поради повърхностния слой на метала на тръбите.", "Б" ,"42 ."],
[ "  Кой вид корозия се среща най-често при корабните парогенератори?", "Електро-химична.", "Химична.", "Биохимична.", "Кислородна.", "А" ,"43 ."],
[ "  Какъв е основния тип корозия по утилизационните парни котли?", "Високотемпературна корозия.", "Електрохимична.", "Всичко изброено.", "Нискотемпературна.", "Г" ,"44 ."],
[ "  Коя е основната причина за нарушаване на циркулацията при корабните парни котли?", "Режимите на претоварване на котела.", "Конструктивните недостатъци.", "Качеството на котловата вода.", "Режимите на ниски натоварвания на котела.", "Б" ,"45 ."],
[ "  Защо е необходимо височината на водния стълб над входящия ръб на тръбата в пароводния колектор да не пада под установено от производителя ниво?", "За да не се прегряват тръбните снопове.", "За да се намали скоростта на водата в спускните тръби.", "За да не се допусне кавитация в спускните тръби.", "За да не се обърне посоката на вектора на скоростта на циркулацията.", "В" ,"46 ."],
[ "  Какъв е основният проблем на хидравличните изпитания на КПК, провеждани без демонтаж на арматурата?", "Херметичността в клапаните.", "Налягането на изпитание на котела е по-голяма от това на арматурата.", "Салниковите набивки.", "Съпротивлението в арматурата.", "А" ,"47 ."],
[ "  Кои форсунки се стартират първи при подгрева на огнетръбните котли?", "Горните.", "Средните.", "Долните.", "Могат да се стартират едновременно, но с малки бленди.", "В" ,"48 ."],
[ "  При експлоатацията на КПК откриваме, че не се забелязва водно ниво, при продухване се появява, но веднага се покачва. Каква е причината?", "Въздушна възглавница в котела.", "Кавитация в спускните тръби.", "Препитаване на котела.", "Много висок разход на пара.", "В" ,"49 ."],
[ "  Каква визуална индикация има прегряването на мазута?", "Леко кафяв дим.", "Сивеещ дим.", "Синеещ дим.", "Бял дим.", "Г" ,"50 ."],
[ "  Кое определение не се отъждествява с операцията миене на танковете със суров петрол?", "Миенето става по време на разтоварването, като част от товара се подава по миячната магистрала .", "Ефекта на миенето е от ударното действие на струята суров петрол и от миещите свойства на петрола, който съдържа леки фракции.", "При този тип миене не се удължава времето за разтоварване, ако се подгрява допълнително мазута.", "Миенето се прави само със стационарни миячни машини.", "В" ,"51 ."],
[ "  При кой от изброените методи за опресняване на морската вода производителността е най-голяма?", "Метод на обратната осмоза.", "Електролиза.", "Дестилация.", "Замразяване.", "А" ,"52 ."],
[ "  Ако тронкови КДВГ е работил 24 часа без да е сепарирано маслото му, при включване на сепаратора, какво време за прострелване ще му се зададе?", "Зависи от състоянието на маслото, но не по-малко от 20 минути.", "Автоматично задание.", "15 минути.", "5 минути.", "Г" ,"53 ."],
[ "  При стартирането на двигателя налягането на маслото е нормално. При натоварване, с повишаване на температурата му, налягането прогресивно пада поради:", "Нисък вискозитетен индекс.", "Увеличена маслена  хлабина в лагерите.", "Попадане на гориво в маслото.", "Всичко изброено.", "Г" ,"54 ."],
[ "  Ако два дизелгенератора работят в паралел, разпределението на товара между тях ще зависи от:", "Температурата на роторите на генераторите.", "Наклона на регулаторната им характеристика.", "Фактора на мощността на товара.", "Настройката на автоматичния волтов регулатор АВР.", "Б" ,"55 ."],
[ "  При боядисване с въздушен пистолет при преход на кораба и незащитени филтри на ТКА е възможно:", "Оборотите  на ТКА да нараснат.", "Температурата на изгорелите газове да се повиши.", "Оборотите на ТКА да се понижат.", "Налягането в ресивера да падне.", "Б" ,"56 ."],
[ "  Защо е важно да се затворят всички клапани в осушителната система след осушаване на МКО?", "За да се избегне “сухия ход” на помпата.", "За да се облекчи старта на помпата.", "За да се предпази машинно отделение от нахлуване на вода обратно по системата.", "Нито едно от изброените.", "В" ,"57 ."],
[ "  Ако температурата на охлаждащата вода на даден цилиндър на КДВГ нараства, причината може да бъде:", "Ниското налягане на сгъстяване.", "Претоварването на двигателя.", "Налягането на горивото след ГПВН е твърде високо.", "Охлаждащите пространства не са добре обезвъздушени.", "Г" ,"58 ."],
[ "  Ако в картера на тронкови КДВГ се появи налягане което откриваме при вдигане на щеката за ниво на маслото, причината е: ", "Двигателят е претоварен.", "Нивото на маслото е по-високо от номиналното.", "Износени една или повече цилиндро-бутални групи.", "Всичко изброено.", "В" ,"59 ."],
[ "  Какво трябва да се направи, ако смазващото масло придобие жълтеникаво-бял цвят (емулсия)?", "Доливане на смазващо масло, за да се намали процента на водата в емулсията.", "Дрениране на водата.", "Смяна на смазващото масло.", "Често почистване на масления филтър.", "В" ,"60 ."],
[ "  Какви действия трябва да се предприемат, ако предпазният клапан на картера на въздушния компресор сработва?", "Блокиране на клапана, за да не се замърсява МО с маслени пари.", "Проверка хлабината на лагерите.", "Повишаване дебита на охлаждащата вода.", "Извършване моточистка на компресора.", "Г" ,"61 ."],
[ "  Защо се налага продухване на двигателя преди стартиране (бавно превъртане на въздух)?", "За осигуряване на пресен въздух в цилиндрите с цел безопасно стартиране на двигателя.", "За да се уверим, че всички индикаторни кранове са затворени и че няма да пропускат газове от горивната камера.", "За сме сигурни, че не е се е събрала вода в цилиндрите.", "За да сме сигурни, че няма разхлабени части и че двигателят не е блокирал.", "В" ,"62 ."],
[ "  Попадането на масло във водната охладителна система на КДВГ ще предизвика:", "Ускоряване на кавитационно-корозионните процеси.", "Нарушаване на нормалната работа на циркулационните помпи.", "Влошаване на топлообмена в охлаждащата система.", "Повишава КПД на циркулационните помпи.", "В" ,"63 ."],
[ "  Системата за непрекъснато техническо обслужване на корабите цели:", "Поддържане на определено равнище тяхната надеждност.", "Повиши тяхната ремонтопригодност.", "Намали разходите за резервни части.", "Намали броя на вахтените лица.", "А" ,"64 ."],
[ "  Коя е нормалната експлоатационна граница на иглата на изодрома на регулатора тип UG-8?", "Отворена на (¼ ÷¾) оборот.", "Напълно отворена.", "Отворена максимум  до ¼  оборот.", "Отворена на (1÷1,5) оборот.", "А" ,"65 ."],
[ "  Как влияе отварянето на иглата на изодрома върху работата на САР на оборотите?", "Системата става мудна.", "Системата става по-бърза, но и по-склонна към колебания.", "Изменя се статизмът на процеса.", "Нито един от посочените способи.", "Б" ,"66 ."],
[ "  Как влияят хлабините в лостовата система между регулатора на обороти и горивните рейки?", "Не оказват влияние.", "Системата става мудна.", "Появяват се непрекъснати колебания на оборотите.", "Системата става по-бърза.", "В" ,"67 ."],
[ "  Преминаването от тежко на леко гориво трябва да се извършва:", "Възможно най-бързо с цел по-малък разход на тежкото гориво.", "Възможно най-бързо, за да се намали разходът на пара.", "Възможно най-бързо, за да се получи бързо понижаване на температурата на ГПВН .", "Бавно, за постепенно охлаждане на ГПВН.", "Г" ,"68 ."],
[ "  Как разпознаваме неплътния горивен разпръсквач по време на тестване на дюзата?", "Когато наблюдаваме бързо падане на налягането при затворен иглен клапан.", "Когато игления клапан не се отваря при достигане на препоръчителното налягане на отваряне.", "Когато игления клапан се отваря преди достигане на препоръчителното налягане на отваряне.", "Когато игления клапан пулвелизира горивото.", "А" ,"69 ."],
[ "  Кой от изброените показатели се използва при проверка и регулиране положението на гърбиците на ГПВН-клапанен тип на КДВГ?", "Ъгъл/сумарен/ на статичната продължителност на подаване на гориво.", "Активен ход на плунжира при зададена позиция на органа за управление на ГПВН.", "Ъгъл на статично начало на подаване при номинална мощност на двигателя.", "Не се използват посочените показатели.", "В" ,"70 ."],
[ "  При кой от изброените методи за опресняване на морската вода качеството на произведената прясна вода е най-високо?", "Метод на обратната осмоза.", "Електролиза.", "Дестилация.", "Замразяване.", "В" ,"71 ."],
[ "  Кое от изброените устройства не се вписва в състава на използващите метода на дестилация изпарители ?", "Кондензатори.", "Бленди.", "Ежектори.", "Мембрани.", "Г" ,"72 ."],
[ "  Кои от споменатите изпарители се използват като елементи на дестилатните опреснителни уредби по корабите?", "Вакуумни.", "С атмосферно налягане.", "С над-налягане.", "А)  и  Б).", "Г" ,"73 ."],
[ "  Температурата на подгрятото гориво в цистерните трябва да бъде най-малко с :", "10 °С по-ниска от температурата на пламната точка на горивото.", "20 °С по-ниска от температурата на пламната точка на горивото.", "30 °С по-ниска от температурата на пламната точка на горивото.", "40 °С по-ниска от температурата на пламната точка на горивото.", "А" ,"74 ."],
[ "  Налягането на парата за подгряване на горивото не трябва да превишава :", "0,5 мPa.", "0,6 мPa.", "0,7 мPa.", "0,8 мPa.", "А" ,"75 ."],
[ "  Кой от изброените принципи се прилага при пренасянето на топлината в КПК?", "Кондукция.", "Конвекция.", "Радиация.", "Всичко изброено.", "Г" ,"76 ."],
[ "  Къде се помещават баластната помпа, кингстона и задбордния клапан на танкерите?", "В машинно отделение.", "В котелно отделение.", "В помпено отделение.", "В румпелно отделение.", "В" ,"77 ."],
[ "  Пукнатина в цилиндровата глава на дизелов ДВГ може да е в резултат най-вероятно от:", "Повредени сегменти /бутални пръстени/.", "Топлина, предавана на главата от изгорелите газове.", "Запушени охлаждащи канали и/или пространства.", "Прегряване на смукателните клапани.", "В" ,"78 ."],
[ "  Помещението където се зареждат акумулатори трябва да добре вентилирано защото по време на зарядка се отделят:", "Силно отровни газове.", "Лесно запалим кислород.", "Експлозивни газове (предизвикващи експлозия).", "Корозивни газове(предизвикващи корозия ).", "В" ,"79 ."],
[ "  Какво ще стане при пробив на изолацията на фаза към корпус на ел.машина, включена в трифазна мрежа без изведен нулев проводник и изолиран звезден център?", "Ще изгори предпазител.", "Ще изгори намотка на ел. двигател.", "Ел. двигателят работи нормално, но става опасен за екипажа.", "Ел. двигателят няма да може да се пусне.", "В" ,"80 ."],
[ "  Кой от посочените показатели характеризира въздухоснабдяването на двигателя?", "Налягане на сгъстяването.", "Максимална температура в горивната камера.", "Температура на изгорелите газове.", "Скорост на повишаване на налягане в горивната камера.", "А" ,"81 ."],
[ "  Кой от посочените индикаторни показатели може да бъде получен чрез пряко измерване?", "Индикаторна работа.", "Средно индикаторно налягане.", "Индикаторен КПД.", "Нито един от посочените.", "Г" ,"82 ."],
[ "  Кои индикаторни показатели трябва да се измеря, за да се получи индикаторният КПД?", "Индикаторна диаграма и разход на гориво.", "Индикаторна мощност и индикаторна работа.", "Индикаторна мощност и ефективна мощност.", "Индикаторен въртящ момент и ефективен въртящ момент.", "А" ,"83 ."],
[ "  При постоянна циклова порция, кой от посочените показатели нараства най-силно с увеличаване на честотата на въртене?", "Средното ефективно налягане.", "Ефективната мощност.", "Индикаторната мощност.", "Механичният КПД.", "В" ,"84 ."],
[ "  Кой от посочените показатели характеризира степента на износване/влошаване на хидроплътността/ на ГНВН?", "Налягане на отваряне на горивния клапан.", "Налягане на затваряне на горивния клапан.", "Скорост на повишаване на налягането пред горивния клапан.", "Скорост на изтичане на горивото през сопловите отвори.", "В" ,"85 ."],
[ "  Коя от изброените повреди довежда до нагароотлагане и запушване на сопловите отвори на горивните клапани на КДВГ?", "Задържане и заклинване на иглите на разпръсквачите.", "Износване на иглата и тялото на разпръсквачите по направляващата част.", "Нарушаване хермeтичността по уплътняващия конус в разпръсквача.", "Недопустимо износване на сопловите отвори.", "В" ,"86 ."],
[ "  Проверката и извършването на статична настройка на ГНП на КДВГ се извършва по данни от:", "Инструкцията за експлоатация на двигателя.", "Протоколите от стендовите изпитания на двигателя.", "Протоколите от изпитанията при последния ремонт на двигателя.", "Проверката настройката преди извършващия се ремонт.", "Б" ,"87 ."],
[ "  Радиалната маслена хлабина в лагерите на турбокомпресорните агрегати се измерва при ТКА:", "С плъзгащи се лагери.", "С търкалящи се съчмени лагери.", "С конусно-радиални лагери.", "С ролкови лагери.", "А" ,"88 ."],
[ "  След котлочистка, кои са най-правилните действия при подгряване на студен котел?", "Запалване, при минимално горивоподаване, при продължително горене докато котелът достигне необходимото работно налягане.", "Постепенно подгряване на котела при периодична работа и почивка на горелката .", "Запалване при минимално горивоподаване, след което се преминава към продължително подаване на максимално количество гориво, докато котелът достигне необходимото работно налягане.", "Запалване при максимално горивоподаване, така че да се повиши налягането за възможно най-кратък период от време с цел икономия на гориво.", "Б" ,"89 ."],
[ "  При утилизационните котли, при ниски натоварвания на ГД, се получава нискотемпературна корозия на нагревните повърхности. Това се обуславя от наличието на:  ", "Солна киселина.", "Азотна киселина.", "Серниста киселина .", "Аскорбинова киселина.", "В" ,"90 ."],
[ "  Преди запалване на горелката на котела кое от споменатите действия има най-голямо значение?", "Проверка действието на предпазителните клапани.", "Проверка наличието на вода в котела чрез извършване на долно продухване.", "Добро вентилиране на пещта преди запалване на горелката.", "Отваряне на главния парен кран.", "В" ,"91 ."],
[ "  Каква е основната цел на долното продухване на котела?", "За отстраняване на натрупания неразтворим шлам от долния колектор.", "За контролиране наличието на вода във долния колектор при работа на котела.", "За регулиране налягането на парата при голямо натоварване на горелката.", "За да проверим, че няма пропуск на дим и газове от горивната камера.", "А" ,"92 ."],
[ "  Предпазният клапан на спомагателния парен котел трябва:", "Да се регулира след всяко извеждане от действие на котела .", "Да блокира пружината и клапана, така че да се предотвратят пропуски на пара в случай на недобро действие на пружината на клапана.", "Да отвори, когато налягането в котела превиши допустимите работни стойности.", "Да се регулира преди всяко запускане на котела.", "В" ,"93 ."],
[ " При увеличаване на температурата на въздуха на входа на цилиндъра, коя от фазите на горенето се намалява?", "Първа фаза (задържане на самовъзпламеняването).", "Втора фаза (самовъзпламеняване и бързо горене).", "Първа и втора фаза.", "Трета фаза (умерено горене с бавно намаление на налягането).", "В" ,"94 ."],
[ " При какви условия се получава външна характеристика?", "Постоянно циклово подаване на гориво.", "Постоянно натоварване на двигателя.", "Постоянно задание на регулатора.", "Постоянен ъгъл на предварение на подаването.", "А" ,"95 ."],
[ " В случай на неустойчива работа на турбокомпресорния агрегат кое от изброените действия няма да доведе до подобрение в експлоатацията на ТКА ?", "Изпускане на въздух от въздушния ресивер.", "Промяна режима на работа на двигателя.", "Промяна на натоварването на отделните цилиндри.", "Изключване на регулатора.", "Г" ,"96 ."],
[ " В дневника за нефтени операции се вписват данни и за следните действия в машинно отделение:", "Инцидентно изхвърляне на нефт, превключване системата за автоматично изхвърляне в режим автоматична/ръчна работа, баластиране на товарен трюм.", "Изхвърляне на мръсен баласт от горивните танкове, изгаряне на течни отпадъци, изхвърляне на мръсен баласт от баластни танкове.", "Приемане на гориво, изхвърляне на сантинни води, прехвърляне на масло между танкове.", "Изхвърляне на мръсен баласт от горивните танкове, изхвърляне на мръсен баласт от баластни танкове.", "В" ,"97 ."],
[ " Каква е стойността на механичния КПД  при работа на двигателя на празен ход?", "Безкрайно голям.", "Равен на индикаторния КПД.", "Равен на ефективния КПД.", "Нула.", "Г" ,"98 ."],
[ " От какво зависи механичния КПД и как ?", "От оборотите-нараства с увеличаването им.", "От натоварването и нараства с увеличаването му.", "От ъгъла на предварение на подаването и нараства с увеличаването му.", "Намаля с увеличаването на диаметъра на отворите на разпръсквачите.", "Б" ,"99 ."],
[ "  В какъв диапазон се движи ефективният КПД на съвременните главни корабни двигатели?", "45 - 48 %.", "42 - 45  %.", "50 - 52  %.", "55 - 58 %.", "В" ,"100 ."],
[ "  Коя температура на маслото наричаме  “критична” ?", "Тази температура при която маслото губи смазващите си свойства.", "Тази температура при която маслото намаля вискозитета си с повече от 30%.", "Тази температура при която маслото губи присадките  си.", "Тази температура при която масленият клин се разкъсва.", "А" ,"101 ."],
[ "  С какъв тип рулетки не трябва да се измерва нивото на товара в танкове за светъл товар или обезводнен суров петрол в процеса на товарене?", "Стоманени.", "Полипропиленови.", "Винилови.", "Танковете не се сондират при товарене.", "А" ,"102 ."],
[ "  Коя операция задължително се стартира непосредствено преди товарната операция и се прекратява веднага след приключването й?", "Инертирането на танковете.", "Подгревът на товара.", "Заземяването към бреговото съоръжение.", "Вахтената служба в МКО.", "В" ,"103 ."],
[ "  Кой водонепроницаем отсек не се оборудва с мерителен тръбопровод?", "Диптанкове.", "Междудънни отсеци.", "МКО.", "Няма такъв отсек.", "В" ,"104 ."],
[ "  Каква дневна разходната норма за прясна вода трябва да гарантираме при разчетите по планирането на рейса?", "120-160 литра /човек.", "200-240 литра /човек.", "250-300 литра /човек.", "100-120 литра /човек.", "Б" ,"105 ."],
[ "  Какви действия ще предприемете, ако рН на котелната вода е под 7?", "Продухване на котела и частично подмяна на водата.", "Не се налага предприемане на действия.", "Намаляване дозата на водообработващите химикали и частична подмяна на водата.", "Повишаване дозата на водообработващите химикали и извършване нов анализ на водата.", "Г" ,"106 ."],
[ "  Какви действия ще предприемете, ако рН на котелната вода е повече от 11?", "Повишаване дозата на водообработващите химикали.", "Намаляване дозата на водообработващите химикали.", "Продухване на котела и подмяна на водата докато рН факторът достигне допустимите стойности.", "Не се налага предприемане на  действия.", "Б" ,"107 ."],
[ "  Кои са най-вероятните последствия от замърсяване на котелната вода с масло?", "Повишаване натрупването на отлагания по тръбите на котела.", "Няма последствия.", "Образуват се отлагания в тръбите на котела, които намаляват топлообмена.", "Образуване на вдлъбнати по металните повърхности на котела.", "В" ,"108 ."],
[ "  Отстраняването на накипа на парните котли в експлоатация става чрез:", "Магнитно-резонансов метод.", "Химическо изваряване.", "Ултразвуково разрушение.", "Хидропресов метод.", "Б" ,"109 ."],
[ "  Извършването на хидравлично изпитване чрез питателните помпи на парния котел се:", "Забранява.", "Разрешава от класификационната организация.", "Преценява от главния механик.", "Разрешава се при липса на ръчна преса.", "А" ,"110 ."],
[ "  Консервацията на парния котел го предпазва от:", "Стоянъчна кислородна корозия.", "Пароводна корозия.", "Високотемпературна корозия.", "Нискотемпературна корозия.", "А" ,"111 ."],
[ "  Как трябва да работи сепараторът, за да се получат най-добри резултати при сепарирането?", "Сепариране при необходимата температура и ниска скорост.", "Висока скорост и ниска температура.", "Висока скорост и висока температура.", "Скоростта и температурата не оказват влияние.", "А" ,"112 ."],
[ "  Замърсяването на работната течност над допустимото при обемните  хидравлични задвижвания води до:", "Обемни  загуби от подвижни уплътнения.", "Обемни загуби от неподвижни уплътнения.", "Промяна на наклона на характеристиката на помпата.", "Дроселиране на работното налягане.", "А" ,"113 ."],
[ "  Дишането на коляновия вал на ДВГ носи информация за:", "Износването на вала.", "Несъосност на основните лагери.", "Неточност при центровката при цилиндро-буталните групи.", "Хлабини в ангренажа.", "Б" ,"114 ."],
[ "  Ванадиевата корозия е явление, което се проявява при:", "Температура на челото на буталото над 550 - 600 ºС.", "Температура на работната повърхност на цилиндъра около 175 -180 ºС.", "Температура на изгорелите газове превишаващи с 10% допустимата.", "Ниска температура на охлаждащия контур на цилиндробуталните групи.", "А" ,"115 ."],
[ "  Защо не трябва да използваме притриваща паста за седлото или направляващата част на иглата на разпръсквача?", "Притриващата паста ще направи много леко движението на иглата и това може да предизвика повреда на седлото и.", "Притриващата паста е много груба.", "Остатъците от притриваща паста предизвикват корозия върху металните повърхности, което след време ще повреди иглата.", "Запушва отворите на разпръсквача.", "В" ,"116 ."],
[ "  Разпръсквачите на дюзите на КДВГ се подменят при износването на отворите над допустимите 10% износване от номиналния размер:", "На един от отворите.", "На 50% от отворите.", "На всички отвори.", "На 75% от отворите.", "А" ,"117 ."],
[ "  За зъбните помпи допустимата радиална хлабина е в широк диапазон - от 0.003 до 0.2мм или δρ\>0,0015D на зъбното колело. Какъв е ефекта от по-голямата хлабина?", "Пада налягането на помпата при постоянни обороти.", "Помпата губи сухото си засмукване.", "Кавитационни проблеми в смукателната част.", "Намаля дебита на помпата при постоянни обороти.", "Б" ,"118 ."],
[ "  Коя от изброените хидромашини работят само като помпи и не могат да работят като хидромотори?", "Пластинчати хидромашини.", "Радиално-бутални хидромашини.", "Винтови хидромашини.", "Зъбни хидромашини.", "В" ,"119 ."],
[ "  Каква е основната цел на газовия анализ при  КПК?", "Определяне на количеството на въглеродня окис в състава на отработените газове.", "Определяне на състава на отработените от котела газове с цел отчитане ефективността от горенето.", "Определяне и поддържане на оптимален коефициент на излишния въздух.", "Определяне на състава и димността на отработените от котела газове с цел отчитане ефективността от горенето.", "В" ,"120 ."],
[ "  Кога е възможна кавитация в спускните тръби на водотръбните КПК?", "Когато напора на спускните тръби е по-малък от напора на пароводният колектор.", "Когато напора на спускните тръби е по-голям от напора на пароводният колектор.", "Когато напора на спускните тръби е равен на напора на пароводният колектор.", "В спускните тръби кавитацията е невъзможна.", "А" ,"121 ."],
[ "  Ако цвета на повърхностния слой на бабита на основен лагер е черен и е с повишена твърдост, като и по шийката на КВ има драскотини,  каква е вероятната причина?", "Вода в маслото.", "Филтрирането на маслото е било некачествено.", "Двигателят е работил без масло.", "Неподходящо или непрепоръчано от производителя масло.", "А" ,"122 ."],
[ "  При изхвърляне с трюмния сепаратор на танка за сантинни води достигаме до граничния слой вода-нефтопродукт. Какви действия предприемаме?", "Изпомпваме нефтопродукта към горивен танк на КПК за да бъде изгорен.", "Изпомпваме нефтопродукта към танка на инсинератора за да бъде изгорен.", "Спираме помпата на сепаратора за трюмни води.", "Продължаваме операцията - трюмния сепаратор изхвърля нефтопродукта единствено към танка на инсинератора.", "Б" ,"123 ."],
[ "  При коя от изброените помпи от динамичен тип коефициента на бързоходност може да достигне до 1 000?", "Бързоходни центробежни помпи.", "Диагонални помпи.", "Няма помпи с такъв коефициент на бързоходност.", "Осеви помпи.", "Г" ,"124 ."],
[ "  От кой параметър определящо зависят напора и дебита на центробежната помпа?", "Вискозитета на работната течност.", "Диаметърът на работното колело.", "Оборотите на вала на помпата.", "Всички изброени.", "Г" ,"125 ."],
[ "  При кавитационен режим на работа на центробежна помпа, правилното действие за възстановяване на устойчивата работа е :", "Понижаване на оборотите.", "Притваряне на нагнетателния клапан.", "Притваряне на смукателния клапан.", "Повишаване на оборотите.", "А" ,"126 ."],
[ "  Къде при центробежните помпи е възможен помпаж и къде кавитация?", "Помпаж - в смукателната част, кавитация - в нагнетателната.", "Помпаж - в нагнетателната част, кавитация - в смукателната.", "В работното колело.", "При центробежните помпи помпаж не се забелязва.", "Б" ,"127 ."],
[ "  Пропадането на коляновия вал на КДВГ в основните лагери се определя чрез:", "Измерване дишането на коляновия вал.", "Измерване на маслените хлабини.", "Щатна скоба и сонди.", "Снемане на привалка.", "В" ,"128 ."],
[ "  Галваничната /ел. химическа/ защита на корабния корпус предпазва от:", "Корозионно износване на анодните участъци.", "Корозионно износване на катодните участъци.", "Корозионно износване и обрастване на анодните участъци.", "От всички посочени повреди.", "Б" ,"129 ."],
[ "  Коя от изброените причини интензифицира износването на бутало-цилиндровите групи на КДВГ при експлоатацията им с тежко гориво.", "По-високата температура на отработените газове.", "По-високите плътност и вискозитет на горивото.", "Съдържанието на сяра в горивото.", "Съдържанието на механични примеси в горивото.", "В" ,"130 ."],
[ "  Целта на дефектацията е:", "Да се открият наличието, характерът и големината на повредите.", "Да се установят причините, предизвикали появяването на тези повреди.", "Да се набележи пътят и определи технологията за отстраняване на повредите.", "Всички изброени причини.", "Г" ,"131 ."],
[ "  За откриване наличието, характера и големината на повредите е необходимо да се извърши:", "Прегледи и транспорт в кораборемонтен завод.", "Измервания и снимки.", "Проверки.", "Прегледи, проверки и измервания.", "Г" ,"132 ."],
[ "  Външен преглед се прави:", "Преди  почистване на детайлите.", "След почистване на детайлите, за да се открият всички видими и скрити повреди.", "След замерване на детайлите.", "След почистване на детайлите, за да се открият всички видими повреди.", "Г" ,"133 ."],
[ "  Целта на измерване на детайлите е да се установи: ", "Фирмата производител.", "Стуктурата на материала от който са изработени детайлите.", "Качеството на детайлите.", "Отклоненията от първоначалните размери и увеличението на хлабината между задружно работещите детайли.", "Г" ,"134 ."],
[ "  Какво цели проверка на взаимното положение на детайлите?", "Да се установи фирмата производител.", "Качеството на детайлите.", "Да се определи обема на ремонт.", "Да се види изменението в центровката на взаимноработещите детайли.", "Г" ,"135 ."],
[ "  Кои са необходими прибори и инструменти за дефектация на цилиндрова втулка на КДВГ?", "Линия и ролетка.", "Шаблон.", "Цифров фотоапарат.", "Вътромер с индикатор, микрометър и шублер.", "Г" ,"136 ."],
[ "  В резултат на равномерното износване на цилиндровата втулка на КДВГ, какво се констатира?", "Запазва се вътрешния диаметър на цилиндровата втулка.", "Дебелината на цилиндровата втулка не се променя.", "Запазва се вътрешния диаметър, а дебелината на цилиндровата втулка се променя .", "Увеличава се вътрешния диаметър на цилиндъра и намалява дебелината на стената му.", "Г" ,"137 ."],
[ "  В резултат на неравномерното износване на цилиндровата втулка на КДВГ, какво се констатира?", "Запазва се вътрешния диаметър на цилиндровата втулка.", "Дебелината на цилиндровата втулка не се променя.", "Запазва се вътрешния диаметър, а дебелината на цилиндровата втулка се променя .", "Овалност, конусност и бъчвообразност.", "Г" ,"138 ."],
[ "  От какво зависи броя на замерванията на цилиндровата втулка на КДВГ?", "От диаметъра.", "От дебелината.", "От мощността на КДВГ.", "От височината на цилиндъра.", "Г" ,"139 ."],
[ "  Кой от изброените способи за регулиране на КОХЗ има приложение при корабните електрохидравлични рулеви задвижвания?", "Схема с регулируема помпа и нерегулируем хидромотор.", "Схема с нерегулируема помпа и регулируем хидромотор.", "Схема с регулируема помпа и регулируем хидромотор.", "Чрез регулируем дросел паралелно на хидромотора.", "А" ,"140 ."],
[ "  Кое от твърденията не е вярно по отношение на влиянието на течен товар със свободна повърхност върху устойчивостта на кораба?", "При приемане на течен товар - осигуряване на запресоване на танковете намаля влиянието на свободната повърхност.", "Намаляване на напречн. устойчивост от наличието на течни товари със своб. повърхност зависи  осн. от размерите на тази повърхност.", "Кораби с голямо водоизместване по-малко се влияят от наличието на течни товари със свободни повърхности.", "Напречни прегради в танкове с голяма ширина (могат да са повече от 1) намалят влиянието на свободната повърхност.", "Г" ,"141 ."],
[ "  Кой от процесите не класифицираме като термохимично обработване?", "Алкириране.", "Карбонитриране.", "Оксикарбонитриране.", "Азотиране.", "А" ,"142 ."],
[ "  Кой параметър оказва най-голямо влияние върху стойността на максималното налягане за цикъл Pz?", "Количеството на цикловата порция гориво.", "Скоростта на въртене на КВ.", "Предварението на подаване на гориво.", "Цетановото число на горивото.", "В" ,"143 ."],
[ "  Колко процента може да бъде допусната разлика в температурата на отработените газове по цилиндри?", "0,03 %.", "0,05 %.", "0,07 %.", "0,1 %.", "Б" ,"144 ."],
[ "  Кой параметър, снет от диаграмата на горивоподаването, показва състоянието на отворите на разпръсквачите при работещ двигател?  ", "Налягането на отваряне на дюзата.", "Изменението на налягането на горивоподаване от повдигане на иглата до достигане на максималното налягане.", "Скоростта на нарастване на налягането пред дюзата.", "Ъгълът на отваряне на горивния клапан.", "Б" ,"145 ."],
[ "  Съвпада ли ъгълът на отваряне на горивния клапан със статичният ъгъл на подаване на гориво на ГПВН ?", "Да.", "Не, статичният ъгъл е по-малък.", " Не, статичният ъгъл е по-голям.", "Зависи от режима.", "В" ,"146 ."],
[ "  От коя част на КДВГ се отвежда най-голямо количество топлина с охлаждащата вода?", "Цилиндрови глави.", "Цилиндрови втулки.", "Бутала.", "Въздушни охладители.", "А" ,"147 ."],
[ "  Кои са характерните откази и критерий за работоспособност на корабните оси и валове?", "Счупване (вследствие умора или претоварване) -обемна якост.", "Големи деформации - коравина.", "Повишено ниво на вибрации-виброустойчивост.", "Всичко изброено.", "Г" ,"148 ."],
[ "  Кое условие следва да бъде изпълнено за да бъде ротора статично балансиран?", "Всички маси да бъдат разположени симетрично спрямо надлъжната ос на ротора.", "Маховият момент към надлъжната и към напречна ос да бъде сумарно равен на нула.", "Необходимо е моментът от центробежните сили да е колкото може по-малък.", "Необходимо е роторът да е в безразлично равновесие.", "Г" ,"149 ."],
[ "  Кое условие следва да бъде изпълнено за да бъде ротора динамично балансиран?", "Маховите моменти, приведени към надлъжната и към напречната ос да бъдат сумарно равни на нула.", "Необходимо е моментът от центробежните сили да е колкото може по-малък.", "Необходимо е моментът от центробежните сили да е колкото може по-малък.", "Необходимо е първата критична скорост да бъде равна на нула.", "В" ,"150 ."],
[ "  Резултатите от измерването на буталото на КДВГ се записват в таблична форма, за да се определи:", "Мощността на КДВГ.", "Структурата на материала от който е изработено.", "Вида на цилиндровата втулка.", "Овалността и конусността на буталото.", "Г" ,"151 ."],
[ "  В какво трябва да се уверите при прехвърляне на гориво от танковете в двойното дъно в утаителната цистерна?", "Цистерната винаги да е пълна до средата.", "Горивопрехвърлящата помпа да може да работи безшумно продължителен период от време .", "Горивопрехвърлящата помпа да спира преди запълване на цистерната.", "Горивопрехвърлящата помпа да засмуква добре от дънния танк.", "В" ,"152 ."],
[ "  Каква е причината за кавитационното повреждане на цилиндровите втулки на ДВГ?", "Обща кавитация.", "Местна кавитация.", "Вибрационна кавитация.", "Такава повреда по цилиндровите втулки не се среща.", "Б" ,"153 ."],
[ "  При достигане на каква плътност на електролита трябва да се прекрати зареждането на основните акумулатори?", "Плътността на електролита на основните акумулатори е постоянна и не зависи от степента на зареденост.", "1,28.", "1,58.", "2,28.", "А" ,"154 ."],
[ "  Кой от посочените показатели характеризира износването на горивния клапан?", "Температурата на изгорелите газове.", "Максималната температура в горивната камера.", "Максималното налягане на впръскване на горивото.", "Продължителност на горивоподаване.", "В" ,"155 ."],
[ "  Защо ел.двигател за постоянен ток се включва към захранващатата мрежа през пускови съпротивления?", "Запазване мрежата от претоварване.", "Плавно регулиране честотата на въртене.", "Ограничаване големината на пусковия ток.", "Подобряване КПД на задвижването.", "В" ,"156 ."],
[ "  Защо в установен режим на двигател за постоянен ток пусковите съпротивления трябва да бъдат изключени?", "За достигане на максимална честота на въртене.", "За икономия на електроенергия.", "Подготовка за ново пускане.", "За предпазване съпротивленията от прегряване.", "Г" ,"157 ."],
[ "  Каква е причината асинхронен двигател с накъсо съединен ротор да бръмчи, а да не се развъртва (включен в мрежата) при механично изправни ел. двигател и работна мрежа?", "Задействана защита от претоварване.", "Изгорял предпазител в една от фазите.", "Пробив на изолация към корпус.", "Недостатъчен магнитен поток.", "Б" ,"158 ."],
[ "  Как може да се промени посоката на въртене на трифазен асинхронен двигател?", "Чрез превключване на броя на полюсите на статорната му намотка.", "Чрез промяна на посоката на тока в роторната му намотка.", "Чрез промяна на включването на два от трите изводи на роторната намотка.", "Чрез промяна на включването на два от трите захранващи линейни проводника.", "Г" ,"159 ."],
[ "  Кое съпротивление на изолацията на една електрическа машина в процеса на експлоатацята се счита за нормално?", "Над 0,1 МΩ.", "Над 0,7 МΩ.", "Над 2 МΩ.", "Над 10 МΩ.", "Б" ,"160 ."],
[ "  С какъв уред може да се измери съпротивлението на изолацията на елементите на корабното електрообзавеждане?", "Комбиниран волт-ампер-омметър.", "Волтметър и амперметър.", "Омметър.", "Мегаомметър.", "Г" ,"161 ."],
[ "  В кой диапазон трябва да се намира токът при нормално зареждане на киселинен акумулатор 12V 160Ah?", "1 ÷ 6 А.", "8 ÷ 16 А.", "20 ÷ 32 А.", "50 ÷ 100 А.", "Б" ,"162 ."],
[ "  Колко трябва да бъде плътността на електролита на киселинния акумулатор в напълно заредено състояние?", "1,08 ÷ 1,10.", "1,18 ÷ 1,20.", "1,28 ÷ 1,30.", "1,38 ÷ 1,48.", "В" ,"163 ."],
[ "  Кое от изброените основни свойства на материалите за работните повърхнини на плъзгащите лагери е неточно?", "Голяма топлопроводимост.", "Малък коефициент на линейно разширение.", "Голям модул на еластичност.", "Добро мокрене от мазилното вещество.", "В" ,"164 ."],
[ "  Кое твърдение е вярно по отношение на масления клин?", "Налягането и вискозитета на маслото не определят устойчивостта на масления клин.", "Устойчивостта на клина се обуславя от съдържанието на повърхностно активни вещества в маслата.", "Товароносимостта на клина е обратно пропорционална на дебелината му.", "Каналите в долната лагерна черупка увеличават устойчивостта на клина против разкъсване при механични претоварвания.", "В" ,"165 ."],
[ "  Натоварването, което лагерите могат да издържат 1 млн. завъртания, без в работните тела или пръстените да се появят признаци на питинг определя:", "Бринелирането на търкалящия лагер.", "Моторесурса на лагера.", "Динамичната товароносимост.", "Качеството на лагера.", "В" ,"166 ."],
[ "  Търкалящите лагери се избират по:", "Моторесурс.", "Динамична товароносимост.", "Статичната товароносимост.", "Устойчивост на питинг.", "В" ,"167 ."],
[ "  Търкалящите лагери се пресмятат по:", "Моторесурс.", "Динамична товароносимост.", "Статичната товароносимост.", "Устойчивост на питинг.", "Б" ,"168 ."],
[ "  Лагеруването трябва да бъде осъществено, така че:", "Да се поемат всички действащи сили, и то от избраните от конструктора лагери.", "Да се осигури възможност за топлинни изменения в дължината на вала (удължаване и скъсяване).", "Евентуалните премествания на свързаните с вала елементи да бъдат в предпочитаната посока.", "Всичко изброено.", "Г" ,"169 ."],
[ "  Кое от изброените предимства на червячните предавки не можем да приемем за вярно?", "Голямо предавателно число.", "Плавна и безшумна работа.", "Висок КПД.", "Висока компактност.", "В" ,"170 ."],
[ "  Кое е най-голямото предимство на ремъчните предавки?", "Плавна и безшумна работа.", "Предпазват от претоварване.", "Предават мощност на по-големи разстояния.", "Допускат големи скорости.", "А" ,"171 ."],
[ "  Кое е най-големия недостатък на ремъчните предавки?", "Големи габарити.", "Непостоянно предавателно число.", "Ограничена трайност.", "Необходимост от опъване на ремъка и повишено натоварване върху валовете.", "В" ,"172 ."],
[ "  Кой е основния начин за пускане на бързооборотни КДВГ?", "Със сгъстен въздух.", "С друг двигател.", "Електростартер.", "Комбиниран.", "А" ,"173 ."],
[ "  Предназначението на стартера в пусковата система е:", "Да създаде външен момент развъртащ коляновия вал ДВГ.", "Устройство разпределящо въздуха в цилиндрите.", "Източник на енергия.", "Зависи от конструкцията на двигателя.", "А" ,"174 ."],
[ "  Какъв процент представляват пусковите обороти на КДВГ в зависимост от номиналните обороти на ДВГ?", "30 - 40 %.", "5 - 25 %.", "0 - 5 %.", "40 - 50 %.", "Б" ,"175 ."],
[ "  Как е свързан стартера на ДВГ с вала на двигателя?", "Непрекъснато.", "Само по време на пуск.", "Зависи от пусковата система.", "Зависи от конструкцията на двигателя.", "Б" ,"176 ."],
[ "  Кога се подава сгъстен въздух в цилиндъра?", "В началото процеса на разширение.", "В края на процеса разширение.", "В началото на процеса сгъстяване.", "Зависи от конструкцията на двигателя.", "А" ,"177 ."],
[ "  След колко работни часа следва да бъдат сменени лагерите на ТКА дори всички техни параметри да са нормални?", "12 000.", "25 000.", "4 000.", "30 000.", "А" ,"178 ."],
[ "  Спазването на реда на обслужване на сепараторите е важно. Защо?", "Приоритетно за почистването на барабана.", "За да се предотвратят сериозни повреди по основните компоненти.", "Не е толкова важно.", "За подобряване ефективността от сепарирането.", "Б" ,"179 ."],
[ "  Кога трябва да се калиброва кислородният анализатор?", "Преди всеки старт на инерт газ системата, когато не е работил повече от 8 часа.", "През равни интервали.", "Когато нареди старпома.", "Всеки път, когато системата се спира.", "А" ,"180 ."],
[ "  Кои части на центробежната помпа са най-много подложени на износване и по правило се сменят при всяко планово техническо обслужване?", "Търкалящите лагери на вала, противоизносващите пръстени на корпуса или работното колело.", "Дистанционните  втулки.", "Вала на помпата.", "Работното колело с обтекаемата гайка.", "А" ,"181 ."],
[ "  Какви действия ще предприемем, ако топлообменния апарат намали степента на охлаждане, а количеството на топлина към него и дебитите на флуидите остават непроменени?", "Ще добавим повече охлаждащи площи.", "Почистваме охладителя след разглобяване и инспекция.", "Ще увеличим дебита.", "Ще увеличим налягането на флуидите.", "Б" ,"182 ."],
[ "  Как ще предпазим котела от корозия при продължително негово бездействие?", "Дозираме порцията химикали към котловата вода и запълваме котела догоре.", "Изпразваме нацяло котела.", "Добавяме 5% хлорин и запълваме котела догоре.", "Не променяме работното ниво.", "А" ,"183 ."],
[ "  Как ще монтираме търкалящ лагер на пресова сглобка към вала на центробежна помпа?", "Ще пришлайфаме лагерната кутия с шкурка.", "Ще пришлайфаме вала, в мястото на лагера с шкурка.", "Ще използваме пластмасов чук.", "Ще нагреем в масло лагера и ще го монтираме нагрят към вала.", "Г" ,"184 ."],
[ "  По време на рутинна проверка забелязваме лека кръгова светлина между въглеродните четки и контактните пръстени на ротора при 70% товар на генератора. Какво ще предприемем?", "Ще променим позицията на четките спрямо пръстените в търсене на неутрална, нова позиция.", "Ще променим поляритета на възбуждащото напрежение към четките.", "Ще увеличим натиска на четките.", "Ще проверим повърхността на контактните пръстени и ще я почистим, както и челата на четките.", "Г" ,"185 ."],
[ "  Защо е важно веригата на задвижването на разпределителния вал на КДВГ да е обтегната?", "За да се осигури правилен газообмен и горивоподаване.", "За да се намали нивото на шума.", "За да се понижат вибрациите във веригата.", "За да се предпазят от големи износвания веригата и зъбните колела на задвижването.", "Г" ,"186 ."],
[ "  Защо трябва да сме сигурни, че при сглобяването на пластинковия топлообменник сме натегнали връзките до позиция “А” ?", "За да избегнем сериозни увреждания на пластините.", "Това не е определящо важно.", "За да няма течове.", "Трябва да натягаме дори малко повече след всяко ново разглобяване.", "А" ,"187 ."],
[ "  Когато техническото обслужване на въздушен компресор е приключило и сме готови за пробно пускане е важно да:", "Изпитаме компресора и системата до 100% натоварване.", "Проверим,че всички консуматори са затворени за времето на провеждане на теста.", "Проверим, че сме отворили нагнетателния вентил и всички вентили до въздушните бутилки.", "Проверим посоката на въртене на компресора.", "В" ,"188 ."],
[ "  Каква е организацията на подаване на сгъстен въздух при пускането на КДВГ?", "Едновременно във всички цилиндри.", "Последователно по реда на работата.", "Няма значение, цели се бързо повишаване на налягането в цилиндъра.", "Зависи от конструкцията на двигателя.", "Б" ,"189 ."],
[ "  Пускат ли се четиритактовите ДВГ със сгъстен въздух?", "Да.", "Не.", "Само с електростартер.", "Зависи от конструкцията на двигателя.", "А" ,"190 ."],
[ "  Какво е обикновено налягането на сгъстения въздух в пусковите бутилки?", "5 -10 кг/см2.", "0 – 60 MPa.", "100 – 150 MPa.", "0 – 60 Bar.", "Г" ,"191 ."],
[ "  С кой механизъм се допълва въздуха в пусковите бутилки?", "Вентилатори.", "Компресори.", "Сепаратори.", "А) и Б)", "Б" ,"192 ."],
[ "  Кой механизъм управлява отварянето на пусковите клапани?", "Електростартер.", "Пусков клапан.", "Въздухоразпределител.", "Стартов клапан.", "В" ,"193 ."],
[ "  Завъртането на коляновия вал ръчно или с валозавъртащо устройство има за цел да:", "Да създаде начален въртящ момент на коляновия вал.", "Да осигури влизането на пусков въздух в един от цилиндрите.", "Да създаде маслен клин в основните лагери на коляновия вал.", "Да създаде начален въртящ момент на винта.", "В" ,"194 ."],
[ "  Предназначението въздухоразпределителя е:", "Да осуши подавания към цилиндрите сгъстен въздух.", "Да редуцира налягането на подавания към цилиндрите въздух.", "Определя момента на подаване на въздуха към пусковите клапани.", "Да контролира налягането на подавания към цилиндрите въздух.", "В" ,"195 ."],
[ "  Пусковите клапани могат да се управляват:", "Ръчно, автоматично.", "Ръчно, електрически.", "Със сгъстен въздух.", "Автоматично.", "В" ,"196 ."],
[ "  Задължителен елемент ли е главния пусков клапан в пусковата система на КДВГ?", "Да.", "Не.", "Само при двутактови кръстоглавни КДВГ.", "Само при двутактови кръстоглавни КДВГ с голяма мощност.", "А" ,"197 ."],
[ "  Свързването на пусковата система с бутилките със сгъстен въздух се осъществява чрез:", "Главно разпределително табло.", "Щуцерна връзка.", "Главен пусков клапан.", "Главен маневрен клапан.", "В" ,"198 ."],
[ "  Електростартерът представлява:", "Електродвигател.", "Акумулаторно устройство.", "Трансформатор.", "Нищо от изброеното.", "А" ,"199 ."],
[ "  Нагревните свещи са спомагателни устройства при:", "КДВГ с малка мощност.", "“V” образни КДВГ.", "Кръстоглавни КДВГ.", "Нищо от изброеното.", "А" ,"200 ."],
[ "  Четиритактовите КДВГ реверсивни ли са?", "Да.", "Не.", "Само бързооборотните.", "Само четиритактови КДВГ с голяма мощност.", "А" ,"201 ."],
[ "  Главния пусков клапан е елемент на:", "Пускова система на КДВГ.", "Реверсивна система на КДВГ.", "Система за пневмоуправление на КДВГ.", "Пневматичната система на КДВГ.", "А" ,"202 ."],
[ "  Чрез кой елемент от пусковата система се осъществвява повторен пуск на КДВГ при отворение бутилки със сгъстен въздух?", "Главен пусков клапан.", "Пускови клапани.", "Въздухоразпределител.", "Главен маневрен клапан.", "А" ,"203 ."],
[ "  При каква минимална температура в машинно отделение може да се стартира пускането на КДВГ?", "8 ºC.", "15 ºC.", "5 ºC.", "Няма такова изискване.", "Г" ,"204 ."],
[ "  При някои двигатели се използват медни гарнитури между дюзите, цилиндровите глави и горивните камери. Защо е важно тези гарнитури да са оригинални?", "За да осигурим точна позиция на дюзите.", "За да предпазим дюзите от прегряване поради влошен топлообмен с главите.", "За да възстановим конструкивната херметичност и позиция на дюзите.", "За да облекчим монтажа и да създадем пълна херметичност.", "В" ,"205 ."],
[ "  При изпитването на дюзите за налягане на отваряне, с помпата на стенда трябва да се работи внимателно. Как?", "Да се упражнява рязко натоварване на лоста й за да се достигне до впръскване, аналогично с това на двигателя.", "Не е от особено значение, важно е дюзата да поддаде.", "Упражняваме постепенен, бавен натиск, като проверяваме и с върха на пръста си за коректно определяне началото на подаване.", "Натискаме с достатъчно усилие за да определим акуратно началото на впръскване и да чуем звука от дюзата.", "Г" ,"206 ."],
[ "  Поради инспекция или ремонт се налага котела да бъде изпразнен. Ако имаме достатъчно време, как ще проведем тази операция?", "Байпасираме регулатора за ниво, запълваме с котлова вода до горе, след което изпразваме.", "Разтоварваме котела чрез принудително отваряне на предпазните клапани и изпълняваме операцията.", "Оставяме котела да изстине без да предприемаме нищо. После изпомпваме котловата вода.", "Изпразваме котела чрез горно и долно продухване.", "В" ,"207 ."],
[ "  Коя е най-вероятната причина за прегряването на основните лагери?", "Претоварване на двигателя.", "Висока температура на охлаждащата вода.", "Висока температура на маслото.", "Висока температура на морската вода.", "В" ,"208 ."],
[ "  Какви действия ще предприемем след като сме затворили главния пускови клапан, преди да влезем в картерното пространство?", "Ще обезпечим вахта в ЦПУ  за да не пуска никой в машината.", "Ще зацепим валоповоротното устройство.", "Ще затворим всички кранове по въздушната магистрала до двигателя.", "Ще изключим въздушните компресори.", "Б" ,"209 ."],
[ "  Ако в магазията липсват оригинални гарнитури за окомплектоване на центробежна помпа, какъв материал ще предпочетем?", "Плътна гума.", "Корк.", "Плътна хартия /стари  навигационни карти/.", "Клингерит.", "В" ,"210 ."],
[ "  До какво води прокапването на дюзата след подаване на порцията гориво?", "Увеличава мощността.", "Уврежда буталото и цилиндровата втулка.", "Подобрява горенето.", "Уврежда клапаните.", "А" ,"211 ."],
[ "  Коя от изброените причини е вероятната за чукането при работата на машината?", "Повишени хлабини в цилиндро-буталната група.", "Повишени хлабини в буталния болт и горния лагер на мотовилката.", "По-рано горивоподаване или проблем в дюза.", "Всичко изброено.", "Г" ,"212 ."],
[ "  Попадането на малки количества гориво в маслото води до:", "Малкото количество гориво в маслото не пречи на работата на двигателя.", "Подобрява пусковите качества на студен двигател.", "Подобрява миещите качества на маслото.", "Влошава качеството на маслото и води до сериозни увреждания на двигателя.", "Г" ,"213 ."],
[ "  Кой от способите за наваряване е подходящ за възстановяване на тънкостенни детайли?", "Електродъгово наваряване в защитена среда от въглероден двуокис.", "Автоматично наваряване под слой от флюс.", "Електронаваряване с вибриращ електрод.", "Електрошлаково наваряване.", "А" ,"214 ."],
[ "  Средното индикаторно налягане е пряк диагностичен показател за:", "Оценка на техническото състояние на двигателя.", "Равномерно разпределение на механичното натоварване по цилиндри.", "Равномерно разпределение на работата по цилиндри.", "Равномерно разпределение на температурното натоварване по цилиндри.", "В" ,"215 ."],
[ "  Най-силно влияние върху изменението на средното индикаторно налягане има: ", "Количеството подавано гориво.", "Началото на подаване на гориво.", "Честотата на въртене.", "Качеството на подаваното гориво.", "А" ,"216 ."],
[ "  Уеднаквяване на средното индикаторно налягане по цилиндри се прави:", "При номинално натоварване на двигателя.", "Винаги когато има отклонение от средната стойност повече от 2,5%.", "При продължителна експлоатационна мощност над 80% от номиналната.", "Винаги когато има отклонение от средната стойност повече от 1,5%.", "В" ,"217 ."],
[ "  Максималното налягане е косвен диагностичен показател за:", "Техническото състояние на двигателя.", "Равномерното разпределение на механичното натоварване по цилиндри.", "Равномерното разпределение на работата по цилиндри.", "Равномерното разпределение на температурното натоварване по цилиндри.", "Б" ,"218 ."],
[ "  Най-силно влияние върху изменението на максималното налягане има: ", "Количеството подавано гориво.", "Началото на подаване на гориво.", "Честотата на въртене.", "Качеството на подаваното гориво.", "Б" ,"219 ."],
[ "  Уеднаквяване на максималното налягане по цилиндри се прави:", "При номинално натоварване на двигателя.", "Винаги когато има отклонение от средната стойност повече от 5%.", "При продължителна експлоатационна мощност над 80% от номиналната.", "Винаги когато има отклонение от средната стойност повече от 3%.", "В" ,"220 ."],
[ "  Когато се променя ъгъла на изпреварване на подаване на гориво с цел уеднаквяване на максималното налягане по цилиндри е необходимо:", "Експлоатационната мощност на двигателя да бъде над 80% от номиналната.", "Отклоненията в налягането на сгъстяване да бъдат в допустимите гараници.", "“а”  и  “б”.", "Мощността на двигателя да бъде номиналната.", "В" ,"221 ."],
[ "  Налягането на сгъстяване е косвен диагностичен показател за:", "Техническото състояние на двигателя.", "Равномерното разпределение на механичното натоварване по цилиндри.", "Равномерното разпределение на работата по цилиндри.", "Равномерно разпределение на температурното натоварване по цилиндри.", "А" ,"222 ."],
[ "  Налягането на сгъстяване е пряк диагностичен показател за:", "Въздухоснабдяването в цилиндъра на двигателя.", "Техническото състояние на двигателя.", "Работата на турбокомпресора.", "Равномерното разпределение на работата по цилиндри.", "А" ,"223 ."],
[ "  Когато налягането на сгъстяване се използва за оценка плътността на горивната камера на двигателя, текущо измерените му стойности се сравняват с:", "Еталонната стойност от стендовия протокол за номинална честота на въртене.", "Еталонната стойност от стендовия протокол за текущата честота на въртене.", "Текущата еталонната стойност.", "Еталонната стойност от стендовия протокол за максимална честота на въртене.", "В" ,"224 ."],
[ "  Когато налягането на сгъстяване се използва за оценка плътността на горивната камера на двигателя е необходимо да има идентичност на:", "Честотите на въртене.", "Височините на мъртвото пространство.", "“а”  и  “б”.", "Околната среда.", "В" ,"225 ."],
[ "  Кое от изброените устройства се подлага на специални изпитания по време на ходовите изпитания?", "Електрозадвижване на товарното устройство.", "Лодъчното спасително устройство.", "Аварийните генератори.", "Уредите за вътрешна свръзка и сигнализация.", "Г" ,"226 ."],
[ "  Каква е допустимата разлика между наляганията на отваряне на дюзите на КДВГ?", "5 Вar.", "10 Bar.", "15 Bar.", "20 Bar.", "В" ,"227 ."],
[ "  Какво ще предприемем, ако пластинковият охладител протече след обслужване, ако сме натегнали връзките му до минимални стойности на величината А ?", "Ще понижим налягането на флуидите.", "Ще натегнем повече.", "Ще притворим крановете за да достигнем до работната температура по-бързо тогава се очаква течът да спре.", "Спираме, разглобяваме, проверяваме и ако трябва подменяме гумените гарнитури.", "Г" ,"228 ."],
[ "  Когато почистваме буталото следва да обърнем особено внимание на почистването на каналите на буталните пръстени. Защо?", "За да могат пръстените свободно да се движат в тях.", "Пръстените трябва да “дишат” за да осигурят добра херметичност на ЦБГ.", "За да могат газовете да имат достатъчен достъп отгоре и зад буталните пръстени.", "За пасване на пръстена към канала.", "В" ,"229 ."],
[ "  Каква е периодичността на гресиране на лагерите на центробежна помпа ?", "Определя се от нормите на системата за НТО на кораба /или от препоръките на фирмата производител/.", "Ежедневно.", "Веднъж на седмица.", "Ежемесечно.", "А" ,"230 ."],
[ "  Двигателят се развърта до пускови обороти, но не стартира. Защо?", "Температурата на маслото е твърде ниска.", "Поради ниска температура на КДВГ.", "ТКА не се върти с достатъчни обороти.", "Въздух в горивната система за високо налягане.", "Г" ,"231 ."],
[ "  Каква е причината при подаване на пускови въздух КДВГ да не се развърта?", "Един или повече пускови клапани за заклинили в затворено положение.", "Въздухоразпределителят не се върти или не се отваря.", "Ниско налягане на пусковия въздух.", "Всичко изброено.", "Г" ,"232 ."],
[ "  Какви действия следва да предприемем при първоначална работа на КДВГ с подменен един или повече основни лагери?", "Не е необходима специална грижа при експлоатацията.", "След едночасова работа при благоприятни температури следва да проверим лагера /лагерите/.", "Спираме след половин час работа за да проверим състоянието  му чрез разглобяване.", "Разработваме лагера при по-ниски натоварвания, при непрекъснат контрол на температурата му.", "Г" ,"233 ."],
[ "  Кой елемент се използва като легиращ за изработването на колянови валове от чугун?", "Магнезий.", "Хром.", "Молибден.", "Никел.", "А" ,"234 ."],
[ "  Каква трябва да е структурата  на графита в чугуните, от които са изработени някои колянови валове?", "Пластинчата.", "Памукообразна структура.", "Сфероидална.", "Гнездовидна .", "В" ,"235 ."],
[ "  Каква е основната операция при изработването на монолитни  /несъставни/ колянови валове от чугун?", "Коване.", "Леене.", "Щамповане.", "Струговане.", "Б" ,"236 ."],
[ "  След монтаж трябва ли да бъде проверен радиалният бой на помпата в маслената вана на ТКА?", "Не трябва.", "Да, ако турбокомпресорния агрегат е с вътрешно разположени лагерни възли.", "Да, ако турбокомпресорният агрегат е с външно разположени лагерни възли.", "Да, ако турбокомпресорния агрегат е с външно или вътрешно разположени лагерни възли.", "Б" ,"237 ."],
[ "  При изправно техническо състояние на двигателя, налягането на сгъстяване се регулира с промяна на:", "Височината на мъртвото пространство.", "Повдигането на изпускателния клапан.", "Почистване на продухвателните клапани.", "Хода на изпускателния клапан.", "А" ,"238 ."],
[ "  Текущата еталонна стойност на налягането на сгъстяване се определя с помощта на:", "Измерване по време на експлоатация.", "Текущата стойност на налягането в продухвателния колектор и данни от стендовия протокол.", "Привеждане на измерената стойност към стандартни условия.", "Изчисляване по време на експлоатация.", "Б" ,"239 ."],
[ "  Началото на износване на първи бутален пръстен може да се определи с помощта на налягането на сгъстяване и:", "Температурата на цилиндровата втулка.", "Температурата на входа на продухвателните прозорци.", "Температурата на главата в близост до изпускателния клапан.", "Температурата на главата в близост до горивния клапан.", "А" ,"240 ."],
[ "  Износване на два и повече бутални пръстени може да се определи с помощта на налягането на сгъстяване и:", "Температурата на цилиндровата втулка.", "Температурата на входа на продухвателните прозорци.", "Температурата на главата в близост до изпускателния клапан.", "Температурата на главата в близост до горивния клапан.", "Б" ,"241 ."],
[ "  Неплътност на изпускателния клапан може да се определи с помощта на налягането на сгъстяване и:", "Температурата на цилиндровата втулка.", "Температурата на входа на продухвателните прозорци.", "Температурата на главата в близост до изпускателния клапан.", "Температурата на входа на изпускателните прозорци.", "В" ,"242 ."],
[ "  Разграничаване на повредите неплътност на изпускателния клапан и износване на два и повече бутални пръстена може да стане посредством:", "Увеличение на цилиндровото мазане.", "Температурата на изходящите газове.", "Налягането на сгъстяване.", "Температурата на главата в близост до горивния клапан.", "А" ,"243 ."],
[ "  Максималното налягане на горивоподаване е диагностичен показател за:", "Състоянието на горивната апаратура.", "Състоянието на отворите на разпръсквача.", "Хидравличната плътност на горивовпръскващата апаратура.", "Хидравличната плътност на горивните тръбопроводи.", "Б" ,"244 ."],
[ "  Повишените стойности на максималното налягане на горивоподаване могат да бъдат причинени от: ", "По-голям активен ход на плунжера.", "Запушване на отворите на разпръсквача.", "“а”  и  “б”.", "По-малък активен ход на плунжера.", "В" ,"245 ."],
[ "  Повишените стойности на налягането на горивоподаване след отваряне на горивния клапан могат да бъдат причинени от: ", "По-голяма циклова порция гориво.", "Запушване на отворите на разпръсквача.", "“а”  и  “б”.", "По-малка циклова порция гориво.", "Б" ,"246 ."],
[ "  Понижените стойности на налягането на горивоподаване след отваряне на горивния клапан могат да бъдат причинени от: ", "По-малък активен ход на плунжера.", "Разширение на отворите на разпръсквача.", "“а”  и  “б”.", "По-голям активен ход на плунжера.", "Б" ,"247 ."],
[ "  Понижените стойности на максималното налягане на горивоподаване могат да бъдат причинени от: ", "По-малък активен ход на плунжера.", "Разширение на отворите на разпръсквача.", "“а”  и  “б”.", "По-голям активен ход на плунжера.", "В" ,"248 ."],
[ "  С промяна на проходното сечение при изхода на дюзовия апарат може да се промени положението на:", "Границата на помпажа.", "Линията на работните режими.", "Кривите на КПД на компресорната част.", "Кривите на КПД на компресорната част и на оборотите.", "А" ,"249 ."],
[ "  При кой от способите на регулиране на цикловата порция от ГПВН се изисква поставянето на управляващия орган в определена позиция при проверка фазите на подаване на гориво? ", "Постоянно начало и променлив край на подаване.", "Променливо начало и постоянен край на подаване.", "Променливо начало и край на подаване.", "Всичко изброено.", "Г" ,"250 ."],
[ "  Кой от посочените регулиращи показатели се измерва при проверка и регулиране статичните фази на подаване за ГПВН - клапанен тип - на  КДВГ?", "Преливен ход на плунжера след края на подаване.", "Пълен ход на плунжера.", "Преливен ход на плунжера преди началото на подаване.", "Нито един от посочените показатели.", "В" ,"251 ."],
[ "  Коя от изброените причини предизвиква понижаване еластичността на буталните пръстени на КДВГ?", "Недостатъчно мазане при работа.", "Голямо специфично налягане при работа.", "Отлагане на нагар в каналите на буталните пръстени.", "Значително нагряване при работа.", "Г" ,"252 ."],
[ "  Проверката и изпълнението на статична настройка на ГПВН на КДВГ се извършва по данни от:", "Инструкцията за експлоатация на двигателя от фирмата строител.", "Протоколите от стендовите изпитания на двигателя.", "Протоколите от изпитанията при последния ремонт на двигателя.", "Проверката на настройката преди извършващия се ремонт.", "Б" ,"253 ."],
[ "  Чрез периодично контролиране на “дишането” на коляновите валове на КДВГ се констатира:", "Степента на износване на основните шийки и лагери на коляновия вал.", "Степента на несъосност на коляновия вал с валопровода (ел.генератора).", "Степента на несъосност на основните му шийки.", "Степента на износване на основните шийки.", "В" ,"254 ."],
[ "  Коя от следните причини може да доведе до увеличаване температурата на прегрятата пара в парния котел?", "Увеличаване натоварването на пещта.", "Замърсяване на водогрейните тръби пред паропрегревателя.", "Понижаване температурата на питателната вода.", "Всичко изброено по-горе.", "Г" ,"255 ."],
[ "  Нискотемпературната корозия се причинява от наличието в котелното гориво на:", "Сяра.", "Ванадий.", "Парафин.", "Вода.", "А" ,"256 ."],
[ "  Каква операция е рихтоването?", "Пластична деформация при нагряване на материала.", "Студено изправяне.", "Машинно райберене.", "Нарязване на шевронни зъби с копирна фреза.", "Б" ,"257 ."],
[ "  Горивните дюзи се отварят автоматично от налягането на горивото, зададено от ГПВН. Регулирането на налягането на отваряне става чрез:", "Регулиране на налягането на ГПВН.", "Пружината на дюзата.", "Хода на плунжера на ГПВН.", "Височината на затваряне на преливния клапан.", "Б" ,"258 ."],
[ "  От термодинамична гледна точка, охлаждането на двигателите :", "Има положителен ефект върху параметрите на работния цикъл.", "Има отрицателен ефект върху параметрите на работния цикъл.", "Зависи от натоварването на двигателя.", "Не влияе.", "Б" ,"259 ."],
[ "  За какво сигнализира повишеното налягане в картера на тронковите  двигатели ? ", "За пределно натоварване.", "За повишено износване на ЦБГ.", "За повишено налягане на маслената помпа.", "За свръхобороти на двигателя.", "Б" ,"260 ."],
[ "  Когато в процеса на диагностика се използва показателя максималното налягане на горивоподаване е необходима идентичност на:", "Честотата на въртене и вискозитета на горивото, при които са правени измерванията.", "Идентичност на предходните показатели на горивоподаването.", "“а”  и  “б”.", "Нищо от изброеното.", "В" ,"261 ."],
[ "  Кога е опасно налягането на горивоподаване след отваряне на горивния клапан да бъде по-високо от нормалното?", "Винаги.", "Когато натоварването на двигателя е по-високо от 85-90% от номиналното.", "Никога.", "Няма такава опасност.", "Б" ,"262 ."],
[ "  Налягането на отваряне на горивния клапан е диагностичен показател за:", "Състоянието на пружината на горивния клапан.", "Задържането на иглата на елемента.", "“а”  и  “б”.", "Нищо от изброеното.", "В" ,"263 ."],
[ "  Ниското налягане на отваряне на горивния клапан може да бъде причинено от:", "Недостатъчен натяг на пружината.", "Задържане на иглата на елемента.", "Нехерметичност на елемента.", "Нищо от изброеното.", "А" ,"264 ."],
[ "  Високото налягане на отваряне на горивния клапан може да бъде причинено от:", "Пренатягане на пружината.", "Задържане на иглата на елемента.", "“а”  и  “б”.", "Нехерметичност на елемента.", "В" ,"265 ."],
[ "  Ниското налягане на отваряне на горивния клапан причинява:", "Намаление на горивото изгарящо през втората фаза на горенето.", "Увеличение на горивото изгарящо през третата и четвъртата фази на горенето.", "“а”  и  “б”.", "Нищо от изброеното.", "В" ,"266 ."],
[ "  Високото налягане на отваряне на горивния клапан причинява:", "Увеличение на горивото изгарящо през втората фаза на горенето.", "Намаление на горивото изгарящо през третата и четвъртата фази на горенето.", "“а”  и  “б”.", "Нищо от изброеното.", "В" ,"267 ."],
[ "  Игла на елемента, при която има механическо задържане при отварянето, по време на проверка на стенд:", "При бавно покачване на налягането се отваря на необходимото налягане, но не разпрашава горивото.", "При бавно покачване на налягането се отваря на по-високо налягане, но разпрашава горивото некачествено.", "При бавно покачване на налягането се отваря на необходимото налягане, но разпрашава горивото некачествено.", "При бавно покачване на налягането се отваря на по-ниско налягане, но разпрашава горивото качествено.", "А" ,"268 ."],
[ "  Ъгълът по коляновия вал, на който става отваряне на горивния клапан е диагностичен показател за:", "Началото на подаване на гориво.", "Началото на горенето.", "“а”  и  “б”.", "Края на горенето.", "А" ,"269 ."],
[ "  Началото на подаване на гориво може да бъде оптимално за:", "Топлинната напрегнатост.", "Специфичния разход на гориво.", "Не оказва влияние.", "“а”  или  “б”.", "Г" ,"270 ."],
[ "  При работа на леко гориво спрямо работата на тежко гориво механичната напрегнатост е:", "Еднаква.", "По-ниска.", "По-висока.", "Зависи от конструкцията на двигателя.", "В" ,"271 ."],
[ "  При работа на тежко гориво с по-висока температура на подгрев, механичната напрегнатост е:", "Еднаква.", "По-ниска.", "По-висока.", "Зависи от конструкцията на двигателя.", "В" ,"272 ."],
[ "  При работа на тежко гориво с по-висока температура на подгрев, топлинната напрегнатост е:", "Еднаква.", "По-ниска.", "По-висока.", "Зависи от конструкцията на двигателя.", "В" ,"273 ."],
[ "  При стартиране на двигателя налягането на маслото е О.К. При натоварване, с повишаване на температурата му, налягането прогресивно пада. Каква може да бъде вероятната причина?", "Пробив  в масления охладител.", "Увеличена хлабина в лагерите.", "Недостатъчно масло в картера.", "Маслената помпа се претоварва.", "Б" ,"274 ."],
[ "  Когато налягането на охлаждаща центробежна помпа морска вода се повиши, това е сигнал за :", "По-качествена работа на системата.", "По-висок дебит на помпата.", "Забиване на охладител.", "Забиване на кингстон.", "В" ,"275 ."],
[ "  Какво ще се случи, ако пуснем центробежна помпа със затворен нагнетателен клапан?", "Ще претоварим по ток електродвигателя на задвижването и.", "Помпата няма да се завърти.", "Ще разтоварим задвижващия електродвигател от пускови ток.", "Ще се отвори предпазния клапан между помпата и клапана.", "В" ,"276 ."],
[ "  Поради разцентроване на привода на ГПВН ъгъла на предварение на подаване на гориво се е променил към нарастване, над оптималния. Какво ще се случи?", "Двигателят ще работи “по-твърдо”, но с по-ниски температури на отработените газове.", "Двигателят ще работи “по-твърдо” и с по-високи температури на отработените газове.", "Двигателят ще работи “по-меко” и с по-ниски температури на отработените газове.", "Двигателят ще работи “по-меко”, но с по-високи температури на отработените газове.", "А" ,"277 ."],
[ "  Ако хидравлична помпа на хидравличен брашпил прегрява причината може да бъде:", "Много високи обороти на хидромотора.", "Много високо работно налягане на помпата.", "Недостатъчни обороти на хидромотора.", "Твърде малък ъгъл на отклонение на ротора.", "Б" ,"278 ."],
[ "  Коя схема за принудително пълнене се използва приоритетно при съвременните главни корабни двигатели ?", "Газотурбинно принудително пълнене с автономен механичен компресор.", "Газотурбинно принудително пълнене със задвижван ТКА.", "Газотурбинно принудително пълнене с щатен механичен компресор.", "Газотурбинно принудително пълнене с двойно използване на енергията на отработените газове.", "А" ,"279 ."],
[ "  Демпфериращите свойства на лагерните пакети се дължат на :", "Дебелината на пластините.", "Еластичните свойства на пластините .", "Калибровката и подреждането им в пакета.", "Масления слой между пластините.", "Г" ,"280 ."],
[ "  Може ли на ротор със заварени лопатки при счупена лопатка да се продължи експлоатацията?", "Не, заменя се с нов, а стария се дава за рециклиране.", "Да, като се отстрани диаметрално противоположната лопатка и се балансира.", "Чрез балансиране може да се коригира динамичното натоварване от липсваща маса.", " Да, чрез наваряване на лопатката със специални електроди.", "Б" ,"281 ."],
[ "  Коя маслена система е с най-ниска степен на надеждност по отношение гарантиране на работата на лагерните възли?", "Мазане посредством маслени помпи, задвижвани от вала на ТКА.", "Мазане посредством напорна система обща с двигателя.", "Мазане посредством самостоятелна гравитационна маслена система.", "Мазане посредством маслоразпръскващи дискове.", "В" ,"282 ."],
[ "  Коя от операциите не следва да се предприема при пожар в подбуталните пространства?", "Да се увеличава цикловата порция лубрикаторно масло.", "Да се включи инертираща противопожарна система към мястото на пожара.", "Да се спре КДВГ.", "Да се изчака пожара да спре.", "В" ,"283 ."],
[ "  Кое твърдение за химическата деаерация е невярно?", "NaSO4, отделен при реакцията на водата с хидразина (N2H4 ) предизвиква повишаване на общото солесъдържание.", "Водорода от хидразина се свързва с разтворения кислород и се получава вода, като се отделя азот.", "Хидразинът, който е в излишък във водата се разпада на амоняк и се отделя азот.", "Амоняка придава допълнителна киселинност на водата.", "Г" ,"284 ."],
[ "  Какво се постига с горното продухване на котела?", "Отделят се нефтопродуктите попаднали в котелната вода и лек плаващ шлам, който има свойството да се разпенва.", "Намалява се частично солесъдържанието на котелната вода.", "Понижава се твърдостта на котелната вода.", "А) и Б).", "Г" ,"285 ."],
[ "  Кои корабни парни котли имат най-високи изисквания към качеството на котелната вода?", "Водотръбните котли.", "Двуконтурните котли.", "Пламъчнотръбните.", "Утилизационните.", "Б" ,"286 ."],
[ "  Като правило масления резервоар/танк/ в хидравлична система при нормално ниво трябва да има обем:", "2 до 3 пъти повече от нормалния поток в системата.", "Равен на потока в системата.", "10 пъти повече от потока.", "Броя на литрите които помпата дава за 1 минута.", "А" ,"287 ."],
[ "  Влиянието на коя от фазите на горивоподаване може да се компенсира чрез настройка на ГПВН ?", "Фаза на задържане на впръскването.", "Фаза на активно подаване.", "Фаза на свободно изтичане.", "Чрез настройване на ГПВН не се компенсира влиянието на нито една от фазите.", "А" ,"288 ."],
[ "  Ще се промени ли честотата на въртене на работещ асинхронен двигател с навит ротор, ако се увеличи съпротивлението в роторната му верига?", "Няма да се промени.", "Честотата на въртене ще се намали.", "Честотата на въртене ще се увеличи.", "Ако товарът нараства ще се увеличи.", "Б" ,"289 ."],
[ "  Как конструктивно трябва да бъде изпълнено преминаването на електрически кабели през водонепроницаеми прегради?", "Трябва да са заземени от двете страни на преградата.", "Трябва да бъдат бандажирани радиално на дължина шест диаметъра.", "През салникова кутия подходящ размер, уплътнена с подходящ тип набивки .", "Кабелите трябва да са добре заскобени.", "В" ,"290 ."],
[ "  Повредите на контактите във вътрешността на контролните станции на товарните винчове, причинени от конденза, могат да се намалят (превантивно избегнат) чрез: ", "Зачохляне на станцията с брезент.", "Вътрешно боядисване на контактната кутия с епоксиден уплътнител.", "Периодично вентилиране на контактната кутия .", "Използване на лентови нагреватели във вътрешноста на контактната кутия.", "Г" ,"291 ."],
[ "  При работа на леко гориво с по-високо цетаново число спрямо работата на тежко гориво топлинната напрегнатост е:", "Еднаква.", "По-ниска.", "По-висока.", "Зависи от конструкцията на двигателя.", "В" ,"292 ."],
[ "  Кой от посочените показатели се променя чувствително при прехода от леко гориво на тежко и обратно:", "Ъгълът на начало на подаване от горивния клапан.", "Максималното налягане на горивоподаване.", "Налягането на отваряне на горивния клапан.", "Нищо от изброеното.", "Б" ,"293 ."],
[ "  Прехода от леко гориво на тежко и обратно се прави на натоварване по-ниско от номиналното с цел:", "Да не се претовари двигателя топлинно.", "Да не се претовари двигателя механично.", "“а”  и  “б”.", "Да не възникнат проблеми с горивната апаратура.", "В" ,"294 ."],
[ "  Прехода от леко гориво на тежко и обратно се прави колкото се може по-бавно с цел:", "Да не се претовари двигателя топлинно.", "Да не се претовари двигателя механично.", "Да не възникнат проблеми с горивната апаратура.", "Нищо от изброеното.", "В" ,"295 ."],
[ "  При бърз преход от леко гориво на тежко може:", "Плунжерите на помпите или иглите на елементите да заклинят.", "Да се получат пукнатини или да се разхерметизират уплътняващите повърхнини на горивонагнетателните помпи.", "Да се претовари двигателя.", "Нищо от изброеното.", "Б" ,"296 ."],
[ "  Когато температурата на разпръсквачите е по-висока от 180 ºС съществува вероятност от:", "Нарушаване на качеството на разпръскването.", "Подобряване на качеството на разпръскването.", "Натрупване на нагар и запушване на разпръскващите отвори.", "Не оказва влияние.", "В" ,"297 ."],
[ "  Коя от изброените повреди предизвиква увеличение на нагарообразуването и запушване на сопловите отвори на горивните клапани:", "Задържане на иглите при отскачането им.", "Износване на иглата и тялото на елемента по цилиндричната направляваща част.", "Нарушаване плътността на коничната уплътняваща повърхнина.", "Нищо от изброеното.", "В" ,"298 ."],
[ "  Проверка и статична настройка на горивонагнетателните помпи на КДВГ се извършва по данни от:", "Инструкцията за експлоатация на двигателя.", "Протоколите от стендовите изпитания.", "Протоколите от ходовите изпитания.", "Протокола от швартовите изпитания.", "Б" ,"299 ."],
[ "  Остатъчното налягане в горивния тръбопровод високо налягане е диагностичен показател за херметичността на:", "Нагнетателния клапан.", "Горивния клапан.", "Смукателния клапан.", "Отсечния клапан.", "А" ,"300 ."],
[ "  Нехерметичния нагнетателен клапан на горивонагнетателна помпа предизвиква:", "Намаление на указателя на натоварване.", "Увеличение на цикловата порция гориво.", "Намаление на цикловата порция гориво.", "Увеличение на указателя на натоварване.", "В" ,"301 ."],
[ "  Коя от посочените неизправности  може да бъде причина за дименето на двигателя?", "1 градус по-ранно впръскване.", "1 градус по-късно впръскване.", "Ниско налягане на сгъстяване Рс.", "Високо налягане на сгъстяване Рс.", "В" ,"302 ."],
[ "  Как разпознаваме неплътния горивен разпръсквач по време на тестване на дюзата:", "Когато наблюдаваме бързо падане на налягането при  затворен иглен клапан.", "Когато игления клапан не се отваря при достигане на препоръчителното налягането на отваряне.", "Когато игления клапан се отваря преди достигане на препоръчителното налягането на отваряне.", "Когато игления клапан се отваря бързо преди достигане на препоръчителното налягането на отваряне.", "А" ,"303 ."],
[ "  Каква е първата стъпка за намаляване на въглеродните отлагания по нагнетателните клапани на въздушен компресор?", "Намаляване на температурата на нагнетявания въздух.", "Да се увеличи степента на компресия.", "Да се използва масло с висок вискозитет.", "Да се увеличи летливостта на маслото.", "А" ,"304 ."],
[ "  През време на подготовката на турбинната уредба за действие, вахтеният механик трябва да записва във вахтения дневник:", "Всички нареждания от мостика  и разпореждания на главния механик.", "Времето на извършването на основните операции.", "Резултатите от извършените проверки и измервания.", "Всичко изброено.", "Г" ,"305 ."],
[ "  Кое превантивно действие следва да осъществим приоритетно преди да стартираме подгрева на турбината?", "Да включим валоповоротното устройство и да проверим нивото на маслото и работата на маслената система.", "Да впишем операцията в дневника .", "Да проверим изправността на КИП и автоматиката на турбината, основно да проверим аварийната сигнализация.", "Да извършим предварителни измервания и да ги сравним с тези на завода - строител.", "Г" ,"306 ."],
[ "  Кое твърдение за реда на провеждане на анализа на котловата вода е невярно?", "Извършва се до два пъти в денонощието.", "Прави се след охлаждане на водата, но не по-късно от 4 часа.", "Пробата винаги се взема от едно и също място-тръбопровода за долно продухване.", "Тръбопровода добре се продухва, съдовете се изплакват със същата вода.", "В" ,"307 ."],
[ "  Кога, според визуалните способи за определяне качеството на горивния процес при КПК, имаме оптимална стойност на коефициента на излишния въздух  α? ", "Ако факела е ослепително бял или ярко жълт съчетан със светъл до бял дим.", "Ако факела е светло оранжев или червен.", "Ако факела е сламено-жълт към леко оранжев, съчетан с леко сив дим до леко кафяв.", "Ако факела е с тъмно червени ивици в корена.", "В" ,"308 ."],
[ "  Горивните системи обслужващи КДВГ биват:", "За леко и тежко гориво.", "За леко гориво.", "За тежко гориво.", "Нито едно от изброените.", "А" ,"309 ."],
[ "  Отстойните цистерни на корабите са елемент на: ", "Горивната система.", "Горивоподгряващата система.", "Пусковата система.", "Горивоподгряващата система.", "А" ,"310 ."],
[ "  Начините за почистване на горивата в корабни условия са:", "Филтриране и утаяване.", "Сепариране.", "Филтриране, утаяване, сепариране.", "Нито едно от изброените.", "В" ,"311 ."],
[ "  Допустимото съдържание на вода в корабното гориво не трябва да превишава:", "0,003.", "0,01.", "Не влияе върху качеството на горивния процес.", "Определя се от производителя.", "Г" ,"312 ."],
[ "  Утаяването е метод който.................... при почистването на горивото:", "Не се прилага.", "Прилага се.", "Прилага се само в речния флот.", "Прилага се само в морския флот.", "Б" ,"313 ."],
[ "  Филтрите за почистване на горивото биват:", "За ниско налягане, за високо налягане.", "Диференциални.", "А) и Б).", "Нито едно от изброените.", "В" ,"314 ."],
[ "  Филтрите за грубо почистване са филтри за:", "Високо налягане.", "Диференциално налягане.", "Ниско налягане.", "Налягането няма значение.", "В" ,"315 ."],
[ "  Филтрите използвани в корабни условия обикновено се изработват:", "С една секция.", "С две секции.", "Много секционни.", "Броя на секциите няма значение.", "Б" ,"316 ."],
[ "  Задържането на механични примеси и вода е принцип на почистването на горивата чрез:", "Сепариране.", "Утаяване.", "Филтриране.", "Нито едно от изброените.", "А" ,"317 ."],
[ "  Сепараторите очистващи корабното гориво най-често са:", "Центробежни.", "Флотационни.", "Коагулационни.", "Нито едно от изброените.", "А" ,"318 ."],
[ "  Под режим пурификация разбираме режим на работа при който основно има:", "Отделяне на вода и механични примеси от горивото.", "Отделяне на вода от горивото.", "Отделяне на механични примеси от горивото.", "Нито едно от изброените.", "Б" ,"319 ."],
[ "  Под режим кларификация разбираме режим при който основно има:", "Отделяне на механични примеси от горивото.", "Отделяне на вода от горивото.", "Отделяне на вода и механични примеси от горивото.", "Нито едно от изброените.", "А" ,"320 ."],
[ "  Корабните сепаратори предимно са: ", "Самоочистващи се.", "Несамоочистващи се.", "Зависи от мощността на КДВГ.", "Зависи от типа на кораба.", "А" ,"321 ."],
[ "  Управлението на периода на самоочистване на сепараторите зависи от:", "Класа на автоматизация на кораба.", "Изискванията на чартьора.", "Района на плаване.", "Нито едно от изброените.", "Г" ,"322 ."],
[ "  Под воден затвор на сепаратора разбираме:", "Ниво на водата в сепаратора поддържано от напорния диск.", "Достигане на max допустимо количество вода очистваща се от сепаратора в корпуса му.", "Нито едно от двете.", "Границата между водата и сепарирания флуид.", "А" ,"323 ."],
[ "  Използването на непочистено гориво влияе ли върху работата на КДВГ?", "Не.", "Да.", "Зависи от конструкцията на двигателя.", "Нито едно от изброените.", "Б" ,"324 ."],
[ "  Може ли сепарирането на горивото да замени филтрирането му?", "Не.", "Да.", "Може само при четиритактов КДВГ.", "Може само при двутактов КДВГ.", "А" ,"325 ."],
[ "  Каква е причината за появата на тъмно червени ивици в корена на факела?", "Лошо филтриране на горивото или попадане на вода в него.", "Задръстване на форсунките.", "Лошо разпръскване, удари на факела в стените на пеща или помежду факлите на форсунките.", "Недостиг на въздух.", "Б" ,"326 ."],
[ "  Нивото на водата в нивомерните стъкла се колебае и не се задържа в определено положение. Каква е вероятната причина?", "Режим на претоварване на котела.", "Спукана тръба или серпентина в економайзера.", "Силно кипене на водата поради гранично налягане  в котела.", "Високо солесъдържание или повишена алкалност в котелната вода.", "Г" ,"327 ."],
[ "  Какъв химикал следва да се добави към котловата вода при мокра консервация на КПК?", "Tринатриев Фосфат  TSP/Na3PO4/.", "Антидипон.", "Хидразин (N2H4 ).", "А) и В).", "Г" ,"328 ."],
[ "  Кога се отваря въздушния вентил на КПК?", "След окончателния подгрев на котела.", "При началото на повишаване на налягането в котела.", "При запълването на котела с вода.", "След разпалването.", "В" ,"329 ."],
[ "  Кой е най-разпространеният метод за определяне на площта на индикаторните диаграми?", "Чрез планиметриране.", "По метода на средните отсечки.", "Чрез налагане върху милиметрова хартия.", "По метода на интерполацията.", "А" ,"330 ."],
[ "  От къде черпим информация за стандартните условия на околната среда за определен корабен двигател?", "От техническите отдели на параходствата или агенциите.", "От World Weather Forecasts бюлетина.", "От техническата документация на двигателя.", "От правилника за техническо използване на флота.", "В" ,"331 ."],
[ "  Кой от способите за подгрев на турбината се осъществява приоритетно при корабните парни турбини?", "С щатна паропроводна система за подгрев на турбината при въртенето и с помощта на валоповоротното устройство.", "Подгряване на турбината при въртене на роторите с работна пара на стоянка.", "Комбиниран-отначало с работна пара с ниско налагане и превъртане с валоповоротката, а след това само с работна пара.", "Всеки един може да бъде приложен като основен.", "Г" ,"332 ."],
[ "  За кои турбозъбни агрегати преминаването през критичните обороти следва да бъде максимално бързо?", "С твърди ротори.", "С еластични ротори.", "С комплексни ротори.", "С барабанни ротори.", "Б" ,"333 ."],
[ "  Кой параметър се явява критичен при финализиране на подгрева на турбините?", "Температурата на роторите .", "Температурата на корпусите .", "Разликите в температурите на корпуса между отделните контролни точки.", "Времето за подгрев според техническата документация и изискванията на завода - строител.", "Б" ,"334 ."],
[ "  Кой параметър се явява критичен при осъществяване на подгрева на турбините?", "Температурата на роторите .", "Температурата на корпусите .", "Разликите в температурите на корпуса между отделните контролни точки.", "Времето за подгрев според техническата документация и изискванията на завода - строител.", "В" ,"335 ."],
[ "  На какъв период се превъртат роторите на турбините /при работещи маслени системи/ в случай на продължително бездействие на турбините?", "Ежеседмично.", "Ежедневно.", "Ежемесечно.", "По нареждане на главния механик.", "Б" ,"336 ."],
[ "  Като правило, къде се прислушват турбините?", "В зоната на лагерите.", "При зоната на вътрешните уплътнения.", "При зоната на външните уплътнения.", "Няма такова правило.", "Б" ,"337 ."],
[ "  Като правило, къде се прислушват турбинните редуктори?", "При съединителните муфи.", "При опорните лагери.", "В зоната на упорния лагер.", "Във всички изброени точки.", "Г" ,"338 ."],
[ "  Кога може да се използва пара, отработена от спомагателните турбомеханизми, в главния турбозъбен агрегат?", "Не може да се използва.", "При подгрев на агрегата.", "В режими на малки натоварвания.", "При установен режим на преден ход.", "Г" ,"339 ."],
[ "  Защо не трябва да използваме притриваща паста за седлото или направляващата част на иглата на разпръсквача:", "Притриващата паста ще направи много леко движението на иглата и това може да предизвика повреда на седлото ù.", "Притриващата паста е много груба.", "Остатъците от притриваща паста предизвикват корозия върху металните повърхности, което след време ще повреди иглата.", "Зависи от вида на пастата.", "В" ,"340 ."],
[ "  Замърсяването на работната течност над допустимото при обемните хидравлични задвижвания води до:", "Обемни загуби от подвижни уплътнение.", "Обемни загуби от неподвижни уплътнение.", "Промяна на наклона на характеристиката на помпата.", "Замърсяването няма съществено значение.", "А" ,"341 ."],
[ "  Продукт на непълно горене в парния котел е наличието в изгорелите газове на:", "Въглероден двуокис.", "Въглероден окис.", "Водни пари.", "Кислород.", "Б" ,"342 ."],
[ "  При продължителна работа на КДВГ маслената хлабината на основните лагери:", "Се намалява.", "Не се променя.", "Се увеличава.", "Се увеличава после остава постоянна.", "В" ,"343 ."],
[ "  Ако общото киселинно число на смазващото масло на КДВГ се повиши, това може да доведе до:", "Корозия на антифрикционната сплав на лагерите.", "Ерозия на антифрикционната сплав на лагерите.", "Кавитация на антифрикционната сплав на лагерите.", "Коагулация на антифрикционната сплав на лагерите.", "А" ,"344 ."],
[ "  Ако нивото на водата при парен котел спада бързо и не може да се задържи в допустимите граници при използване на стандартните процедури, трябва да:", "Спрете горелката и след това да затворите главния парен кран на котела.", "Да затворите главния парен кран на котела и след това да спрете горелката.", "Продухване на нивомерното стъкло, за да се намери истинското водно ниво.", "Увеличите дебита на питателната помпа докато нивото на водата достигне нормалното ниво.", "А" ,"345 ."],
[ "  За да избегнете разлив на гориво при запълване на танковете, трябва :", "Да се притвори входящият кран за да се намали дебита.", "Да се затворят отдушните тръби на танковете.", "Да не се напълват танковете повече от нивото на дъното на преливния танк.", "Да се предупреди помпената станция да намали дебита поради запълване на танковете.", "Г" ,"346 ."],
[ "  Защо преди бункероване трябва да изпразним преливния танк ?", "За да не смесваме старо с ново гориво.", "За да не го препълним.", "За да проверим за утечки.", "За по-лесно отчитане на количествата.", "Б" ,"347 ."],
[ "  При рутинна проверка в режим на UMS, дежурния механик забелязва повишено ниво в преливния танк. Какви трябва да са неговите действия?", "Спира всички трансфери и информира  главния механик.", "Измерва танка  и пресмята ще има  ли достатъчен обем до сутринта .", "Назначава на вахта моторист  за периодични замери до сутринта.", "Прехвърля трансфера към други танкове и информира гл. мех. и мостика за това.", "А" ,"348 ."],
[ "  Преди да се зацепи валоповоротното устройство трябва:", "Да се отворят индикаторните кранове и тези на въздухопуска.", "Да се прехвърли управлението на машината към местния пулт за управление.", "Да се изключи стартовия въздух  и да се отворят индикаторните кранове.", "Да се спре охлаждането.", "В" ,"349 ."],
[ "  Какви действия са наложителни при РН > 11 на котловата вода?", "Увеличаване на дозировката на химикали.", "Продухване  и подменяме част от водата до нормализиране на РН.", " Понижава се дозировката на химикали и се прави нов тест на водата след това.", " Не се прави нищо.", "Б" ,"350 ."],
[ "  Преохлаждането на кондензата е :", "Пропорционално на нарастването на ефективността на турбинната уредба.", "Изискване на техническата експлоатация за намаляне на вътрешните загуби в турбината.", "Теоретично не влияе на работата на уредбата.", "Преохлаждането е чиста загуба на топлина.", "Г" ,"351 ."],
[ "  С каква температура маслото следва да постъпва към лагерите на турбозъбния агрегат?", "35 - 45 ºС.", "45 - 55 ºС.", "25 - 35 ºС.", "55 - 65 ºС.", "А" ,"352 ."],
[ "  При колко бара разлика в налягането преди и след масления филтър на паротурбинната уредба следва той да се почиства ?", "0.5 Вar.", "0.3 Вar.", "0.1 Вar.", "1.0 Вar.", "Б" ,"353 ."],
[ "  Коя стойност на ъгъла θ /ъгъл на предварение на подаване на гориво/ наричаме оптимална?", "При който стойността на ηi / индикаторният КПД/ е максимален.", "При който стойността на  ηе  /ефективният КПД/ е максимален.", "При който стойността на ефективната мощност е максимална.", "При който стойността на механичната мощност е максимална.", "Б" ,"354 ."],
[ "  За сметка на какъв показател по-новите поколения КДВГ са по-малко чувствителни към износването на цилиндро-буталните си групи?", "По-високотехнологичните материали за изработката на ЦБГ.", "По-прецизно регулиране на параметрите на режимните натоварвания.", "Приложението на нови поколения горивни апаратури /Common rail ; EFI/.", "По-висок запас на коефициента на излишен въздух  α.", "Г" ,"355 ."],
[ "  Как ще се промени механичният КПД при повишаване на износването на цилиндро-буталната група?", "Ще намалява с увеличаване на износването.", "Ще нараства.", "Няма да се променя.", "Няма отношение към хлабините в ЦБГ.", "Б" ,"356 ."],
[ "  Кой ъгъл на предварварение на горивоподаването  θ  определяме като номинален?", "При който топлинните натоварвания са най-ниски.", "При който механичните натоварвания са най-ниски.", "Най-ниска топлинна и механична напрегнатост и при 100% натоварване КДВГ работи неограничено време като за всеки вид двигател има различна стойност.", "Най-ниска топлинна и механична напрегнатост и при 100% натоварване КДВГ работи неограничено време при максимална ефективност .", "В" ,"357 ."],
[ "  API класа на маслата отразява с букви от английската азбука:", "Вискозитета на маслата.", "Фракционния състав на маслената база.", "Пламната им точка .", "Прибавките в маслата.", "Г" ,"358 ."],
[ "  На табелката на трифазен АД е означено 230/380 V. Как ще свържем фазите на статорната му намотка  за включването му към стандартно напрежение от 380 V ?", "Паралелно.", "Последователно.", "Триъгълник.", "Звезда.", "Г" ,"359 ."],
[ "  Коя е препоръчваната, като максимално допустима, температура на метала на самите разпръсквачи на горивните клапани на КДВГ?", "180 ºС.", "220 ºС.", "550 ºС.", "120 ºС.", "А" ,"360 ."],
[ "  Коя от посочените неизправности може да бъде причина за дименето на двигателя?", "1-2 градуса по-ранно впръскване на горивото.", "1-2 градуса по-късно впръскване на горивото.", "Износена горивна помпа.", "Ниско налягане на сгъстяване Рс.", "Г" ,"361 ."],
[ "  Ако температурата на охлаждащата вода на изхода от спомагателен двигател е по-ниска от нормалната, най-вероятната причина е:", "Въздушни мехури във охлаждащата вода.", "Пропуск от спукан манифолд на изходящите газове.", "Запушване в някой от топлообменниците.", "Неправилна работа на термостатичен клапан.", "Г" ,"362 ."],
[ "  Какво ще бъде въздействието върху охлажданото със смазочно масло бутало, ако спрете маслената помпа веднага след спирането на двигателя?", "Няма да окаже влияние.", "Прегряване на буталото и коксови отлагания по охлаждаемите повърхности.", "Ще се промени пламната точка на маслото.", "Удължаване живота на уплътненията между челото и полата на буталото.", "Б" ,"363 ."],
[ "  За да се предотврати кондензиране на влагата от въздуха във въздушния охладител на ГД се препоръчва:", "Повишаване температурата на продухвателния въздух над точката на росата.", "Намаляване температурата на въздуха за добро дрениране на водата от въздушния охладител.", "Работа на двигателя с леко отворени дренажни кранове на въздушния ресивер.", "Намаляване на оборотите на двигателя.", "А" ,"364 ."],
[ "  Регулирането на производителността на ротационните горелки при парните котли се осъществява чрез:", "Промяна на оборотите на горелката.", "Промяна на проходното сечение на горивния клапан на горелката.", "Смяна на чашата на горелката.", "Нито едно от изброените.", "Б" ,"365 ."],
[ "  Oтcтpаняването на накипа на парните котли в експлоатация не се извършва чрез:", "Метода на магнитния резонанс.", "Химическо изваряване.", "Ултразвук.", "Механично почистване.", "А" ,"366 ."],
[ "  При аварийно ниско ниво на водата в парния котел автоматиката на котела: ", "Изключва горелката.", "Включва ел.захранването на питателната помпа.", "Изключва ел.захранването на питателната помпа.", "Нито едно от изброените.", "А" ,"367 ."],
[ "  Нивопоказателните стъкла на котела трябва периодично да се продухват за:", "Отстраняване на налепите по стъклото.", "Поддържане на необходимото ниво на водата в пароводния барабан.", "Вземане на проби котелна вода за анализ.", "Проверка работата на спирателните кранчета на нивопоказателното стъкло.", "А" ,"368 ."],
[ "  Нормално проба от котелната вода се взема :", "След продухване на котела.", "Преди продухване и добавяне на химикали.", "От най-ниската точка на парния колектор.", "От най-високата точка на питателната система.", "Б" ,"369 ."],
[ "  Какво е нормалното количество на нитратите в охлаждащата вода на Гл.КДВГ?", "4 000 - 5 000 РРМ.", "1 000 - 2 000  РРМ.", "2 000 - 3 000  РРМ.", "3 000 - 4 000  РРМ.", "Б" ,"370 ."],
[ "  Ако налягането в опреснителната установка се повиши:", " Увеличава се нивото на водата в него.", "Температурното ниво на водата в него намаля.", " Температурното ниво на водата  в него се увеличава.", "Количеството на разсола се повишава.", "В" ,"371 ."],
[ "  Кое е най-подходящото място за вземане на проби на масло за анализ на ДВГ?", "От нагнетателния тръбопровод на системата.", "От дренажното кранче на филтъра.", "От дренажа на маслоохладителя.", "От смукателния тръбопровод на маслената помпа.", "А" ,"372 ."],
[ "  Каква е причината картерното масло на двигателя да придобие „млечен” цвят?", "Попадане на вода в маслото.", "Попадане на гориво в маслото.", "Прегряване на маслото.", "Ниска температура на маслото.", "А" ,"373 ."],
[ "  Нивото в масления танк на главния двигател се е увеличило при положение, че не е добавяно ново масло. Какво ще предприемете?", "Не се налага предприемането на действия.", "Дрениране на част от маслото.", "Намаляване на натоварването на ГД.", "Спиране на двигателя и проверка за пропуск на гориво или вода в картера.", "Г" ,"374 ."],
[ "  Какво означава терминът „притриване” на клапана и клапанното седло?", "Ремонт чрез заваряване.", "Ремонт чрез прахово напластяване.", "Струговане на клапана.", "Припасване на клапана и седлото с цел получаване на максимална плътност между тях.", "Г" ,"375 ."],
[ "  Кой е предпочитания способ за регулиране на производителността на циркулационната кондензна помпа ?", "Промяна на оборотите на  помпата.", "Притваряне на смукателния клапан.", "Притваряне на нагнетателния  клапан.", "Рециркулация на водата.", "Г" ,"376 ."],
[ "  Колко често се проверява температурния режим на работа на главния кондензатор в съответствие с температурата на насищане на парата?", "Ежедневно.", "Ежеседмично.", "На три-четири дни.", "По нареждане на главния механик.", "В" ,"377 ."],
[ "  Съдържанието на кислород в кондензата не трябва да превишава :", "0,001 - 0,005 мг/л.", "0.05 - 0.1 мг/л.", "0.05  - 0,01 мг/л.", "0.5 - 1.0 мг/л.", "Б" ,"378 ."],
[ "  Кой от посочените методи  практически се използва за намаляне съдържанието на кислород в кондензата?", "Минимизиране преохлаждането на кондензата.", "Повишаване на вакуума в кондензатора.", "Понижаване на налягането след турбината.", "Увеличаване дебита на кондензната помпа.", "А" ,"379 ."],
[ "  Каква е периодичността на проверката на солеността на кондензата?", "Ежечасова .", "Веднъж на вахта.", "Непрекъсната.", "Ежедневна.", "В" ,"380 ."],
[ "  В какво се състои разликата  в дюзовите лопатки на парните и газовите турбини?", "Във формата на напречния профил.", "В конфигурацията на канала между лопатките.", "Във формата на надлъжния профил.", "В закрепването.", "Г" ,"381 ."],
[ "  До колко може да бъде увеличено гранично налягането на контрапарата при реверсиране на парната турбина?", "1.5 пъти.", "1.4 пъти.", "1.3 пъти.", "1.2 пъти.", "А" ,"382 ."],
[ "  За да се поддържа половинчасова готовност на турбоелектрическа паросилова уредба трябва:", "Турбините да са непрекъснато подгряти.", "Подгрева да се включва на всеки половин час.", "Да работят на празен ход.", "За половин час режима може да бъде постигнат и при неподгрята турбина.", "В" ,"383 ."],
[ "  Коя от операциите не влиза в състава на обслужването за привеждане на турбината в състояние на стоянка?", "Предпазване от повишено нагряване на лагерите по време на изстиване на турбината.", "Превъртане на ГТЗА 24 часа след спиране за 5-10 минути с включена резервна маслена помпа.", "Предпазване от деформация на оста на роторите на турбината при изстиване.", "Пълно осушаване на турбината.", "Б" ,"384 ."],
[ "  Какви действия ще предприемем при вибрации на турбината при ускоряване на кораба?", "Намаляме натоварването до минимално и прислушваме лагерните възли.", "Ускоряваме по-бързо за да преминем през тези обороти.", "Намаляваме до изчезване на вибрациите и след 5 до 10 минути ускоряваме отново, но по- плавно.", "Незабавно спираме .", "Г" ,"385 ."],
[ "  Кое условие следва да бъде изпълнено за да бъде ротора динамично балансиран?", "Маховите моменти, приведени към надлъжната и към напречната ос да бъдат сумарно равни на нула.", "Необходимо е моментът от центробежните сили да е колкото може по-голям.", "Необходимо е моментът от центробежните сили да е колкото може по-малък.", "Необходимо е първата критична скорост да бъде равна на нула.", "В" ,"386 ."],
 
]; 

var questionOrder = []; 
var maxNumberOfQuestions = questions.length;  // do NOT make BIGGER than number of 'questions' array 
function setmaxNumberOfQuestions() { 
   maxNumberOfQuestions = 60;
}
// var maxNumberOfQuestions = 2;  // do NOT make BIGGER than number of 'questions.length' array 
var maxNumberOfQuestions2 = questions.length;
function setQuestionOrder() { 
  questionOrder.length = 0; 
  for (var i=0; i<maxNumberOfQuestions2; i++) { questionOrder.push(i); } 
 //questionOrder.sort(randOrd);   // alert(questionOrder);  // shuffle display order 
  pos = document.getElementById("numb").value-1;  posn = questionOrder[pos]; 
} 

function setQuestionOrder2() { 
  questionOrder.length = 0; 
  for (var i=0; i<maxNumberOfQuestions2; i++) { questionOrder.push(i); } 
  questionOrder.sort(randOrd);   // alert(questionOrder);  // shuffle display order 
  pos = 0;  posn = questionOrder[pos]; 
} 


function $_(IDS) { return document.getElementById(IDS); } 
function randOrd() { return (Math.round(Math.random())-0.5); } 
function renderResults(){ 
  var test = $_("test"); 
 test.innerHTML = "<h2>Имате "+correct+" от "+maxNumberOfQuestions+" правилно отговорени въпроси</h2>"; 
  test.innerHTML +=  +(correct/maxNumberOfQuestions*100).toFixed(0)+'% правилни отговори<br>';
  $_("test_status").innerHTML = "Приключихте теста"; 
  $_('timeleft').innerHTML = ' '; 
  test.innerHTML += "<br><img src='images/curies.gif' align='bottom' width='500' height='247' alt='Lubopitko'><br><br>";
  test.innerHTML += "<button  class= 'button' onclick='location.reload()'>Повторете теста</button>"; 
  
 
  setQuestionOrder(); 
  correct = 0; 
  clearInterval(myVar); 
  return false; 
} 




function renderQuestion() { 
  var test = $_("test"); 
  $_("test_status").innerHTML = "Въпрос "+(pos+1)+" от "+maxNumberOfQuestions; 
  //if (rscore != 0) { $_("test_status").innerHTML += '<br>Текущ въпрос: '+(correct/rscore*100).toFixed(0)+'% правилни отговори'; } 
   if (rscore != 0 && correct == 1 && maxNumberOfQuestions != 60) { $_("test_status").innerHTML += '<br>Имате '+correct+' правилeн отговор'; }
    if (rscore != 0 && correct > 1 && maxNumberOfQuestions != 60) { $_("test_status").innerHTML += '<br>Имате '+correct+' правилни отговора'; } 
  var question = questions[posn][0]; 
  var chA = questions[posn][1]; 
  var chB = questions[posn][2]; 
  var chC = questions[posn][3];
  var chD = questions[posn][4];
  var chЕ = questions[posn][6];
  if (maxNumberOfQuestions != 60) { test.innerHTML = "<h3>"+chЕ+question+"</h3>"; } 
  else  {test.innerHTML = "<h3>"+question+"</h3>"}; 
  test.innerHTML += "<label><input type='radio' name='choices' value='А'> А) "+chA+"</label><br>"; 
  test.innerHTML += "<label><input type='radio' name='choices' value='Б'> Б) "+chB+"</label><br>"; 
  test.innerHTML += "<label><input type='radio' name='choices' value='В'> В) "+chC+"</label><br>"; 
  test.innerHTML += "<label><input type='radio' name='choices' value='Г'> Г) "+chD+"</label><br><br><br><br>";
   
  test.innerHTML += "<button  id='btn3'  class= 'button' onclick='checkAnswer3()'>Назад</button>"
  test.innerHTML += "<button  id='btn1' class= 'button' onclick='checkAnswer()'>Напред</button><br><br>";
  test.innerHTML += "<button id='btn2'  class= 'button' onclick='checkAnswer2()' >Верен отговор</button>" ;
  ;
}
  //  setupTimer();  // for indivisible timer for each question
  function setupTimer() {
  timelimit = maxtimelimit; 
  clearInterval(myVar); 
  startTimer(); 
} 

function checkAnswer2(){ 
	//var answer = $_GET("answer");
	//var btn = $_GET("check");
	var choices = document.getElementsByName("choices"); 
  for (var i=0; i<choices.length; i++) { 
    if (choices[i].checked) { choice = choices[i].value; } 
  } 
	rscore++; 
	if (choice == questions[posn][5] || choice != questions[posn][5]){
		btn1.style.visibility="hidden";
		btn2.style.visibility="hidden";
		btn3.style.visibility="hidden"
		answer.style.visibility="visible";
		answer.innerHTML = "<h3>Правилен отговор: "+questions[posn][5] +"<br></h3>";
		answer.innerHTML += "<button class= 'button'  onclick='proceed()'>Продължи</button>"; 
		}
	} 

function proceed() {
	//var answer = $_GET("answer");
	//var btn = $_GET("check");
	answer.style.visibility="hidden";
	btn1.style.visibility="visible";
	btn2.style.visibility="visible";
	btn3.style.visibility="visible";
	pos++;  posn = questionOrder[pos];
	if (pos < maxNumberOfQuestions) { renderQuestion(); } else { renderResults(); } 
	}

function checkAnswer3(){ 
  var choices = document.getElementsByName("choices"); 
  for (var i=0; i<choices.length; i++) { 
    if (choices[i].checked) { choice = choices[i].value; } 
  } 
  rscore++; 
  if (choice == questions[posn][5] && timelimit > 0) { correct--; } 
  pos--;  posn = questionOrder[pos]; 
  if (pos < maxNumberOfQuestions) { renderQuestion(); } else { renderResults(); } 
} 

function checkAnswer(){ 
  var choices = document.getElementsByName("choices"); 
  for (var i=0; i<choices.length; i++) { 
    if (choices[i].checked) { choice = choices[i].value; } 
  } 
  rscore++; 
  if (choice == questions[posn][5] && timelimit > 0) { correct++; } 
  pos++;  posn = questionOrder[pos]; 
  if (pos < maxNumberOfQuestions) { renderQuestion(); } else { renderResults(); } 
} 

window.onload = function() { 
  Start() ;
    // for total time for entire quiz
} 