function getOption() {
    var obj = document.getElementById("mySelect");
	if (obj.options[obj.selectedIndex].value == "A") {  Learn() };
	if (obj.options[obj.selectedIndex].value == "B") { Exam() };
};

function Start(){

	java.style.display="none";
	numb.style.display="none";
	btn4.style.display="none";
	test_status.style.display="none";
	timeleft.style.display="none";
	test.style.display="none";
};
function Learn() {
	form1.style.display="none";
	setFirstQuestion();
	
	};
	
	function Exam() {
		
	form1.style.display="none";
	test_status.style.display="block";
    test.style.display="block";
	timeleft.style.display="block";
	
	setmaxtimelimit() ;
	setmaxNumberOfQuestions();
	setQuestionOrder2(); 
    renderQuestion(); 
    setupTimer();
	};
	
function setFirstQuestion() {
    var x, text;

    // Get the value of the input field with id="numb"
    x = document.getElementById("numb").value;

    // If x is Not a Number or less than one or greater than 10
    if (isNaN(x) || x < 1 || x > maxNumberOfQuestions2) {
        text = "<h5>Въведете стойност между 1 и "+maxNumberOfQuestions+"</h5>";
		
		java.style.display="block";
	numb.style.display="inline";
	btn4.style.display="inline";
		
		
		
    } else {
        text = "Input OK";
		test_status.style.display="block";
		test.style.display="block";
		//timeleft.style.visibility="visible";
		java.style.display="none";
	numb.style.display="none";
	btn4.style.display="none";
	demo.style.display="none";
		setQuestionOrder(); 
        renderQuestion(); 
		//setupTimer();
    }
    document.getElementById("demo").innerHTML = text;
}


var myVar; 
function startTimer() { 
  myVar = setInterval(function(){myTimer()},1000); 
  timelimit = maxtimelimit; 
} 

function myTimer() { 
  if (timelimit > 0) { 
    curmin=Math.floor(timelimit/60); 
    cursec=timelimit%60; 
    if (curmin!=0) { curtime="остават "+curmin+" минути и "+cursec+" секунди"; } 
              else { curtime="остават "+cursec+" секунди"; } 
    $_('timeleft').innerHTML = curtime; 
  } else { 
    $_('timeleft').innerHTML = timelimit+' - Просрочихте времето - няма да получите точки за този отговор'; 
 //clearInterval(myVar); 
    //checkAnswer(); 
	renderResults()
	{   
  $_("test_status").innerHTML = "Просрочихте времето. Приключихте теста"; 
} ;
  } 
  timelimit--; 
}   



var pos = 0, posn, choice, correct = 0, rscore = 0; 
var maxtimelimit = 6000, timelimit = maxtimelimit;  // 20 seconds per question 
function setmaxtimelimit() { 
   maxtimelimit = 3600;
}




var questions = [ 
 [ "  Посочете кое е условното означение на въздушното отношение:", "Ε.",  "η.", "Α.", "Ω.","В", "1 ."],
[ "  Какво разбираме под теоретически необходимо количество въздух?", "Максималното количество въздух необходимо за изгарянето на единица гориво.", "Минималното количество въздух необходимо за изгарянето на единица гориво.", "Реалното количество въздух постъпил в цилиндъра на двигателя.", "Максималното количество въздух постъпил в цилиндъра на двигателя.","Б", "2 ."],
[ "  Еднакво ли е теоретически необходимото количество въздух за изгарянето на единица дизелово и бензиново гориво?", "Не, защото горивата имат различни калоричности.", "Да, еднакво е.", "Теоретически необходимото количество въздух зависи само от габаритите на горивната камера.", "Зависи от конструкцията на ДВГ.","А","3 ."],
[ "  Когато въздушното отношение е по-голямо от числото 2, гориво-въздушната смес е:", "Богата.", "Бедна.", "Нормална.", "Средна.","Б","4 ."],
[ "  В какви граници трябва да се движи коефициента на излишен въздух при дизеловите бавнооборотни КДВГ?", "Α = 2,2 – 2,8.", "Α = 0,2 – 3,1.", "Α = 1,8 – 2,2.", "Нито едно от изброените.","Б","5 ."],
[ "  Как се определя коефициента на излишен въздух на даден КДВГ при топлинното му пресмятане?", "Задава се предварително.", "Променя се непрекъснато по зададена формула.", "Променя се в зависимост от изчисленията.","Нищо от изброените.", "А" , "6 ."],
["   Мощността измерена непосредствено в цилиндъра на КДВГ се нарича:", "Индикаторна.", "Полезна.", "Ефективна.", "Механична.", "А","7 ."],
[ "  Мощността на КДВГ измерена на коляновия вал се нарича:", "Ефективна.", "Механична.", "Индикаторна.", "Теоретична.","А" , "8 ."],
[ "  Зависи ли мощността на КДВГ от диаметъра на цилиндъра?", "Да.", "Не.", "Само при двутактови КДВГ.", "Зависи от конструкцията на ДВГ.", "А" , "9 ."],
[ "  Индикаторният коефициент на полезно действие на КДВГ ни дава информация за:", "Начина за изгаряне на горивото.", "Степента на съвършенство на процеса.", "Степента на сгъстяване на работното тяло.", "Калоричността на горивото.", "Б" , "10 ."],
[ "  Зависи ли индикаторния КПД от мощността на КДВГ?", "Не.", "Да.", "Зависи от режима на работа на КДВГ.", "Зависи от конструкцията на КДВГ.", "А" ,"11 ."],
[ "  Топлинните и механичните загуби на КДВГ се отчитат от:", "Ефективният КПД.", "Механичният КПД.", "Пълният КПД.", "Термичният КПД.", "В" , "12 ."],
[ "  Количеството гориво изразходвано от КДВГ за единица време на единица мощност се нарича:", "Специфичен разход на гориво.", "Ефективен разход на гориво.", "Полезен разход на гориво.", "Пълен разход на гориво.", "А","13 ."],
[ "  Диаметърът на цилиндъра и хода на буталото са ....................... размери при КДВГ.", "Основни.", "Главни.", "Препоръчителни.", "Класови.","А", "14 ."],
[ "  Отношението S/D в cm означава дали КДВГ е:", "Бързоходов или бавноходов.", "Двутактов или четиритактов.", "Тронкови или кръстоглавен.","Дългоходов или не.","А" ,"15 ."],
[ "  Горивата използвани в КДВГ биват:", "Леки и тежки дизелови горива.", "Керосин.", "Нискотемпературни горива.", "Високотемпературни гори","А","16 ."],
[ "  КДВГ с мокър картер показва:", "Мощността на двигателя.", "Конструктивните особенности на двигателя.", "Мястото на съхраняване на маслото.", "Нито едно от изброените.","В" ,"17 ."],
[ "  При маслена система на КДВГ с мокър картер налягането на маслото в системата обикновено е:", "7 - 10 MPa.", "1,5 - 2 кг/см2.", "1 - 3 MPa.", "3 - 6 Bar.","Г" ,"18 ."],
[ "  В маслена система за високо налягане на КДВГ броя на маслените помпи най-често е:", "Два пъти по-малък от броя на цилиндрите на КДВГ.", "Няма изисквания за броя им.", "Равен на броя на цилиндрите на КДВГ.", "Два пъти по-голям от броя на цилиндрите на КДВГ.","Б" ,"19 ."],
[ "  Помпите в маслената система за високо налягане на КДВГ се наричат:", "Лубрикаторни.", "Байпасни.", "Нямат определено име.", "Цилиндрови.","А" ,"20 ."],
[ "  Основните лагери на КДВГ се смазват от маслената система чрез:", "Филтриране.", "Утаяване, филтриране, сепариране.", "На самотек.", "Под налягане.","Г" ,"21 ."],
[ "  Начините за очистване на маслото в корабни условия са:", "Филтриране.", "Филтриране, сепариране.", "Утаяване, сепариране.", "Всяко едно от изброените.","Г" ,"22 ."],
[ "  Температурата на маслото в маслена система ниско налягане на кръстоглавен КДВГ е:", "35-60 &#8451.", "55-65 &#8451.", "78-95 &#8451.", "Не е определена.","А" ,"23 ."],
[ "  Маслените филтри на КДВГ се:", "Байпасират.", "Дублират.", "Няма изисквания към тях.", "Нито едно от изброените.","Б" ,"24 ."],
[ "  Предназначението на сепараторите в маслена система на КДВГ е:", "Да почистват маслото от механични примеси.", "Да почистват маслото от вода.", "Да почистват маслото от вода и механични примеси.", "Да почистват маслото от емулсии.","В" ,"25 ."],
[ "  Наличието на вода в маслото в системата на КДВГ води до:", "Образуването на емулсии.", "Образуването на хомогенна смес.", "Образуването на колоиден разтвор.", "Образуването на наситен разтвор.","А" ,"26 ."],
[ "  Задължителна ли е лубрикаторната система за кръстоглавни Гл.КДВГ?", "Не.", "Да.", "Само за КДВГ с мощност над 5 000 kW.", "Само за КДВГ с мощност над 10 000 kW.","Б" ,"27 ."],
[ "  Предназначението на лубрикаторната помпа в КДВГ е:", "Да подава масло в цилиндъра на дозирани порции.", "Да подава непрекъснато масло.", "Да подава масло само при спиране на КДВГ.", "Да подава масло при необходимост.","А" ,"28 ."],
[ "  Лубрикаторната помпа при кръстоглавен КДВГ е вид:", "Бутална помпа.", "Винтова помпа.", "Центробежна помпа.", "Хидравлична помпа.","А" ,"29 ."],
[ "  Телескопичната връзка при някои кръстоглавни КДВГ служи за:", "Отвеждане на маслото охлаждащо буталата на КДВГ.", "Подаване на маслото охлаждащо буталата на КДВГ.", "Подаване и отвеждане на маслото охлаждащо буталата на КДВГ.", "Подаване и отвеждане на маслото охлаждащо КДВГ.","Б" ,"30 ."],
[ "  Кога се подава сгъстен въздух в цилиндъра при пускане на Гл.КДВГ?", "В началото на процеса разширение.", "В края на процеса разширение.", "В началото на процеса сгъстяване.", "Преди края на процеса сгъстяване.","А" ,"31 ."],
[ "  Каква е организацията на подаване на сгъстен въздух при пускането на КДВГ?", "Едновременно във всички цилиндри.", "Последователно по реда на работата на цилиндрите.", "Няма значение, цели се бързо повишаване на налягането в цилиндъра.", "Последователно по номера на цилиндрите.","Б" , "32 ."],
[ "  Пускат ли се четиритактовите КДВГ със сгъстен въздух?", "Да.", "Не.", "Само с електростартер.", "Само четиритактови с голяма мощност.","А" ,"33 ."],
[ "  В кой момент от пускането на КДВГ се подава гориво?", "Едновременно с подаването на въздуха.", "След първоначалното завъртане на коляновия вал на ДВГ.", "Посочените по-горе отговори са грешни.", "А) и Б)","Б" , "34 ."],
[ "  Кой механизъм управлява отварянето на пусковите клапани на КДВГ?", "Електростартер.", "Пусков клапан.", "Въздухоразпределител.", "Въздушен стартер.","В" ,"35 ."],
[ "  Завъртането на коляновия вал на ДВГ ръчно или с валозавъртащо устройство има за цел:", "Да създаде начален въртящ момент на коляновия вал.", "Да осигури влизането на пусков въздух в един от цилиндрите.", "Да създаде маслен клин в основните лагери на коляновия вал.", "Нито едно от изброените.","В" , "36 ."],
[ "  Предназначението на въздухоразпределителя на КДВГ е:", "Да осуши подавания към цилиндрите сгъстен въздух.", "Да редуцира налягането на подавания към цилиндрите въздух.", "Да определи момента на подаване на въздуха към пусковите клапани.", "Да контролира налягането на подавания към цилиндрите въздух.","В" ,"37 ."],
[ "  Какъв е броя на пусковите клапани в КДВГ?", "Еднакъв с броя на цилиндрите на КДВГ.", "Един повече от броя на цилиндрите на КДВГ.", "Един по-малко от броя на цилиндрите на КДВГ.", "Не се определя.","А" , "38 ."],
[ "  Задължителен елемент ли е главния пусков клапан в пусковата система на КДВГ?", "Да.", "Не.", "Само при двутактови кръстоглавни КДВГ.", "Само при четиритактови КДВГ.","А" ,"39 ."],
[ "  Свързването на пусковата система с бутилките със сгъстен въздух при КДВГ се осъществява чрез:", "Главно разпределително табло.", "Щуцерна връзка.", "Главен пусков клапан.", "Главен маневрен клапан.","В" , "40 ."],
[ "  Реверсирането на КДВГ се налага при:", "Промяна посоката на въртене на гребния винт.", "Преминаването на КДВГ в неустановени режими на работа.", "Стабилизиране работата на КДВГ при ниски обороти.", "Нито едно от изброените.","А" ,"41 ."],
[ "  Какво трябва да променим при реверсиране на КДВГ?", "Момента на горивоподаване и фазите на газообмен.", "Посоката на въртене на коляновия вал на КДВГ.", "Налягането на пусковия въздух.", "Посоката на въртене на разпределителния вал на КДВГ.","А" , "42 ."],
[ "  Четиритактовите КДВГ реверсивни ли са?", "Да.", "Не.", "Само четиритактовите V-образни двигатели.", "Само четиритактовите редови двигатели.","А" ,"43 ."],
[ "  Какво е предназначението на блокиращите устройства в реверсивната система на КДВГ?", "Изключването на възможността от неверни действия.", "Осигуряване на пусков въздух в системата.", "Регулиране на пусковите обороти на КДВГ.", "Осигуряване на контролен въздух в системата.","А" , "44 ."],
[ "  Главният пускови клапан на КДВГ е елемент на:", "Пусковата система на КДВГ.", "Реверсивната система на КДВГ.", "Системата за пневмоуправление на КДВГ.", "Въздушната система на КДВГ.","А" ,"45 ."],
[ "  Чрез кой елемент от пусковата система се осъществява повторен пуск на КДВГ при отворени бутилки със сгъстен въздух?", "Главен пусков клапан.", "Пускови клапани.", "Въздухоразпределител.", "Главен маневрен клапан.","А" , "46 ."],
[ "  При каква минимална температура в машинното отделение може да се стартира пускането на Гл.КДВГ?", "7 &#8451.", "15 &#8451.", "18 &#8451.", "Няма такова изискване.","Г" ,"47 ."],
[ "  Как се осъществява принудителната циркулация в корабните парни котли / КПК /?", "Чрез байпасиране на парните тръбопроводи.", "С помпа въртяща водата и пароводната смес в парния котел.", "Използва се разликата в температурата на парата.", "Няма такава циркулация при котлите.","Б" , "48 ."],
[ "  КПК които имат собствена горивна камера се наричат:", "Автономни.", "Утилизационни.", "Спомагателни.", "Самостоятелни.","А" ,"49 ."],
[ "  Показателя който характеризира натоварването на котела в условията на експлоатация се нарича:", "Номинален праг на котела.", "Кратност на котела.", "Паропроизводителност.", "Праг на натовареност.","В" , "50 ."],
[ "  Кои са основните параметри на произведената от КПК пара?", "Температура и работно налягане.", "Работен обем и температура.", "Енталпия на парата.","Ентропия на парата.","А" ,"51 ."],
[ "  Количеството топлина, въведено за нагряване, изпарение на водата и прегряване на парата за единица време се нарича:", "Енталпия на котела.", "Ентропия на котела.", "Топлопроизводителност на котела.", "Кратност на котела.","В" , "52 ."],
[ "  Как се измерва топлопроизводителността на котела?", "Като се тарира калоричността на горивото.", "Като мощност изразена в топлинни единици.","За показател служи долната калоричност на горивото.", "За показател служи горната калоричност на горивото.","Б" ,"53 ."],
[ "  Отношението на количеството полезно използвана в котела топлина, което се определя при пълното изгаряне на изразходеното за този интервал от време гориво се нарича:", "Коефициент на полезно действие.", "Механичен коефициент на полезно действие.", "Специфичен разход на гориво.", "Пълен разход на гориво.","А" , "54 ."],
[ "  Отношението на количеството на водата, която преминава през контура, към паропроизводителността на котела за определен интервал от време се нарича:", "Циркулация на котела.", "Кратност на котела.", "Паропроизводителност.", "Топлопроизводителност на котела.","Б" ,"55 ."],
[ "  Какво се получава при нарушена циркулация на водата в КПК?", "Разрушаване на тръбните снопове.", "Разрушаване на тръбните дъски.", "Повишаване на паропроизводителността на котела.", "Повишаване на кратността на котела.","А" , "56 ."],
[ "  Какво е предназначението на екранните тръби във водотръбния КПК?", "Да осигуряват необходимо количество въздух в горивната камера.", "Да използват ефективно топлината на горивния факел.", "Има такива тръбопроводи само при газотръбните КПК.", "Да намалят отлаганията в котела.","Б" ,"57 ."],
[ "  Какво показва кратността на парата в КПК?", "Броя на превръщанията на водата в пара.", "Броя на превръщанията от мокра в суха пара.", "Няма такъв показател.", "Броя на превръщанията от суха в прегрята пара.","А" , "58 ."],
[ "  Въвеждането на допълнителен контур в парния котел се прави с цел:", "Да се подобрят процесите на газообмен.", "Да се намали влиянието на качеството на водата върху работата на котела.", "Да се подобри циркулацията на водата в котела.", "Да се подобрят процесите на горене.","Б" ,"59 ."],
[ "  В газотръбните КПК изгорелите газове се движат по:", "Димогарни тръби.", "Конвективни тръби.", "Екранни тръби.", "Топлообменни тръби.","А" , "60 ."],
[ "  С каква циркулация са газотръбните котли?", "Принудителна.", "Естествена.", "Многократна.", "Двукратна.","Б" ,"61 ."],
[ "  Котлите които използуват топлината на изгорелите газове на КДВГ се наричат?", "Многоконтурни.", "Газотръбни.", "Утилизационни.", "Димогарни.","В" , "62 ."],
[ "  Какво се получава ако рязко се намали налягането на водата в котела?", "Водата мигновенно се изпарява, получава се динамичен удар и взрив в котела.", "Водата намалява обема и температурата си, циркулацията и е затруднена.", "Горивният процес в камерата на КПК спира.", "Водата увеличава обема и температурата си.","А" ,"63 ."],
[ "  Кои котли имат при равни показатели най-голяма паропроизводителност?", "Водотръбните.", "Утилизационните.", "Газотръбните.", "Комбинираните.","В" , "64 ."],
[ "  Мястото в което се събира и разпределя по нагревните тръби вода, пара и пароводна смес се нарича:", "Икономайзер.", "Колектор.", "Разпределител.", "Смесител.","Б" ,"65 ."],
[ "  Системата в котела чрез която се изхвърлят излишните соли от котела се нарича:", "Система за продухване.", "Система за дрениране.", "Система за байпасиране.", "Система за очистване.","А" , "66 ."],
[ "  С какво се закрепват КПК за корпуса на кораба?", "С клинове.", "С подвижни и неподвижни опори.", "С болтови връзки и амортисъори.", "С греди и опори.","Б" ,"67 ."],
[ "  Къде се монтират допълнителните нагревни повърхности в КПК?", "След изпарителните нагревни повърхности.", "В горивната камера на котела.", "В димоходите на котела.", "Нито едно от изброените.","А" , "68 ."],
[ "  Допълнителната нагревна повърхнина, в която става подсушаване и прегряване на наситената пара се нарича:", "Допълнителна нагревна повърхност.", "Икономайзер.", "Пароподгреватал.", "Пароподсушител.","В" ,"69 ."],
[ "  Парните турбини произвеждат механична енергия използвайки:", "Кинетичната енергия на парата.", "Максималното налягане на парата.", "Максималната температура на парата.", "Топлината на парата.","А" , "70 ."],
[ "  Апаратите за ускоряване на парата в парните турбини се наричат:", "Работни колела.", "Дюзови апарати.", "Направляващи апарати.", "Направляващи колела.","Б" ,"71 ."],
[ "  Според направлението на парния поток парните турбини се делят на:", "Еднокорпусни, многокорпусни.", "Аксиални /осови /, радиални.", "Едностепенни, многостепенни.", "Реактивна.","Б" , "72 ."],
[ "  Парни турбини при които преработването на разполагаемия топлинен пад за дадена степен става приблизително по равно в дюзите и в работните лопатки се наричат:", "Активни турбини.", "Реактивни турбини.", "Многостъпални турбини.", "Активно-радиални.","Б" ,"73 ."],
[ "  За да се получи механична работа на работното колело на парната турбина е необходимо парата от дюзите:", "Да бъде наситена пара.", "Да изтича с висока абсолютна скорост.", "Да бъде ненаситена пара.", "Да бъде суха пара.","Б" , "74 ."],
[ "  При коя степен на парната турбина скоростта на изтичане на парата е по-голяма:", "При активната степен.", "При реактивната степен.", "При многостъпалната турбина.", "Скоростта не зависи от степента.","А" ,"75 ."],
[ "  Добавъчната сила действуваща на работните лопатки се получава като:", "Разлика на наляганията пред и след лопатката.", "Сумата от наляганията преди и след лопатката.", "Това е силата получена от налягането в края на лопатките.", "Това е силата получена от скоростта в края на лопатките.","А" , "76 ."],
[ "  При разширение на парата в каналите на лопатките на парната турбина се получава:", "Намаляване на кинетичната енергия.", "Нарастване на кинетичната енергия.", "Повишаване на потенциалната енергия.", "Повишаване на топлинната енергия.","Б" ,"77 ."],
[ "  Статорът на парната турбина е:", "Неподвижна част на турбината.", "Подвижна част на турбината.", "Направляваща част на турбината.", "Уплътняваща част на турбината.","А" , "78 ."],
[ "  Парни турбини задвижващи гребния вал се наричат:", "Спомагателни.", "Главни.", "Многостъпални.", "Турбина на Къртис.","Б" ,"79 ."],
[ "  При еднакви масо-габаритни показатели, кои парни турбини имат по-висока мощност?", "Активните турбини.", "Многостъпалните турбини.", "Реактивните турбини.", "Аксиалните турбини.","А" , "80 ."],
[ "  При еднакви масо-габаритни показатели, кои парни турбини имат по-висок коефициент на полезно действие?", "Активните турбини.", "Реактивните турбини.", "Многостъпалните турбини.", "Радиалните турбини.","Б" ,"81 ."],
[ "  Предимството на парните турбинни уредби пред дизеловите уредби е:", "По-ниското ниво на шум и по-голям моторесурс.", "По-малкият разход на гориво.", "Това, че са реверсивни.", "По-малък обслужващ персонал.","А" , "82 ."],
[ "  Тялото на главните парни турбини се изработва винаги с:", "Вертикална равнина на разглобяване.", "Хоризонтална равнина на разглобяване.", "Няма такова изискване.", "Смесена равнина на разглобяване.","Б" ,"83 ."],
[ "  Тялото на турбината се закрепва към корабния фундамент с:", "Подвижни и неподвижни опори.", "Фланцева връзка.", "Заварява се.", "С клинове и подложки.","А" , "84 ."],
[ "  Газовата турбина има ли аксиално-радиален лагер/ упорен / както при КДВГ?", "Да, има.", "Само турбините с малка мощност имат.", "Не, няма.", "Само турбините с много голяма мощност.","А" ,"85 ."],
[ "  Дюзовите кутии са елемент на газовата турбина, които са закрепени:", "За направляващият апарат на турбината.", "За тялото на турбината.", "Между пръстеновидните канали на турбината.", "За диафрагмата на турбината.","Б" , "86 ."],
[ "  Диафрагмите при турбините представляват:", "Вътрешни прегради в тялото на турбината.", "Оребряване на дюзовия апарат.", "Подвижна опора на газовата турбина.", "Оребряване на направляващия апарат.","А" ,"87 ."],
[ "  Предназначението на лабиринтовото уплътнение при парна турбина е да:", "Да насочи парата към лопатките.", "Намали пропуските на пара между диафрагмата и вала.", "Лагерна връзка.", "Да насочи парата към дюзовия апарат.","Б" , "88 ."],
[ "  Лопатъчният апарат на парна турбина се състои от:", "Направляващи и работни лопатки.", "Диафрагма и дюзов апарат.", "Лабиринтови хлабини и уплътнения.", "Диафрагма и направляващи лопатки.","А" ,"89 ."],
[ "  Направляващите лопатки на парна турбина са неподвижни лопатки и са закрепени за:", "Ротора на турбината.", "Тялото на турбината.", "За неподвижни опори към ротора на турбината.", "За диафрагмата на турбината.","Б" , "90 ."],
[ "  Напречното сечение на лопатката на парна турбина през работната и част се нарича:", "Основа на лопатката.", "Сечение на лопатката.", "Профил на лопатката.", "Работно сечение.","В" ,"91 ."],
[ "  При кои лопатки при парните турбини профилът им е почти симетричен?", "Реактивните лопатки.", "Активните лопатки.", "Симетричните лопатки.", "Активно-реактивните лопатки.","А" , "92 ."],
[ "  Какво се прави със входящият ръб на лопатките на парни турбини, за да се повиши корозионната и ерозионна им устойчивост и се намалят загубите при входа на каналите?", "Лопатките се правят се симетрични.", "Бандажират се.", "Входящият ръб на лопатките се закръгля.", "Обработват се със специални покрития.","В" ,"93 ."],
[ " Бандажирането на лопатките при парните турбини в горната им част има за задача:", "Да се подобрят механичните качества на венеца.", "Да се намалят колебанията и повиши здравината на венеца.", "Да регулира оборотите на венеца.", "Да се повиши КПД на лопатките.","Б" , "94 ."],
[ " Уплътненията, които се използуват в парните турбини са:", "Лабиринтни, с графитни пръстени.", "Гумени, метални.", "Стъклена вата, пластмаси.", "Полимерни.","А" ,"95 ."],
[ " Лагерите които поемат всички радиални сили на ротора и служат за центроване на ротора към тялото на турбината се наричат:", "Радиални лагери.", "Осови лагери.", "Плъзгащи лагери.", "Аксиални лагери.","А" , "96 ."],
[ " За избора на лагери на парната турбина се прави предварително пресмятане съгласно:", "Топлопренасянето.", "Термодинамичните натоварвания.", "Хидродинамичната теория на мазането.", "Температурата на парата.","В" ,"97 ."],
[ " Кога един основен лагер на парна турбина работи нормално?", "Когато се смазва непрекъснато с предписаната марка масло и има необходимата маслена хлабина.", "Когато оборотите на турбината са постоянни.", "Когато натоварването е постоянно.", "Когато се смазва непрекъснато с предписаната марка масло и маслената хлабина е малка.","А" , "98 ."],
[ " Качествено регулиране на парната турбина имаме когато:", "Намалим паропроизводителността на котела.", "Променим количеството подавана пара към турбината чрез притваряне на главния маневрен клапан.", "Увеличим паропроизводителността на котела.", "Увеличим температурата на парата.","Б" ,"99 ."],
[ "  Парната турбина реверсивна машина ли е?", "Само главните парни турбини.", "Не e реверсивна.", "Само спомагателните парни турбини.", "Само спомагателните парни турбини с голяма мощност.","Б" , "100 ."],
[ "  Къде приоритетно се развива кислородната корозия в КПК:", "В областта на паропрегревателя.", "На входните участъци на питателния тракт.", "Във водния колектор.", "На входните участъци на водния икономайзер.","Б" ,"101 ."],
[ "  Какво характеризира белия дим от димохода на КПК:", "Оптимален горивен процес.", "Подаване на значително по-голямо количество въздух от необходимото в пещта на котела или пробив в нагревната повърхност на котела.", "Прекалено висока температура на горивото.", "Прекалено ниска температура на горивото.","Б" , "102 ."],
[ "  Върху кои процеси в КПК оказва влияние реакцията на котелната вода:", "Върху накипообразуването.", "Върху активността на корозионите процеси.", "Върху накипообразуването и активността на корозионните процеси.", "Не оказва влияние.","В" ,"103 ."],
[ "  Средното индикаторно налягане при ранно подаване на горивото за един съвременен главен корабен двигател:", "Нараства.", "Намалява.", "Не се променя.", "Нищо от изброеното.","А" , "104 ."],
[ "  Средното индикаторно налягане при късно подаване на горивото за един съвременен главен корабен двигател намалява толкова колкото намалява:", "Индикаторния КПД.", "Ефективния КПД.", "Механичния КПД.", "Нищо от изброеното.","А" ,"105 ."],
[ "  Средното индикаторно налягане при ранно подаване на горивото за един съвременен главен корабен двигател нараства толкова колкото нараства:", "Индикаторния КПД.", "Ефективния КПД.", "Механичния КПД.", "Нищо от изброеното.","А" , "106 ."],
[ "  Средното индикаторно налягане при ранно подаване на горивото за един съвременен главен корабен двигател нараства с толкова с колкото намалява:", "Индикаторния специфичен разход на гориво.", "Ефективния специфичен разход на гориво.", "Механичния КПД.", "Нищо от изброеното.","А" ,"107 ."],
[ "  Средното индикаторно налягане при късно подаване на горивото за един съвременен главен корабен двигател намалява с толкова с колкото нараства:", "Индикаторния специфичен разход на гориво.", "Ефективния специфичен разход на гориво.", "Механичния КПД.", "Нищо от изброеното.","А" , "108 ."],
[ "  Средното индикаторно налягане при късно подаване на горивото за един съвременен главен корабен двигател:", "Нараства.", "Намалява.", "Не се променя.", "Нищо от изброеното.","Б" ,"109 ."],
[ "  При процеса сгъстяване при движението си към ГМТ температурата на работното тяло в КДВГ се:", "Повишава.", "Понижава.", "Изменя се в зависимост от показателя на политропата на сгъстяване.", "Не се изменя.","А" , "110 ."],
[ "  Кога започва действителното сгъстяване при четиритактовите КДВГ?", "В момента на отварянето на смукателния клапан.", "Когато буталото достигне ГМТ.", "След затварянето на смукателния клапан.", "След затварянето на изпускателния клапан.","В" ,"111 ."],
[ "  Защо степента на сгъстяване “ε” в КДВГ не бива да бъде по-висока от 18-20?", "Намаляват механичните загуби.", "Подобрява се качеството на газообмена.", "Увеличават се механичните загуби.", "Намаляват топлинните загуби.","В" , "112 ."],
[ "  Посочете кое е вярното определение на процеса горене?", "Химична реакция на окисляване на съединенията съдържащи се в горивото при което се отделя огромно количество топлина.", "Физични промени на промяна на агрегатното състояние на горивото при което се отделя значително количество топлина.", "Ендотермична реакция в присъствието на катализатори при което се отделя топлина.", "Екзотермична реакция в присъствието на катализатори.","А" ,"113 ."],
[ "  В какво се изразява елементарния състав на горивото?", "Милиграма.", "Килокалории.", "Масови единици.", "Килограма.","В" , "114 ."],
[ "  Посочете кои са основните елементи на дизеловите горива?", "Въглерод / С /, водород / Н /, кислород / О<sub>2</sub> /, азот / N<sub>2</sub> /, сяра / S /.", "Въглерод / С /, водород / Н<sub>2</sub> /, кислород / О<sub>2</sub> /, натриева основа, сярна киселина, сажди.", "Въглерод / С /, водород / Н<sub>2</sub> /, кислород / О<sub>2</sub> /, соли, сажди, прах и други механични примеси.", "Водород / Н<sub>2</sub> /, кислород / О<sub>2</sub> /, соли, сажди, прах и други механични примеси.","А" ,"115 ."],
[ "  Посочете вярното уравнение на химичната реакция на окисляването на въглерода:", "С + О<sub>2</sub> = СО<sub>2</sub>.", "С<sub>2</sub> +О=С<sub>2</sub>О<sub>2</sub>.", "С + О = СО.", "С<sub>2</sub> +О<sub>2</sub>=С<sub>2</sub>О.","А" , "116 ."],
[ "  Какво се цели с допълнителната обработка на цилиндровите втулки на КДВГ?", "Повишаване на термоустойчивостта.", "Увеличаване на твърдостта и намаляване на износването.", "Не се подлагат на допълнителна обработка.", "Повишаване на еластичността.","Б" ,"117 ."],
[ "  В коя част на цилиндровата втулка на КДВГ износването от буталото е максимално?", "Равномерно по цялата дължина.", "Горната част на втулката.", "Долната част на втулката.", "Средната част на втулката.","Б" , "118 ."],
[ "  От какъв материал се изработват цилиндровите втулки на КДВГ?", "Чугун.", "Алуминиеви сплави.", "Металокерамика.", "Феростомани.","А" ,"119 ."],
[ "  По какъв начин се осъществява предотвратяването на преминаване на вода от охлаждащото пространство между втулката и тялото на цилиндровия блок при КДВГ?", "Каучуков пръстен с кръгло сечение, поставен в гнезда със специален профил.", "Лабиринтово уплътнение.", "Гумени сегменти.", "Механично уплътнение.","А" , "120 ."],
[ "  Поставя ли се уплътнение между цилиндровата глава и цилиндровия блок на КДВГ?", "Само при КДВГ с голяма мощност.", "Между частите се поставят лепила.", "Задължително се поставя уплътнение.", "Само при кръстоглавни КДВГ.","В" ,"121 ."],
[ "  Защо се налага допълнително смазване на цилиндровата втулка на КДВГ?", "За да се намали триенето между втулката и буталните пръстени.", "За повишаване на степента на сгъстяване.", "Няма такова смазване.", "За повишаване на налягането на сгъстяване.","А" , "122 ."],
[ "  При кои КДВГ се налага допълнително подаване на масло в цилиндровата втулка?", "Тронкови.", "“ V “ образни.", "Кръстоглавни.", "Няма такова смазване.","В" ,"123 ."],
[ "  В коя част на цилиндровата втулка се пробиват каналите на лубрикаторната система на кръстоглавен КДВГ?", "Над първия бутален пръстен когато буталото е в горна мъртва точка.", "Непосрествено до долния край на цилиндровата втулка.", "В средата над прозорците.", "Непосрествено до горния край на цилиндровата втулка.","В" , "124 ."],
[ "  Съгласно втория закон на термодинамиката преобразуването на топлинната енергия в механична работа е възможно при:", "Съществуването на два топлинни източника с различни температури.", "Два топлинни източника с еднакви температури.", "Ако работното тяло е идеален газ.", "Съществуването на два топлинни източника с променливи температури.","А" ,"125 ."],
[ "  Текущата стръмност на винтовата характеристика може да се определи с:", "Газенето и обрастването.", "Честотата на въртене и мощността, с които двигателят работи.", "Газенето и скоростта.", "Обрастването.","Б" , "126 ."],
[ "  Винтовата характеристика е лека, когато стръмността и в относителен вид е:", "По-малка от 1.", "По-голяма от 1.", "Равна на 1.", "По-голяма от 2.","А" ,"127 ."],
[ "  Винтовата характеристика е тежка, когато стръмността и в относителен вид е:", "По-малка от 1.", "По-голяма от 1.", "Равна на 1.", "По-малка от 0,5.","Б" , "128 ."],
[ "  Стендовата винтова характеристика има стръмност в относителен вид:", "По-малка от 1.", "По-голяма от 1.", "Равна на 1.", "По-голяма от 2.","В" ,"129 ."],
[ "  Хидродинамичният КПД на винт с регулируема крачка при постоянна честота на въртене с увеличение на крачката:", "Нараства.", "Не се променя.", "Намалява.", "Намалява в зависимост от натоварването.","А" , "130 ."],
[ "  Хидродинамичният КПД на винт с регулируема крачка при постоянна крачка с увеличение на честота на въртене:", "Нараства.", "Не се променя.", "Намалява.", "Нараства в зависимост от натоварването.","В" ,"131 ."],
[ "  При ръчно управление на Гл.КДВГ, ускоряването му протича по:", "Зададената частична скоростна характеристика.", "Линията на ограничение на мощността.", "Винтовата характеристика за постоянна скорост на кораба.", "Винтовата характеристика за променлива скорост на кораба.","А" , "132 ."],
[ "  При реверсиране на Гл.КДВГ с контра въздух, от преден на заден ход, гориво към цилиндрите се подава когато:", "Започне реверсирането.", "Двигателят спре да се върти напред.", "Двигателят се завърти устойчиво назад.", "Двигателят е спрял.","В" ,"133 ."],
[ "  Зоната на нулевото подаване на горивонагнетателни помпи на КДВГ осигурява:", "Работата на двигателя на празен ход.", "Спирането на двигателя.", "Възможност за опростена настройка на горивонагнетателни помпи.", "Пускането на двигателя.","Б" , "134 ."],
[ "  Горивоподаването трябва да спре, когато рейките на горивонагнетателните помпи на КДВГ:", "Показват нула.", "Показват стойности по-големи от нула.", "Показват стойностти по-малки от нула.", "Нито едно от изброените.","Б" ,"135 ."],
[ "  Устойчивостта на режима на КДВГ в зависимост от горивоподаващата апаратура е най-ниска при:", "Висока честота на въртене.", "Средна честота на въртене.", "Ниска честота на въртене.", "Номинална честота на въртене.","В" , "136 ."],
[ "  Горивоподаващата апаратура на КДВГ с VIT управление има за цел да осигури:", "Устойчивост на режимите при по-ниски натоварвания.", "Икономичност на режимите при по- ниски натоварвания.", "Намалена механична и топлинна напрегнатост на режимите при по- ниски натоварвания.", "Устойчивост на режимите при променливи натоварвания.","Б" ,"137 ."],
[ "  При постоянно натоварване на КДВГ, с увеличение на честотата на въртене износванията на цилиндро-бутална група:", "Намаляват.", "Нарастват, после остават постоянни.", "Се увеличават.", "Не се променят.","В" , "138 ."],
[ "  При постоянна честотата на въртене на КДВГ, с увеличение на натоварването износванията на цилиндро-бутална група:", "Намаляват.", "Се увеличават.", "Не се променят.", "Намаляват, после остават постоянни.","Б" ,"139 ."],
[ "  При честоти на въртене от 70 до 100% от номиналната, по една и съща винтова характеристика износванията на цилиндро-бутална група на КДВГ:", "Намаляват с увеличение на честотата на въртене.", "Се увеличават с увеличение на честотата на въртене.", "Не се променят с изменение на честотата на въртене.", "Намаляват, после остават постоянни.","В" , "140 ."],
[ "  При износване на буталните пръстени на КДВГ коефициента на излишен въздух:", "Намалява.", "Не се променя.", "Нараства.", "Нараства, после остава постоянен.","А" ,"141 ."],
[ "  При износване на отворите на разпръсквача на КДВГ, продължителността на горенето:", "Намалява.", "Намалява, после остава постоянен.", "Нараства.", "Не се променя.","В" , "142 ."],
[ "  Термичният коефициент на полезно действие представлява:", "Основен показател на конструктивните особености на ДВГ.", "Отношение на количеството топлина, превърнато в механична работа към цялото количество топлина внесено в работното тяло за един цикъл.", "Показател за вида и качеството на използваното гориво.", "Показател за калоричността на използваното гориво.","Б" ,"143 ."],
[ "  Процеса пълнене при двутактовите КДВГ протича при движение на буталото от:", "ГМТ към ДМТ.", "ДМТ към ГМТ.", "Около ГМТ.", "След ГМТ.","Б" , "144 ."],
[ "  Под полезен обем на двутактов КДВГ разбираме:", "Обема описан от буталото при движението му от ГМТ до положението в които се затварят газоразпределителните органи.", "Обема описан при движение на буталото от ГМТ до ДМТ.", "Пълния обем на цилиндъра.", "Обема на горивната камера.","А" ,"145 ."],
[ "  Какво отчита коефицентът на остатъчни газове при КДВГ?", "Степента на съвършенство на работния процес.", "Степента на прочистване на цилиндъра.", "Степента на сгъстяване на работното тяло.", "Степен на нагнетяване.","Б" , "146 ."],
[ "  От какво се загрява пресния заряд въздух при постъпване в цилиндъра на КДВГ с ТКА?", "От топлообмена с изгорелите газове.", "От подгревателя във въздухоснабдителния ресивер.", "Вследствие предварителното му сгъстяване.", "От вентилатора във въздухоснабдителния ресивер.","В" ,"147 ."],
[ "  Каква е температурата на работното тяло в края на процеса напълване при двутактови КДВГ с принудително пълнене?", "Та= 330 – 430 K.", "Та= 310 – 330 К.", "Та= 310 – 380 К.", "Нито едно от изброените.","Г" , "148 ."],
[ "  Степен на сгъстяване при КДВГ се нарича отношението между обемите:", "В началото и края на процеса сгъстяване Va и Vc.", "В края на процеса пълнене и началото на процеса горене.", "В началото на процеса пълнене и края на процеса горене.", "В началото на процеса пълнене и края на процеса разширение.","А" ,"149 ."],
[ "  Използването на топлина в идеалния цикъл се характеризира с:", "Термодинамичен коефицент на полезно действие η<sub>t</sub>.", "Индикаторен коефицент на полезно действие η<sub>i</sub>.", "Молекулярен коефицент на полезно действие.", "Ефективен коефицент на полезно действие .","А" , "150 ."],
[ "  При какво движение на буталото протича процеса сгъстяване на работното тяло в КДВГ?", "От ГМТ към ДМТ.", "От ДМТ към ГМТ.", "При движението му около ДМТ.", "При движението му около ГМТ.","Б" ,"151 ."],
[ "  Какво е предназначението на процеса сгъстяване при КДВГ?", "Подобряване на качеството на смесообразуване.", "Създаване на най-добри условия за осъществяване на процеса горене.", "Осигуряване на качествен топлообмен.", "Осигуряване на пресен заряд въздух.","Б" , "152 ."],
[ "  Къде се извършва процеса смесообразуване при дизеловите КДВГ?", "Във въздухоснабдителния колектор.", "В горивната камера.", "В карбуратора.", "В горивния клапан.","Б" ,"153 ."],
[ "  До какво би довело прекомерното повишаване на температурата в края на процеса сгъстяване при карбураторни ДВГ?", "Подобряване на процеса горене.", "Влошаване на процеса горене.", "Самозапалване на горивото.", "Не оказва влияние.","В" , "154 ."],
[ "  Как влияе създаването на вихрово движение на въздуха върху качеството на процеса сгъстяване при КДВГ?", "Подобрява процеса.", "Влошава процеса.", "Не оказва влияние върху процеса.", "Не оказва влияние.","А" ,"155 ."],
[ "  Процесът сгъстяване при КДВГ е термодинамичен процес при който влияние оказват:", "Топлообмена между стените на цилиндъра и работните газове.", "Количеството пресен заряд и степента на очистване на цилиндъра.", "Параметрите на идеалния газ.", "Количеството пресен заряд.","А" , "156 ."],
[ "  Каква е температурата на работното тяло в началото на процеса сгъстяване спрямо температурата на стените на цилиндъра в КДВГ?", "По-висока.", "По-ниска.", "Температурите са еднакви.", "Зависи от конструкцията.","Б" ,"157 ."],
[ "  При износване на отворите на разпръсквача на КДВГ, нараства продължителността на горенето през:", "Първа фаза.", "Втора фаза.", "Втора и трета фази.", "Трета и четвърта фази.","Г" ,"158 ."],
[ "  При износване на отворите на разпръсквача на КДВГ, индикаторният КПД:", "Намалява.", "Нараства, после остава постоянен.", "Нараства.", "Не се променя.","А" ,"159 ."],
[ "  При износване на отворите на разпръсквача на КДВГ, индикаторният КПД намалява поради удължаване на горенето през:", "Първа фаза.", "Втора и трета фази.", "Втора фаза.", "Трета и четвърта фази.","Г" , "160 ."],
[ "  При износване на отворите на разпръсквача на КДВГ, ефективният КПД намалява поради удължаване на горенето през:", "Първа фаза.", "Трета и четвърта фази.", "Втора фаза.", "Втора и трета фази.","Б" ,"161 ."],
[ "  Как влияе нарастването на коефициента на излишния въздух върху корозията от газовата страна в КПК?", "Не влияе.", "Усилва я.", "Забавя я.", "Корозията остава постоянна.","Б" , "162 ."],
[ "  Какво е предназначението на дифузьора в КПК:", "Предпазва корена на факела от относително хладния въздух.", "Оказва влияние върху разпръскването на горивото.", "Регулира съотношението гориво/въздух.", "Променя коефициента на излишен въздух.","А" ,"163 ."],
[ "  Каква трябва да е реакцията на котелната вода:", "Неутрална.", "Кисела.", "Алкална.", "Реакцията не е от значение.","В" , "164 ."],
[ "  Кой от изброените принципи не се прилага при пренасянето на топлината в КПК?", "Кондукция.", "Йонизация.", "Радиация.", "Конвекция.","Б" ,"165 ."],
[ "  Какви действия са наложителни при рН на котловата вода < 7?", "Повишава се дозировката на химикали и се прави нов тест на водата след това.", "Продухване и подменяме част от водата.", "Понижава се дозировката на химикали и се прави нов тест на водата след това.", "Не се предприема нищо.","А" , "166 ."],
[ "  Какъв ефект предизвиква повишената концентрция на калций в котелната вода?", "Загуба на алкалност, корозия на металните повърхности, загуби на фосфатен резерв.", "Повишена алкалност, инертиране на металните повърхности, повишаване на фосфатен резерв.", "Не влияе на алкалността.", "Алкалността нараства, но се увеличава временната твърдост на котелната вода.","А" ,"167 ."],
[ "  Какво означава понятието “статизъм” при САР на оборотите на КДВГ?", "Зависимостта на оборотите в установени режими от натоварването.", "Независимостта на оборотите в установени режими от натоварването.", "Зависимостта на оборотите от времето.", "Закъснението в изпълнението на командите от регулиращия орган.","А" , "168 ."],
[ "  Какъв закон осигуряват регулаторите на обороти с пряко действие?", "Интегрален.", "Пропорционален.", "Пропорционално - интегрален.", "Пропорционално-интегрално-диференциален.","Б" ,"169 ."],
[ "  Какви предимства осигурява системата за автоматичен контрол на горивния процес при корабните парни котли?", "Икономия на гориво поради по-добра организация на горивния процес.", "Намаляване на количеството на дима и саждообразуването.", "Контролира температурата в пещта, предпазвайки зидарията на котела от разрушаване.", "Всичко изброено.","Г" , "170 ."],
[ "  Основното предназначение на вентилационния клапан на паропрегревателя на КПК е да:", "Обезвъздушава паропрегревателя.", "Осигурява поток през паропрегревателя при покачващото се налягане при изключване на котела от паралел или от линия.", "Гарантира запълването с вода при стартиране.", "Всички изброени.","Б" ,"171 ."],
[ "  Кога е възможно кипене в спускните тръби на водотръбен котел с естествена циркулация?", "При претоварване на котела.", "При запалване на саждите, натрупани по тях.", "При замърсяване на крайните нагревни повърхности.", "При рязко прекратяване на консумацията на пара.","Б" , "172 ."],
[ "  Кога е възможна кавитация в спускните тръби на водотръбен КПК?", "Когато напорът на спускните тръби е по-малък от напора на пароводният колектор.", "Когато напорът на спускните тръби е по-голям от напора на пароводният колектор.", "Когато напорът на спускните тръби е равен на напора на пароводния колектор.", "В спускните тръби кавитацията е невъзможна.","А" ,"173 ."],
[ "  На кои кораби най-често се монтират двуконтурни парни котли и защо?", "На пасажерски кораби поради по-голямата безопасност.", "На Ро-Ро кораби и контейнеровози, поради по-малката нужда от спомагателна пара - утилизацията работи с много малки спирания.", "На танкери, за да се избегне замърсяването на котловата вода от нефтопродукти.", "На всички кораби, когато часовият разход на котела е по-важен от габаритите му.","В" , "174 ."],
[ "  Как ще дефинирате понятието “Правоточен парен котел с кратност на циркулацията равна на единиц” ?", "Каквото количество вода се подава на входа, толкова пара се получава на изхода.", "Една пълна циркулация на водосъдържанието се извършва за един час.", "Пламъчнотръбен котел с праволинеен ход на димните газове, с една циркулация на водосъдържанието за час.", "Няма такива котли.","А" ,"175 ."],
[ "  Какви трябва да бъдат регулаторните характеристики когато има два Гл.КДВГ:", "Астатични характеристики.", "Със статизъм.", "Вида на регулаторните характеристики е без значение.", "Статизма не е от съществено значение.","Б" , "176 ."],
[ "  Колко време продължително може КДВГ да работи в точка разположена върху ограничителната характеристика по максимално допустимо натоварване за продължителна експлоатация:", "Неограничено време.", "Ограничено време.", "В продължение на 1 час на всеки 12 часа.", "В продължение на 1 час на всеки 4 часа.","А" , "177 ."],
[ "  Ограничителят на натоварване вграден в механичния регулатор за честота на въртене на КДВГ ограничава работата на двигателя до:", "Ограничителна характеристика по максимално допустимо натоварване за продължителна експлоатация.", "Характеристика по допустимо претоварване за честота на въртене по-ниска от номиналната.", "Ограничителна характеристика по максимално допустима честота на въртене.", "Ограничителна характеристика по номинална честота на въртене.","Б","178 ."],
[ "  Какво представлява хидродинамичния КПД на свободен винт:", "Отношение на мощността трансформирана в ефективен упор и мощността подведена към винта.", "Отношение на мощността трансформирана в упор и мощността подведена към винта.", "Отношение на мощността подведена към винта и буксировъчната мощност.", "Отношение на мощността подведена към винта и мощността на швартови.","Б" ,"179 ."],
[ "  Кога хидродинамичния КПД на винта е максимален:", "Когато корабът се ускорява.", "Когато корабът се движи с установена скорост.", "Когато корабът намалява скоростта си.", "Когато корабът се движи с неустановена скорост.","Б" , "180 ."],
[ "  Какво представлява хидродинамичния КПД на винт монтиран на кораб:", "Отношение на мощността трансформирана в ефективен упор и мощността подведена към винта.", "Отношение на мощността трансформирана в упор и мощността подведена към винта.", "Отношение на мощността подведена към винта и буксировъчната мощност.", "Отношение на мощността подведена към винта и мощността на швартови.","А" ,"181 ."],
[ "  В какви случаи хидродинамичния КПД на винта е равен на нула:", "Когато слипът е равен на единица.", "Когато слипът е равен на нула.", "А) и Б).", "Когато слипът е равен на 0.5.","В" , "182 ."],
[ "  Винтовата характеристика е характеристика на:", "Двигателя.", "Корпуса и винта съвместно.", "На винта.", "Корпуса.","Б" ,"183 ."],
[ "  Ако при тежка винтова характеристика се зададе номинална честота на въртене двигателят:", "Може да работи кратко време.", "Може да работи неограничено време.", "Няма да може да развие номинална честота на въртене.", "Може да работи продължително време.","А" , "184 ."],
[ "  При какви винтови характеристики Гл.КДВГ има запас от мощност:", "При леки.", "При тежки.", "Запаса по мощност не зависи от винтовата линия.", "При умерени.","А" ,"185 ."],
[ "  Ако винтовата характеристика е със стръмност 80% от номиналната и се зададе номинална честота на въртене, каква мощност ще развие КДВГ:", "Номинална.", "10% по-ниска от номиналната.", "20% по-ниска от номиналната.", "15% по-ниска от номиналната.","В" , "186 ."],
[ "  Ако един КДВГ работи на номинална честота на въртене с мощност 90% от номиналната, какво е средното му ефективно налягане:", "Номинално.", "81% от номиналното.", "90% от номиналното.", "85% от номиналнато.","В" ,"187 ."],
[ "  С каква мощност работи един КДВГ, ако честотата му на въртене и средното ефективно налягане са 90% от номиналните:", "Номинална.", "81% от номиналната.", "90% от номиналната.", "85% от номиналната.","Б" , "188 ."],
[ "  От какво зависи стръмността на текущата винтова характеристика:", "От честотата на въртене, с която двигателят работи.", "От мощността, с която двигателят работи.", "От газенето на кораба.", "От зададената отсечка.","В" ,"189 ."],
[ "  Кой показател характеризира натоварването на утилизационните парни котли?", "Разходът и температура на изходящите газове.", "Специфичната паропроизводителност.", "Кратността на циркулацията.", "Температурата на питателната вода.","А" , "190 ."],
[ "  Каква е основната цел на газовия анализ при КПК?", "Определяне на количеството на въглеродня окис в състава на отработените газове.", "Определяне на състава на отработените от котела газове с цел отчитане на ефективността от горенето.", "Определяне и поддържане на оптимален коефициент на излишния въздух.", "Определяне на състава и димността на отработените от котела газове с цел отчитане ефективността от горенето.","В" ,"191 ."],
[ "  Защо цилиндровите втулки на КДВГ трябва да имат възможност свободно да се разширяват радиално и осово?", "Подложени са на големи абразивни натоварвания.", "Подложени са на големи механични натоварвания.", "Натоварени са топлинно в широк Т диапазон.", "Подложени са на вибрационни натоварвания.", "В" , "192 ."],
[ "  Как става фиксирането на цилиндровата втулка към цилиндровия блок на КДВГ?", "Горно фланцево удебеление.", "Две симетрични уплътнения.", "Пресова сглобка.", "Щифтове.","А" ,"193 ."],
[ "  Какво е разпределението на температурното натоварване на цилиндровата втулка на КДВГ?", "Равномерно.", "Изменя се в геометрична прогресия.", "Неравномерно.", "Изменя се плавно.","В" , "194 ."],
[ "  Какво е условието за получаване на пределна скоростна характеристика на Гл.КДВГ:", "Постоянен пределен активен ход на плунжера на ГПВН за целия диапазон на изменение на честота на въртене.", "Пределен активен ход на плунжера на ГПВН, различен за всяка честота на въртене.", "Максимален активен ход на плунжера на ГПВН.", "Полезен активен ход на плунжера на ГПВН.","Б" , "195 ."],
[ "  В кое от следните устройства химическата енергия се преобразува в топлинна при работата на котлите?", "В пещта на котела.", "В паропрегревателя на котела.", "В пароводния барабан на котела.", "В икономайзера.","А" ,"196 ."],
[ "  Основната загуба на топлина при спомагателния котел е:", "В икономайзера и въздухоподревателя.", "От топлообмена през корпуса на котела в околното пространство.", "В отработените газове.", "При парообразуването.","В" , "197 ."],
[ "  Най-опасни за формиране на шлак от горивото във котелната горелка са:", "Желязо и сяра.", "Ванадий и натрий.", "Калий и никел.", "Калций и силиций.","Б" ,"198 ."],
[ "  Системата за дренаж при парна инсталация високо налягане се отвежда в:", "Атмосферен дрейн танк.", "Инспекционен дрейн танк.", "Деаератора.", "Главен кондензатор.","Г" , "199 ."],
[ "  Системата за дренаж при парна инсталация ниско налягане се отвежда в:", "Деаератора.", "Инспекционен дрейн танк.", "Атмосферен дрейн танк.", "Топъл сандък.","В" ,"200 ."],
[ "  Светлокафяв дим от котелния димоход означава:", "Замърсен горивен разпръсквач на горелката.", "Добро горене в пещта на котела.", "По-голямо налягане на горивото.", "По-ниско налягане на горивото.","Б" , "201 ."],
[ "  Коя е най-опасната система за регулиране на налягането на парата от експлоатационна точка?", "Комбинираната система.", "Системата “въздух - гориво”.", "Системата “гориво-въздух”.", "И трите.","В" ,"202 ."],
[ "  Акумулиращата способност на парния котел се определя от:", "Относителната му маса.", "Относителният му обем.", "Масата на водата в него.", "Относителното му водосъдържание.","В" , "203 ."],
[ "  Котелната вода има алкална реакция, ако водородният показател рН е:", "< 0.", "2 ÷ 5.", "> 7.", "> 14.","В" ,"204 ."],
[ "  Хидравлични изпитания на парни котли с използване на питателната помпа се:", "Разрешават.", "Забраняват.", "Извършват по преценка на гл. механик.", "Разрешавта от експлоатационната организация.","Б" , "205 ."],
[ "  Рязкото падане на налягането в парния котел може да доведе до:", "Кипене в спускните тръби.", "Кондензация в подемните тръби.", "Отваряне на предпазния клапан.", "Няма последици.","А" ,"206 ."],
[ "  Силата на естествената тяга в парните котли е толкова по-голяма, колкото е:", "По-висока димовата тръба.", "По-ниска температурата на околния въздух.", "По-висока температурата на изходящите газове.", "Всичко изброено.","Г" , "207 ."],
[ "  При парните котли на нискотемпературна корозия са подложени:", "Пароводният колектор.", "Спускните тръби.", "Подемните тръби.", "Крайните нагревни повърхности.","Г" ,"208 ."],
[ "  При кoй от следните случаи е възможен взрив в спомагателен ПК?", "Много бързо отваряне на въздушния регистър.", "Много висока температура на горивото.", "Много високо налягане на горивото.", "Опит за запалване от температурата на пещта.","Г" , "209 ."],
[ "  Кранът за обезвъздушаване на КПК е разположен:", "На най-горната част на въздухоподгревателя.", "В зоната на въздушния регистър, от страната на вентилатора.", "В най-високата точка на пароводния колектор на КПК.", "В най-високата точка на икономайзера.","В" ,"210 ."],
[ "  Димът от котела има бял цвят. Каква е причината?", "Твърде високо налягане на горивото.", "Твърде голям коефициент на излишен въздух.", "Много добро състояние на горивния процес.", "По-малко количество въздух от необходимото.","Б" , "211 ."],
[ "  Кой тест определя сухия остатък в котелната вода?", "Тестът за хлориди.", "Тестът за алкалност.", "Кондуктивният тест.", "Няма такъв тест.","В" ,"212 ."],
[ "  Коя силова уредба от изброените има най- голям моторесурс:", "Дизелова силова уредба.", "Паротурбинна силова уредба.", "Газотурбинна силова уредба.", "Комбинирана силова уредба СОDAG.","Б" , "213 ."],
[ "  Всеки парен котел при всички условия на работа трябва да има независими едно от друго изправни питателни средства не по- малко от:", "Едно.", "Две.", "Три.", "Не се регламентира.","Б" ,"214 ."],
[ "  Какво е условието за получаване на скоростна характеристика на Гл.КДВГ по граница на дименето:", "Постоянен активен ход на плунжера на ГПВН за целия диапазон на изменение на честота на въртене, при който има димене.", "Максимален активен ход на плунжера на ГПВН.", "Активен ход на плунжера на ГПВН при който започва дименето, различен за всяка честота на въртене.", "Полезен активен ход на плунжера на ГПВН.","В" , "215 ."],
[ "  Какво е условието за получаване на максимална скоростна характеристика на Гл.КДВГ:", "Постоянен максимален активен ход на плунжера на ГПВН за целия диапазон на изменение на честота на въртене.", "Максимален активен ход на плунжера на ГПВН, различен за всяка честота на въртене.", "Максимална циклова порция гориво.", "Полезен активен ход на плунжера на ГПВН.","А" ,"216 ."],
[ "  Какво е условието за получаване на номинална скоростна характеристика на КДВГ:", "Номинален активен ход на плунжера на ГПВН, различен за всяка честота на въртене.", "Постоянен номинален активен ход на плунжера на ГПВН за целия диапазон на изменение на честота на въртене.", "Номинална циклова порция гориво.", "Полезен активен ход на плунжера на ГПВН, различен за всяка честота на въртене.","Б" , "217 ."],
[ "  Какво е понятието “работна точка” на КДВГ:", "Точка от работното поле характеризираща се основно с показателите мощност или средно ефективно налягане и честота на въртене.", "Показатели на двигателя характерезиращи работата му в даден момент.", "А) и Б).", "Точка от работното поле характеризираща се основно с показателите мощност, термичен КПД и честота на въртене.","В" ,"218 ."],
[ "  Какво е понятието “номинална работна точка” на КДВГ:", "Работна точка в която мощността развивана от двигателя е равна на номиналната мощност, а честотата на въртене е равна на номиналната честота на въртене.", "Работна точка в която мощността развивана от двигателя е равна на максимално продължителната мощност, а честотата на въртене е равна на честота на въртене при която е обявена максимално продължителната мощност.", "А) и Б).", "Работна точка в която мощността развивана от двигателя е равна на максималната мощност, а честотата на въртене е равна на номиналната честота на въртене.","В" , "219 ."],
[ "  Какво е условието за получаване на товарна характеристика на КДВГ:", "Постоянство на честотата на въртене.", "Постоянство на натоварването.", "Постоянство на указателя на натоварване.", "Постоянство на цикловото подаване.","А" ,"220 ."],
[ "  Какво е условието за получаване на регулаторна характеристика на КДВГ:", "Постоянство на честотата на въртене.", "Постоянство на заданието на регулатора.", "Постоянство на указателя на натоварване.", "Постоянство на цикловото подаване.","Б" , "221 ."],
[ "  Коя регулаторна характеристика на КДВГ се нарича астатична:", "При която няма изменение на честотата на въртене.", "При която изменението на честотата на въртене е в рамките на статизма.", "При която има изменение на честотата на въртене само на празен ход.", "При която изменението на честотата на въртене е по П- закон.","А" ,"222 ."],
[ "  Коя регулаторна характеристика на КДВГ има статизъм:", "При която няма изменение на честотата на въртене.", "При която изменението на честотата на въртене е в рамките на статизма.", "При която има изменение на честотата на въртене само на празен ход.", "При която има изменение на честотата на въртене само при неустановени режими.","Б" , "223 ."],
[ "  Има ли разлика между товарната и астатичната регулаторна характеристика на КДВГ?", "Няма разлика.", "Има съществена разлика.", "Разликата е във формата на кривите.", "Б) и В).","А" ,"224 ."],
[ "  Кога се налага регулаторната характеристика на КДВГ да има статизъм:", "За да може да реагира по-бързо регулатора.", "За да може да реагира по-бавно регулатора.", "За да може да се реализира паралелна работа на двигателите.", "Статизма не е от съществено значение.","В" , "225 ."],
[ "  На всеки парен котел с работно налягане над 5 Bar се монтират водопоказателни стъкла:", "Едно.", "Две.", "Три.", "Не се регламентира.","Б" ,"226 ."],
[ "  Колко манометъра за показване на налягането в парното пространство трябва да има всеки парен котел?", "Един.", "Два.", "Три.", "Не се регламентира.","Б" , "227 ."],
[ "  Специалните перископи в котлите се монтират за да се наблюдава:", "Разпръскването на горивото и горивния факел.", "Водното ниво в барабана на котела.", "Димността на отработените газове след димохода.", "Няма такива перископи.","В" ,"228 ."],
[ "  Кое от твърденията е теоремата на Карно?", "КПД на една обратимо работеща топлинна машина зависи от нарастването на ентропията й.", "Не е възможно съществуването на топлинна машина, която напълно да превръща топлината в работа.", "КПД на една идеална топлинна машина зависи само от подведената и отведена топлина.", "Не е възможно преминаването на топлина от по- студено към по-топло тяло.","В" , "229 ."],
[ "  По какво може да се установи, че хладилен компресор работи на влажен ход?", "По заскрежаването на всмукателния колектор.", "По температурата на входящия фреон.", "По налягането и температурата на засмуквания от компресора фреон.", "По шума на работа на компресора.","В" ,"230 ."],
[ "  В пристанищата на Европейския съюз съдържанието на сяра в използваните на кораба горива не може да надвишава:", "1%.", "0,1%.", "0,01%.", "1,5%.","Б" , "231 ."],
[ "  Какво означава понятието “статизъм” при САР на оборотите на КДВГ?", "Зависимостта на оборотите в установени режими от натоварването.", "Независимостта на оборотите в установени режими от натоварването.", "Зависимостта на оборотите от времето.", "Закъснението в изпълнението на командите от регулиращия орган.","Б" ,"232 ."],
[ "  Какъв закон осигуряват регулаторите на обороти с пряко действие?", "Интегрален.", "Пропорционален.", "Пропорционално - интегрален.", "Пропорционално-интегрално-диференциален.","Б" , "233 ."],
[ "  Защо нагряването на голям обем запълнен с вода е най-ефективно, ако подгревът се осъществява от най-ниската точка на съда, съдържащ течността?", "Поради конвективното движение в течността.", "Нагряването е по-ефективно, ако същото количество топлина се подведе от всички страни на съда.", "Поради по-ефективната радиация.", "Важно е количеството топлина, а не приложното поле на топлообмена.","А" ,"234 ."],
[ "  Хлорина се добавя в охлаждащата сладка вода на КДВГ за да:", "Увеличи топлообмена.", "Намали отлаганията.", "Не се допусне биологично развитие на микроорганизми.", "Не се добавя хлорин.","В" , "235 ."],
[ "  Кое твърдение относно уплътнителните пръстени за херметизация на водното пространство на цилиндровите втулки не е вярно?", "Площта на напречното сечение на пръстена трябва да е с 10 - 15 % по- малка от сечението на канала.", "Вътрешният диаметър на пръстена трябва да е с 2 - 3 % по-малък от диаметъра на канала.", "Поставеният в канала гумен пръстен, трябва да излиза извън монтажните пояси с 15-20% от диаметъра на уплътнението.", "Допуска се повторно използване на уплътнителни пръстени, ако техническото им състояние отговаря на изискванията на ТЕ.","Г" ,"236 ."],
[ "  Предпазителните клапани на КДВГ са задължителни за диаметри на цилидрите равни и по-големи от:", "200 мм.", "340 мм.", "450 мм.", "500 мм.","А" , "237 ."],
[ "  Температурите на изходящите газове на четиритактов КДВГ двигател:", "Намаляват, ако намалим температурата на смазващото масло.", "Намаляват, ако изпускателен клапан пропуска.", "Нормално са по-ниски, отколкото температурите на двутактов КДВГ със същото натоварване.", "Се увеличават при влошено охлаждане на въздуха към ресивера.","Г" ,"238 ."],
[ "  Двете първи цифри отдясно наляво на основното означение на търкалящите лагери определят:", "Вътрешният диаметър на лагера, като упоменатите цифри се умножат по 5, в милиметри.", "Товароносимостта на лагера, като цифрите се умножат по 5, в килонютони.", "Типа на лагера като кодов номер.", "Широчината на гривната, като числото се умножи по 5, в милиметри.","А" , "239 ."],
[ "  Кой от посочените типове регулатори за обороти няма регулираща функция, а само защитава двигателя от разгон?", "Еднорежимен.", "Всережимен.", "Граничен.", "Няма такъв сред изброените.","В" ,"240 ."],
[ "  Висока температура на изгорелите газове при двутактов КДВГ се причинява от:", "По-високо налягане на впръскване на горивото.", "По-високо налягане при запалване.", "Прегрят стартов въздух.", "Нагар по изпускателните прозорци/клапани.","Г" , "241 ."],
[ "  Понижаването на максималното налягане на впръскване на горивото при работа на главен КДВГ на маневрени режими се дължи на:", "Увеличаване на утечките в горивната апаратура.", "Намаляване на влиянието на свиваемостта на горивото.", "Намаляване влиянието на дроселирането на горивото.", "Намаляване на цикловата порция.","Г" ,"242 ."],
[ "  Отварянето на автоматичен пусков клапан на КДВГ става чрез:", "Пусковия въздух.", "Управляващия въздух.", "Нито А), нито Б).", "А) и Б).","А" , "243 ."],
[ "  Регулаторите за дебит при флуиди служат за:", "Поддържане на постоянен поток при колебания на налягането.", "Поддържане на постоянно налягане.", "Предпазване от претоварване.", "Поддържане на постоянен поток при постоянно налягане.","А" ,"244 ."],
[ "  Дишането на коляновия вал на КДВГ носи информация за:", "Износването на вала.", "Несъосност на основните лагери.", "Неточност при центровката на цилиндро-буталната група.", "Несъосност на мотилевите лагери.","Б" , "245 ."],
[ "  Разширителната цистерна в затворена охлаждаща система сладка вода е проектирана с цел поддържане постоянен напор на системата и:", "Да поема увеличението на обема на водата.", "За понижаване на температурата на водата.", "За намаляване турболентността на водния поток.", "За осигуряване на въздушна възглавница.","А" ,"246 ."],
[ "  Кои от изброените лагери се използват най- широко като основни и мотилеви лагери при КДВГ?", "Ролкови лагери.", "Съчмени лагери.", "Плъзгащи лагери.", "Иглени лагери.","В" , "247 ."],
[ "  Кой от изброените методи обикновено се използва за смазване на лагерите на КДВГ?", "Смазване чрез разплискване.", "Смазване под налягане.", "Струйно смазване.", "С механични лубрикатори.","Б" ,"248 ."],
[ "  При КДВГ основните лагери се намират между:", "Мотовилката и коляновия вал.", "Буталният болт и мотовилката.", "Разпределителният вал и блока на двигателя.", "Коляновият вал и рамата на двигателя.","Г" , "249 ."],
[ "  В коя от посочените системи при КДВГ топлообменниците се използват най- често:", "Системата за леко гориво.", "Системата за регулиране на оборотите.", "Въздушнопусковата система.", "Маслената система.","Г" ,"250 ."],
[ "  Охлаждащата вода на Гл.КДВГ се използва във водоопреснителната уредба като:", "Охлаждащ агент за дестилата.", "Охлаждащ агент за разсола.", "Средство за подгряване на питателната морска вода.", "Основно средство за вакуумиране на уредбата.","В" , "251 ."],
[ "  При двутактовите КДВГ работен цикъл за един цилиндър се извършва на всеки:", "Един оборот на коляновия вал.", "Два оборота на коляновия вал.", "Един ход на буталото.", "Четири хода на буталото.","А" ,"252 ."],
[ "  Продухвателните прозорци на бавноходен двутактов КДВГ се отварят и затварят от:", "Разпределителният вал.", "Буталото.", "Изпускателните клапани.", "Регистрите.","Б" , "253 ."],
[ "  Ако 4-тактов ДВГ се стартира с директен въздух в цилиндрите, то буталото в цилиндъра трябва да е в положение:", "В началото на работния ход.", "В края на изпускането на изгорели газове.", "В края на работния ход.", "В началото на засмукването.","А" ,"254 ."],
[ "  Гл.КДВГ, управляван от изправен регулатор с ограничител на натоварването, когато не може да достигне до зададената честота на въртене работи по:", "Регулаторна характеристика.", "Ограничителна характеристика.", "Частична външна скоростна характеристика.", "Външна скоростна характеристика.","Б" , "255 ."],
[ "  Упорът, създаван от винта е най-голям, когато кораба:", "Увеличава скоростта си.", "Се движи с максимална скорост.", "Намалява скоростта си посредством двигателя.", "Нито едно от изброените.","А" ,"256 ."],
[ "  Скоростта на плъзгане на винта се определя като разлика между:", "Скоростта на винта в твърда среда и скоростта на кораба, измерена с лаг.", "Скоростта на винта в твърда среда и скоростта на кораба, измерена по прокладка.", "Скоростта на винта в твърда среда и скоростта на винта във водата.", "Скоростта на винта в твърда среда и скоростта на кораба, измерена с GPS.","В" , "257 ."],
[ "  Упорът, създаван от винта е най-голям, когато скоростта на плъзгане на винта е:", "Нула.", "Максимална.", "Умерена.", "Минимална.","А" ,"258 ."],
[ "  Скоростта на плъзгане на винта е максимална, когато винтът се върти, а кораба:", "Е на швартови.", "Се движи с максимална скорост.", "Намалява скоростта си при работещ двигател.", "Увеличава скоростта си.","А" , "259 ."],
[ "  Как се настройват за паралелна работа дизелгенератор/ДГ/ и турбогенератор/ТГ/?", "С еднакъв статизъм за равномерно разпределение на товара.", "С по-голям статизъм на ДГ и по- малък на ТГ.", "С нулев статизъм на ДГ и голям на ТГ.", "С нулев статизъм и на двата.","В" ,"260 ."],
[ "  Понятието “Работен режим на ГД” означава:", "Работа на ГД без промяна на външните условия.", "Работа на ГД при променливи външни условия.", "Работа на ГД без промяна на параметрите му.", "Съвкупност от условия , при които протича работния процес на ГД.","Г" , "261 ."],
[ "  Работният режим на Гл.КДВГ се счита за “оптимален”, когато последният:", "Достигне номинална честота на въртене.", "Достигне номиналната мощност.", "Достигне предварително зададен критерий.", "Работи с максимално допустими мощност и честота на въртене.","В" ,"262 ."],
[ "  Кой от изброените косвени показатели отразява най-точно развиваната от КДВГ мощност?", "Указателя на натоварването на всережимния регулатор.", "Температурата на изходящите газове.", "Максималното налягане на горене.", "Произведението от показателя на натоварването и честотата на въртене.","Г" , "263 ."],
[ "  Какъв способ на регулиране на количеството гориво се постига в ГПВН на Гл.КДВГ, снабдени със системата VIТ?", "Променливо начало на подаване и постоянен край.", "Променлив край на подаване и постоянно начало.", "Променливи начало и край на подаване.", "Постоянни начало и край на подаване.","В" ,"264 ."],
[ "  Какво означава терминът „топлинна хлабина на клапана” при КДВГ?", "Хлабината между кобилицата и повдигача на клапана.", "Хлабината между диска на клапана и седлото.", "Хлабината между гърбицата на разпределителния вал и повдигача на клапана.", "Хлабината между стеблото на клапана и втулката.","А" , "265 ."],
[ "  Някои КДВГ са с въртящи се клапани. Каква е причината за това?", "Разпределяне на изгорелите газове с цел осигуряване на по-добро очистване.", "Предпазване на клапанното стебло от засядане.", "Недопускане получаването на нагар по уплътнителните повърхности и увеличаване на междуремонтния период.", "Разпределяне на пресния заряд въздух с цел осигуряване на по-добро горене.","В" ,"266 ."],
[ "  Какво е предназначението на предпазителния клапан на цилиндровата глава на КДВГ?", "Предпазва КДВГ от работа с налягане в цилиндрите, превишаващо допустимата стойност на Pz.", "Регулира налягането в цилиндъра до безопасно работно налягане.", "Клапанът спира аварийно двигателя.", "Индицира за претоварване на двигателя.","А" , "267 ."],
[ "  По какъв начин се регулира налягането на отваряне на горивния клапан (дюзата) на ДВГ?", "Чрез активният ход на буталцето на ГПВН.", "Чрез промяната на натяга на пружината на дюзата.", "Чрез регулирането на преливния клапан на ГПВН.", "Чрез регулирането на разпределителния вал.","Б" ,"268 ."],
[ "  За постигане на най-добро изгаряне на горивото в КДВГ е необходимо следното:", "Плътна струя гориво, насочена към горната част на цилиндровата втулка.", "Плътна струя гориво, насочена към долната нагрята част на цилиндровата глава.", "Плътна струя гориво, обливаща горещата горивната камера.", "Разпрашаване на впръскваното в горивната камера гориво.","Г" , "269 ."],
[ "  По какъв начин се регулира количеството гориво подавано от ГПВН разпределителен тип при работещ двигател?", "Чрез регулиране дължината на пълния ход на буталцето на помпата.", "Чрез регулиране на дебита на гориво към ГПВН.", "Чрез завъртане на буталцето или втулката в зависимост от натоварването на двигателя.", "Чрез регулиране нагнетатаелния клапан на помпата.","В" ,"270 ."],
[ "  Основното предназначение на нагнетателния клапан на ГПВН на КДВГ е:", "Да предотврати връщането на гориво от тръбите за гориво ВН в периода между ходовете на буталцето на помпата.", "Да предотврати навлизане на гориво към тръбите за гориво ВН в периода между ходовете на буталцето на помпата.", "Да регулира количеството гориво впръсквано в двигателя.", "Да регулира момента на запалване.","А" , "271 ."],
[ "  За разлика от изпускателните клапани, смукателните клапани на някои КДВГ могат да бъдат от нисколегирана стомана, защото:", "Скосената периферия на смукателните клапани осигурява самоцентроване при “сядане” на клапана.", "Смукателните клапани имат стелитово покритие, което намалява степента на износване.", "Количеството въздух, което преминава през смукателните клапани е по-малко от това, което преминава през изпускателните клапани.", "Смукателните клапани са по-малко изложени на корозионното действие на отработените газове.","Г" ,"272 ."],
[ "  При регулатор тип PGA при използване на масло с вискозитет, различен от този, който се препоръчва от производителя е необходимо:", "Да се регулира отварянето на превключващия клапан.", "Да се регулира игления клапан.", "Да се натегне компенсационната пружина.", "Не се препоръчва използването на такова масло.","Г" , "273 ."],
[ "  Склонността на дизеловите горива към възпламеняване /при нормално работеща горивна апаратура/ се обуславя от:", "Фракционния състав на горивото.", "Вискозитета и вискозитетния индекс на горивото.", "Пламната точка на горивото.", "Съдържанието на сяра в горивото.","А" ,"274 ."],
[ "  Охлаждането на въздуха след турбокомпресорните агрегати води до: ", "Увеличаване на специфичния обем и намаляване на температурата му. ", "Увеличаване на плътността и намаляване на температурата му. ", "Увеличаване на специфичния обем и плътността и намаляване на температурата му. ", "Намаляване на специфичния обем и увеличаванена температурата му. ", "Б" ,"275 ."],
[ "  Лагерите при компресорната част на турбокомпресорните агрегати от VTR реда са: ", "Ролкови лагери. ", "Съчмени лагери. ", "Ролкови и съчмени лагери. ", "Плъзгащи лагери. ", "Б" ,"276 ."],
[ "  Възможно ли е помпажът да е следствие на причини извън турбокомпресорния агрегат? ", "Да, възможно е. ", "Не е възможно. ", "Възможно е само при големите ТКА. ", "Възможно е само при малките ТКА. ", "А" ,"277 ."],
[ "  Коя система за принудително пълнене е с по-висок К.П.Д. на турбинната част? ", "С постоянно налягане на газовете пред турбинната част. ", "С преобразователи на импулси. ", "С променливо налягане пред турбинната част. ", "С механичен привод на компресора. ", "А" ,"278 ."],
[ "  Предимствата на импулсната система за принудително пълнене на КДВГ са: ", "По-доброто използване на енергията на изходящите газове от КДВГ. ", "По-качественото продухване и напълване на цилиндрите. ", "Налягането на продухващия въздух не се променя при намаляване на оборотите на КДВГ. ", "Температурата на продухващия въздух не се променя при намаляване на оборотите на КДВГ. ", "А" ,"279 ."],
[ "  Разликата между импулсна система и система с постоянно налягане при ТКА се състои в: ", "Лопатките на турбината. ", "Продухвателните клапани на двигателя. ", "Ресивера за изгорели газове. ", "Охладителите за продухвателен въздух. ", "В" ,"280 ."],
[ "  Кое може да бъде причина за помпаж на ТКА? ", "Неизправност на маслената помпа. ", "Замърсени лопатки на ротора. ", "Замърсяване на охладителя за продухвателен въздух от въздушната страна. ", "Износване на лагерите на ТКА. ", "В" ,"281 ."],
[ "  Каква може да е причината за появата на вибрации при ТКА: ", "Замърсен въздушен филтър на входа. ", "Намалени обороти на ТКА. ", "Износени лабиринтни уплътнения на ТКА. ", "Роторът на турбината не е балансиран. ", "Г" ,"282 ."],
[ "  При пълно натоварване на главния двигател оборотите на ТКА са твърде ниски. Каква може да бъде причината? ", "Повреден дифузор. ", "Неизправна помпа за смазващо масло. ", "Температурата на изгорелите газове на главния двигател е твърде висока. ", "Замърсен дюзов апарат. ", "Г" ,"283 ."],
[ "  Двутактовият двигател обикновено има спомагателен нагнетателен вентилатор (въздуходувка), който се използва: ", "Продължително, заедно с ТКА с цел осигуряване на достатъчно въздух при работа на двигателя с пълна мощност. ", "При дълъг преход на кораба и продължителна работа на двигателя при ниски обороти. ", "При пожар в подбуталното пространство на двигателя, което ще помогне за потушаване на пожара. ", "По време на извършване на маневра. ", "Г" ,"284 ."],
[ "  Висока температура на изгорелите газове на всички цилиндри при 4-тактов тронкови дизел може да се получи при: ", "Неработещ турбокомпресор. ", "Недостатъчно налягане на горивото. ", "Претоварване на един от цилиндрите. ", "Неравномерно разпределение на товара по цилиндри. ", "А" ,"285 ."],
[ "  Скоростта на въртене на турбокомпресора зависи от: ", "Оборотите на двигателя. ", "Товара на двигателя. ", "Налягането на всмукателния ресивер. ", "Атмосферното налягане. ", "Б" ,"286 ."],
[ "  Една от функциите на въздушния ресивер на КДВГ е: ", "Да изсуши въздуха постъпващ от междинния охладител. ", "Да намали пулсацията на системата. ", "Да събере изходящият въздух от въздушните устройства. ", "Да изчисти въздуха от маслени капки. ", "Б" ,"287 ."],
[ "  Коя от изброените системи за принудително пълнене е с най-малък КПД на турбинната част? ", "Системата с променливо налягане пред турбината/импулсна/. ", "Системата с постоянно налягане пред турбината. ", "Системата с преобразователи на импулси. ", "Смесената система. ", "А" ,"288 ."],
[ "  При парните котли на опасност от нискотемпературна корозия е подложена: ", "Въздушната страна на въздухоподгревателя. ", "Газовата страна на въздухоподгревателя. ", "Парната страна на паропрегревателя. ", "Всички страни. ", "Б" ,"289 ."],
[ "  Коя е причината за накипообразуването в парния котел? ", "Твърдостта на водата. ", "Алкалността на водата. ", "Наличието на разтворен кислород във водата. ", "Солеността на водата. ", "А" ,"290 ."],
[ "  Високотемпературната корозия в парните котли се проявява: ", "Вътре в пароводния колектор. ", "Вътре в подемните тръби. ", "Нито едно от изброените. ", "В парната част на колектора. ", "В" ,"291 ."],
[ "  Регулирането на производителността на механичните нерегулируеми центробежни горелки при парните котли в по-широк диапазон става чрез: ", "Смяна на разпръскващата шайба на горелката. ", "Промяна на оборотите на горелката. ", "Не може да се осъществи. ", "Промяна на оборотите на мотора. ", "А" ,"292 ."],
[ "  Твърдостта на котелната вода се дължи основно на: ", "Внесените в нея химикали за водообработка. ", "Внасяните с питателната вода соли на калция и магнезия. ", "Внасяните с питателната вода соли на хлора. ", "Внасяните с питателната вода соли на натрия. ", "Б" ,"293 ."],
[ "  Какво влияние ще окаже върху ТКА по- късното подаване на гориво и високата температура на изгорелите газове: ", "Повишаване оборотите на ТКА. ", "Понижаване на оборотите на ТКА. ", "Помпаж на ТКА. ", "Повишаване температурата на продухвателния въздух. ", "А" ,"294 ."],
[ "  Най-голямо количество соли във водната система на котела се съдържат в: ", "Котелната вода. ", "Питателната вода. ", "Кондензата. ", "Топлия сандък. ", "А" ,"295 ."],
[ "  Какво е предназначението на деаератора в системата за питателна вода на котела? ", "Отстраняване на излишния кислород от питателната вода. ", "Отстраняване на излишния водород от питателната вода. ", "Отстраняване на излишния азот от питателната вода. ", "Отстраняване на излишната сяра от питателната вода. ", "А" ,"296 ."],
[ "  Кое от следните твърдения, отнасящи се до водотръбните и огнетръбните котли, е вярно? ", "Огнетръбните котли имат по-голяма възможност да работят при по-високо налягане на парата. ", "Водотръбните котли могат да работят за кратък период от време без вода, докато горелката работи. ", "Водотръбните котли са по- ефективни и имат по-малко водосъдържание. ", "Огнетръбните котли нямат невъзвратни клапани на питателната система. ", "В" ,"297 ."],
[ "  Кое от посочените твърдения описва механизма на химичен процес, който протича във водата при работа на котела? ", "Водата става леко проводима и намалява топлообмена. ", "Образуването на въглеродна киселина увеличава киселинността на водата и понижава рН фактор. ", "Образуването на сярна киселина намалява киселинността на водата и повишава рН фактора. ", "Водата става силно проводима и увеличава топлообмена. ", "Г" ,"298 ."],
[ "  Какво качество трябва да има питателната вода за нормална работа на котела? ", "Стойност на рН ~ 7.5. ", "Водата да бъде слабо солена. ", "Водата да бъде обогатена с H2 C5 OH. ", "Водата да бъде обогатена на кислород. ", "А" ,"299 ."],
[ "  Защо е важно да се поддържа рН на кондензата на котелната уредба в допустимите граници? ", "За неутрализиране на киселините в кондензата. ", "За предотвратяване на кислородната корозия. ", "За предотвратяване образуването на шлам във водата. ", "За намаляване на фосфатното число на водата. ", "А" ,"300 ."],
[ "  Ако нивото на водата не може да се види в долната част на нивомерното стъкло на котела, кои от посочените действия трябва незабавно да се предприемат? ", "Увеличаване подаването на питателна вода към котела. ", "Извършване на горно продухване на котела. ", "Извършване на долно продухване на котела. ", "Спиране на горелката на котела. ", "Г" ,"301 ."],
[ "  Електромагнитните горивни клапани на горелката на котела трябва да бъдат от тип “принудително възстановяване”: ", "Така, че операторът да може да изключи всяка горелка по време на блекаут. ", "Така, че операторът да може да изключи всяка горелка след блекаут. ", "За предотвратяване напълването на пещта с гориво при прекъсване на електрозахранването. ", "За предотвратяване напълването на пещта с гориво при възстановяване на електрозахранването. ", "Г" ,"302 ."],
[ "  Коя от посочените характеристики на горивото е причина за възникването на проблеми при процесите прехвърляне/изпомпване на горива и възпламеняване в горивната камера на ДВГ? ", "Точката на запалване на горивото. ", "Точката на възпламеняване на горивото. ", "Относителното тегло на горивото. ", "Вискозитетът на горивото. ", "Г" ,"303 ."],
[ "  Когато рН факторът на котелната вода намалява към “0”, водата става: ", "Мека. ", "С алкална реакция. ", "С неутрална реакция. ", "С кисела реакция. ", "Г" ,"304 ."],
[ "  При работа на КДВГ с нискосернисти горива се употребяват цилиндрови масла с: ", "Високо алкално число. ", "Ниско алкално число. ", "Алкалното число не е от значение. ", "С по-голям вискозитет. ", "Б" ,"305 ."],
[ "  При еднакъв индукционен период, по- високата изпаряемост на горивото: ", "Увеличава твърдостта на работа на двигателя. ", "Намалява твърдостта на работа на двигателя. ", "Твърдостта на работа на двигателя не се променя. ", "Твърдостта на работа на двигателя не зависи от горивото. ", "А" ,"306 ."],
[ "  Високоалкалните цилиндрови масла се използват при работа на КДВГ: ", "С гориво, съдържащо сяра до 1 %. ", "С гориво, съдържащо сяра над 3 %. ", "С дестилатни горива. ", "С гориво, съдържащо сяра под 3 %. ", "Б" ,"307 ."],
[ "  Кое обуславя работния температурен диапазон на маслата? ", "Вискозитетът им в сантистокси при 40 °С. ", "Вискозитетът им в сантистокси при 100 °С. ", "Техният вискозитетен индекс. ", "Вискозитетът им в сантистокси при 200 °С. ", "В" ,"308 ."],
[ "  Циркулационните масла за кръстоглавни КДВГ в сравнение с тези за тронкови имат: ", "По-голямо алкално число. ", "По-малко алкално число. ", "По-голяма термична стабилност. ", "По-малка термична стабилност. ", "Б" ,"309 ."],
[ "  В циркулационната маслена система на тронков КДВГ, предназначението на маслото най-вече е да: ", "Смазва триещите се детайли. ", "Охлажда цилиндровите втулки. ", "Повиши плътността между втулката и буталните пръстени. ", "Повиши плътността в буталните пръстени. ", "А" ,"310 ."],
[ "  Понятието коксово число дава представа за склонността на горивата към: ", "Нагарообразуване. ", "Корозионна активност. ", "Асфалтосмолисти отлагания. ", "Киселинна устойчивост. ", "А" ,"311 ."],
[ "  Какво се разбира под вискозитет на горивото? ", "Температурата му на самовъзпламеняване. ", "Еднородността на горивото. ", "Вътрешното триене на молекулите на горивото. ", "Фракционен състав на горивото. ", "В" ,"312 ."],
[ "  Цилиндровите масла на КДВГ трябва да имат: ", "Висока термична стабилност. ", "Висока смазваща способност. ", "А) и Б). ", "Нисък вискозитет. ", "В" ,"313 ."],
[ "  Корозионните свойства на дизеловите горива се характеризират от: ", "Съдържанието на водоразтворими основи. ", "Съдържанието на водоразтворими киселини. ", "Съдържанието на сяра и нейните съединения. ", "Съдържанието на манган и тежки метали. ", "В" ,"314 ."],
[ "  При Гл.КДВГ, неутрализирането на сярата която се съдържа в горивото става главно чрез: ", "Използване на прибавки в цилиндровото масло. ", "Сепариране на горивото в режим кларификация. ", "Сепариране на горивото в режим пурификация. ", "Специална обработка на горивото във филтри. ", "А" ,"315 ."],
[ "  Алкалността на цилиндровото масло показва неговата способност да неутрализира : ", "Съдържащата се в горивото влага. ", "Съдържанието на твърди примеси в горивото. ", "Съдържанието на сяра в горивото. ", "Съдържанието на манган в горивото. ", "В" ,"316 ."],
[ "  Каква е обикновено причината за корозия на лагерите на КДВГ: ", "Оксидирано смазочно масло. ", "Влажност на средата в картера. ", "Влажен продухвателен заряд. ", "Ниска температура на смазочното масло. ", "А" ,"317 ."],
[ "  При работа на кръстоглавни КДВГ с нискосернисти горива се употребяват цилиндрови масла с: ", "Високо алкално число. ", "Ниско алкално число. ", "Високо фосфатно число. ", "Ниско фосфатно число. ", "Б" ,"318 ."],
[ "  Наличието на ванадий в горивата води до: ", "Усилено нагарообразуване. ", "Намалено нагарообразуване. ", "Корозионни проблеми. ", "Асфалтосмолисти отлагания. ", "В" ,"319 ."],
[ "  Защо е важно вискозитетът на смазочното масло на КДВГ да се поддържа в работни граници? ", "За да се запази масления филм между взаимно триещите се метални повърхности. ", "Смазването не зависи от вискозитета на смазочното масло . ", "За да се запазят добавките в маслото в добро състояние. ", "За да се подобри температурното състояние на смазваните детайли. ", "А" ,"320 ."],
[ "  При анализ на маслото на спомагателен КДВГ е установен вискозитет над допустимата стойност. Какви ще бъдат вашите действия? ", "Ще понижите температурата на охлаждащата вода на масления охладител. ", "Ще повишите температурата на охлаждащата вода на масления охладител. ", "Ще повишите налягането на смазващото масло. ", "Ще дренирате маслото, почистите системата и подмените маслото. ", "Г" ,"321 ."],
[ "  Каква може да бъде причината за повишаване вискозитета на смазващото масло на КДВГ? ", "Пропуск на тежко гориво в маслената система. ", "Пропуск на хидравлично масло от регулатора в маслената система. ", "Пропуск на вода в маслената система. ", "Висока температура на смазващото масло. ", "А" ,"322 ."],
[ "  Каква може да бъде причината за намаляване вискозитета на смазващото масло на КДВГ? ", "Пропуск на тежко гориво в маслената система. ", "Ниска температура на смазващото масло. ", "Понижено налягане на смазващото масло. ", "Пропуск на дизелово гориво в маслената система. ", "Г" ,"323 ."],
[ "  В маслената система на Гл.КДВГ е установено съдържание на вода по-високо от допустимото от производителя. Какви действия ще предприемете? ", "Изпаряване на водата чрез вакуумиране на системата. ", "Изпаряване на водата чрез повишаване на температурата на маслото. ", "Прехвърляне на маслото в отделен танк с цел продължително сепариране. ", "Повишеното съдържание на вода не оказва влияние на смазващите свойства на маслото. ", "В" ,"324 ."],
[ "  Главната цел за използване на цилиндрово масло при кръстоглавните КДВГ е: ", "Намаляване триенето между буталните пръстени и цилиндровата втулка. ", "Охлаждане на буталото и втулката. ", "Повишаване на ефективността на горене. ", "Предпазване на буталото и втулката от температурно претоварване. ", "А" ,"325 ."],
[ "  Какъв ефект върху качеството на смазващото масло на КДВГ ще има продължителната работа на маслото при прекомерно висока температура? ", "Сулфатизация и намаляване на вискозитета. ", "Изпаряване на маслото, което води до голяма консумация. ", "Окисляване и увеличаване на вискозитета. ", "Пламната точка на маслото ще се понижи. ", "В" ,"326 ."],
[ "  Защо трябва да се проверява центровката на подаване на цилиндрово масло при кръстоглавни КДВГ? ", "За подаване на масло в цилиндъра при точно определено положение на буталото. ", "За подаване на цилиндрово масло с постоянен дебит. ", "За поддържане на постоянно налягане на подаваното масло. ", "За избягване висока температура в горивната камера. ", "А" ,"327 ."],
[ "  Каква е целта на процеса сепариране на горивото за КДВГ? ", "Подобряване на фракционния състав на горивото. ", "Отстраняване на наличните твърди механични примеси и вода. ", "Поддържане на постоянно ниво в работния танк. ", "Отстраняване на взривоопасни газове от горивото. ", "Б" ,"328 ."],
[ "  Пламната точка на горивото за КДВГ трябва да бъде използвана за определяне на: ", "Най-високата температура, до която горивото може да бъде подгрято с цел разпрашаване. ", "Минималната температура, до която горивото може да бъде подгрято за прехвърляне. ", "Най-високата температура, до която горивото може да бъде подгрято в горивните танкове. ", "Минималната температура, до която горивото може да бъде подгрято в горивоподгревателя. ", "В" ,"329 ."],
[ "  Появяването на емулсия в маслената система на КДВГ води до: ", "Намаляване на образуването на слъдж в маслото. ", "Отделяне на водата от маслото. ", "Подобряване на вискозитета на маслото. ", "Изместване на маслото от триещите се повърхности. ", "Г" ,"330 ."],
[ "  Моторните свойства на дизеловите горива се обуславят от: ", "Пламната температура. ", "Топлотворната способност. ", "Груповият и фракционен състав. ", "Съдържанието на кислород. ", "В" ,"331 ."],
[ "  Смазочните свойства на маслата зависят от: ", "Нивото на химически активните вещества в него. ", "Нивото на повърхностно-активните вещества в него. ", "Вискозитета и неговият индекс. ", "Нивото на цетан в него. ", "Б" ,"332 ."],
[ "  Вискозитетният клас на маслото изразява: ", "Неговата смазочна способност. ", "Неговата антизадирна способност. ", "Неговата съпротивляемост срещу външно натоварване. ", "Неговата противопенна способност. ", "В" ,"333 ."],
[ "  Равенството на кои параметри дава право за сравнение на показателите на две индикаторни диаграми? ", "Честота на въртене. ", "Ъгъл на изпреварване на подаването на гориво. ", "Циклова порция гориво. ", "А) и В). ", "Г" ,"334 ."],
[ "  Кой от посочените ефективни показатели може да бъде получен чрез пряко измерване? ", "Ефективният въртящ момент. ", "Ефективната мощност. ", "Ефективният К.П.Д. ", "Средното ефективно налягане за цикъл. ", "А" ,"335 ."],
[ "  При какви условия се получава товарната характеристика? ", "При постоянен ефективен въртящ момент. ", "При постоянно циклово подаване на гориво. ", "При постоянна честота на въртене. ", "При постоянно задание към регулатора. ", "В" ,"336 ."],
[ "  Рязкото падане на налягането в парния котел може да доведе до: ", "Кипене в спускните тръби. ", "Кондензация в подемните тръби. ", "Отваряне на предпазния клапан. ", "Няма последици. ", "А" ,"337 ."],
[ "  Защо при съвременните Гл.КДВГ ъгълът на предварение на подаване на гориво е по- малък от оптималния? ", "С цел да се намалят топлинните напрежения. ", "С цел да се намалят механичните напрежения. ", "С цел да се намалят топлинните и механичните напрежения. ", "С цел да се намалят механическите загуби. ", "Б" ,"338 ."],
[ "  Коя от посочените характеристики може да се получи в корабни условия на дизелгенератор? ", "Товарна. ", "Външна номинална. ", "Ограничителна по въртящ момент. ", "Частична скоростна. ", "А" ,"339 ."],
[ "  Индикаторната диаграма, снета от цилиндър на КДВГ с механичен индикатор, има изрязана горна част. Какво ще предприемете? ", "Удължаване на задвижващия шнур. ", "Почистване и намазване на буталцето на индикатора. ", "Намаляване дължината на шнура. ", "Поставяне на по-твърда пружина на индикатора. ", "Г" ,"340 ."],
[ "  Каква е обикновено “Slow down/Shut down”-температурата на охлаждащата вода на изхода от бавнооборотен Гл.ГКДВГ?", "85 &#8451.", "80 &#8451. ", "110 &#8451.", "95 &#8451.", "Г" ,"341 ."],
[ "  Каква е обикновено “Slow down”- температурата на изхода на маслото от бавнооборотен Гл.КДВГ? ", "85 &#8451. ", "60 &#8451. ", "95 &#8451. ", "70 &#8451. ", "Г" ,"342 ."],
[ "  Каква е обикновено “Slow down”- температурата за охлаждането на въздушния ресивер на средно и високооборотни СДГ? ", "40 &#8451. ", "50 &#8451. ", "120 &#8451. ", "140 &#8451. ", "В" ,"343 ."],
[ "  Коя от следните причини води до помпаж на ТКА? ", "Повреда в маслената помпа. ", "Замърсяване на въздухоохладителя от въздушната страна. ", "Замърсени подвижни лопатки на ротора на турбината и неподвижни на направляващия апарат. ", "Износени лагери на ТКА. ", "Б" ,"344 ."],
[ "  Какво е обикновено “Shut down”- налягането на входа на маслото към маслената магистрала на бавнооборотен Гл.КДВГ? ", "0.5 Bar. ", "0.7 Bar. ", "1.5 Bar. ", "0.9 Bar. ", "В" ,"345 ."],
[ "  Как ще се отрази намалението на ъгъла на предварение на подаване на гориво върху работата на ТКА? ", "Повишават се оборотите на ТКА. ", "Понижават се оборотите на ТКА. ", "По-високи температури на газа и въздуха след ТКА. ", "Помпаж на ТКА. ", "А" ,"346 ."],
[ "  Кое е вярното за режима на кларификация на сепараторите за горива и масла? ", "При кларификацията се отделят предимно механични примеси, вода в по-малка степен. ", "Кларификацията се извършва при по- висока от пурификацията Т на флуида. ", "Кларификацията обикновено предхожда пурификацията . ", "Всичко изброено. ", "А" ,"347 ."],
[ "  Повишава ли турболентността ефекта от топлообмена в пластинков тип охладители? ", "Да. ", "При тези охладители няма условия за турболентност. ", "Не. ", "Само при определени температури. ", "А" ,"348 ."],
[ "  Каква е вероятната причина за синеещ тъмен цвят на изгорелите газове на Гл.КДВГ? ", "Лошо гориво. ", "Твърде много цилиндрово масло за един или повече цилиндри. ", "Студена машина. ", "Замърсени филтри на ТКА и въздушен охладител. ", "Б" ,"349 ."],
[ "  Внезапното понижаване на налягането в циркулационната маслена система на КДВГ може да се дължи на: ", "Прекъсване на подаването на масло към някой от основните лагери. ", "Пробив в маслен тръбопровод или съединение. ", "Проблем с вискозитета на маслото. ", "Всичко изброено. ", "Б" ,"350 ."],
[ "  Плавното понижаване на налягането на маслото на КДВГ с повишаване на работната му температура може да се дължи на: ", "Проблеми с вискозитетния индекс на маслото. ", "Големи хлабини в основни или мотилеви лагери. ", "Попадане на леко гориво в маслото. ", "Всичко изброено. ", "Г" ,"351 ."],
[ "  Кое твърдение е най-вярното за среднооборотни тронкови КДВГ, работещи на тежко гориво? ", "Температурата на охлаждащата вода след охладителя е около 80 &#8451. ", "Температурата на въздуха след интеркулера е около 80 &#8451. ", "Температрата на маслото след охладителя е около 80 &#8451. ", "Температурата на горивото пред ГПВН е около 80 &#8451. ", "А" ,"352 ."],
[ "  Някои четиритактови КДВГ имат охлаждане на дюзите. Защо? ", "Облекчава се техническото обслужване на дюзите. ", "Охлаждайки дюзата, поддържаме и вискозитета на горивото в норми, преди разпръскване. ", "Предпазва се разпръсквача от прегряване. ", "Намаляват се топлинните напрежения в главата на КДВГ. ", "Б" ,"353 ."],
[ "  Температурата на охлаждащата вода расте при всички останали нормални параметри. Причината е: ", "Морската вода попада в сладкия контур през неплътности в охладителите. ", "Количеството на добавките в охлаждащата сладка вода са недостатъчни. ", "Ниското ниво на охлаждаща вода в разширителната цистерна. ", "Налягането след помпата при центробежна помпа морска вода. ", "Г" ,"354 ."],
[ "  Коя от функциите се изпълнява от системата за химическо третиране на морската охлаждаща вода? ", "Всички изброени. ", "Намаля общото количество, необходимо за охлаждане. ", "Ограничава корозията, предпазва от накипи, контролира развитието на флората и фауната в охлажданите пространства. ", "Повишава коефициента на топлопренасяне на флуида. ", "В" ,"355 ."],
[ "  Ако вискозитетът на маслото на спомагателен двигател се понижи, вследствие от разреждане с леко гориво, кое от посочените действия е правилното? ", "Подменяме част от маслото до нормализиране на налягането му в системата. ", "Почистваме системата и подменяме маслото. ", "Увеличаваме охлаждането и намаляме температурата , като така нормализираме налягането. ", "И трите действия са правилни. ", "Б" ,"356 ."],
[ "  Кое определя големината на цикловата порция гориво /височината на полезния ход на буталцето/ при ГПВН разпределителен тип /тип BOSCH/ при КДВГ? ", "Отсечният и преливен клапани на ГПВН. ", "Дюзата. ", "Регулаторът за обороти на КДВГ. ", "Нагнетателният клапан на ГПВН. ", "В" ,"357 ."],
[ "  Коя е причината пластинчатият тип охладители да работят с ограничение за налягането в тях до 10 Bar? ", "Всичко изброено. ", "Трудности по херметизацията. ", "Опасност от деформация на елементите. ", "Капацитет на използваните помпи. ", "Б" ,"358 ."],
[ "  Кой тип помпи са най-подходящи за използване като захранващи помпи за трюмните сепаратори? ", "Зъбни помпи. ", "Вихрови помпи. ", "Бутални помпи. ", "Винтови помпи. ", "Г" ,"359 ."],
[ "  За флуиди с по-голямо относително тегло и плътност отворът на гравитационния регулиращ диск на сепаратора трябва да е : ", "С по-голям размер. ", "С по-малък размер. ", "Отворът не е от значение. ", "Със същият размер. ", "А" ,"360 ."],
[ "  От кои три параметъра зависи коефициента на бързоходност на центробежните помпи? ", "Обороти, диаметър на работно колело, дебит. ", "Дебит, напор, диаметър на работно колело. ", "Напор, дебит, обороти на работно колело. ", "Обороти, диаметър на работно колело, напор. ", "В" ,"361 ."],
[ "  Кое твърдение е вярно за центробежните помпи? ", "Биват три вида - с извити по посока на въртенето лопатки/напред/, с радиални лопатки и с извити назад лопатки. ", "Извитите напред лопатки теоретично дават по-малък напор. ", "Извитите назад лопатки се използват при центробежни вентилатори. ", "Верни са и трите твърдения. ", "А" ,"362 ."],
[ "  За какво сигнализира високото количество на калай при анализ на маслото на КДВГ? ", "Увреждане на лагерите. ", "Износване на бутални пръстени. ", "Износване на маслени помпи. ", "Калай в маслото винаги има. ", "А" ,"363 ."],
[ "  Какъв тип масла се използват в лубрикаторите при кръстоглавни Гл.КДВГ? ", "Синтетични. ", "Детергиращи. ", "Високоалкални. ", "Депресивно-дисперсивни. ", "В" ,"364 ."],
[ "  Каква е вероятната причина за високата температура на изгорелите газове на Гл.КДВГ? ", "Разтегната верига, замърсен ТКА, забити филтри на центробежния компресор. ", "Много висока температура на горивото. ", "Много малка топлинна хлабина в клапаните. ", "Гориво с много тесен фракционен състав. ", "А" ,"365 ."],
[ "  Каква е вероятната причина за високата температура на изходящите газове на един цилиндър? ", "Разтегната верига, замърсен ТКА, забити филтри на центробежния компресор. ", "Много висока температура на горивото. ", "Прокапваща дюза. ", "Малък ъгъл на предварение на подаване на гориво. ", "В" ,"366 ."],
[ "  Ако водата в маслото образува емулсия, може ли сепарирането да отстрани водата? ", "Само при високи температури на подгрев. ", "Да, при режим кларификация, във всички случаи. ", "Не, в никакви режими. ", "Водата се отделя при флотация/утаяване/ при високи температури. ", "В" ,"367 ."],
[ "  Как се променя вискозитета на маслото, ако в него попадне вода? ", "Визкозитетът се повишава. ", "Не се променя. ", "Присадките в маслата игнорират действието на водата. ", "Визкозитетът намалява. ", "А" ,"368 ."],
[ "  Колко трябва най-малко да е пламната точка на картерните масла на СДГ? ", "150 &#8451. ", "200 &#8451. ", "250 &#8451. ", "300 &#8451. ", "Б" ,"369 ."],
[ "  Кой от посочените индикаторни показатели може да бъде получен директно чрез измерване с механичен индикатор? ", "Индикаторната работа. ", "Индикаторната мощност. ", "Индикаторният КПД. ", "Нито един от посочените. ", "Г" ,"370 ."],
[ "  Кои индикаторни показатели трябва да се измерят, за да се получи индикаторния КПД? ", "Индикаторната диаграма и разходът на гориво. ", "Индикаторната мощност и индикаторната работа. ", "Индикаторната мощност и ефективната мощност. ", "Ефективната мощност и разходът на гориво. ", "А" ,"371 ."],
[ "  Какви загуби в повече отчита индикаторният КПД от термодинамичния? ", "Загубите от изгорелите газове. ", "Загубите от охладителната система. ", "Загубите от несъвършеното горене и топлообмена. ", "Загубите от изпускателната система. ", "В" ,"372 ."],
[ "  При постоянна циклова порция, кой от посочените показатели нараства най- силно с увеличаване на честотата на въртене? ", "Средното ефективно налягане. ", "Индикаторната работа. ", "Индикаторната мощност. ", "Ефективният въртящ момент. ", "В" ,"373 ."],
[ "  При постоянна циклова порция с увеличаване на оборотите, коя фаза на горенето се променя най-много, мерено по ъгъл на завъртане на коляновия вал? ", "Първата фаза (задържане на самовъзпламеняването). ", "Втората фаза (самовъзпламеняване и бързо горене). ", "Третата фаза (умерено горене с бавно намаление на налягането). ", "Четвъртата фаза (доизгаряне). ", "А" ,"374 ."],
[ "  При изменение на първата фаза на горенето (задържане на самовъзпламеняването), кой от посочените показатели се изменя най- силно? ", "Средното индикаторно налягане. ", "Максималната температура. ", "Максималното налягане. ", "Индикаторната мощност. ", "В" ,"375 ."],
[ "  При постоянна честота на въртене с увеличение на цикловата порция, коя от посочените фази на горенето не се променя? ", "Първата фаза (задържане на самовъзпламеняването). ", "Втората фаза (самовъзпламеняване и бързо горене). ", "Първата и втора фази. ", "Третата(умерено горене с бавно намаление на налягането) и четвърта фази(доизгаряне). ", "В" ,"376 ."],
[ "  При увеличаване на температурата на въздуха на входа на цилиндъра, коя от фазите на горенето се намалява? ", "Първата фаза (задържане на самовъзпламеняването). ", "Втората фаза (самовъзпламеняване и бързо горене). ", "Първата и втора фази. ", "Трета(умерено горене с бавно намаление на налягането) и четвърта фази (доизгаряне). ", "В" ,"377 ."],
[ "  Кой от изброените показатели се използва при проверка и регулиране позицията на гърбиците на ГПВН - клапанен тип? ", "Ъгълът(сумарен) на статичната продължителност на подаване на гориво. ", "Активният ход на плунжера при зададена позиция на органа за управление на ГПВН. ", "Ъгълът на статично начало на подаване при номинална мощност на двигателя. ", "Ъгълът на динамично начало на подаване при номинална мощност на двигателя. ", "В" ,"378 ."],
[ "  Коя от изброените повреди довежда до нагароотлагане и запушване на сопловите отвори на горивните клапани на КДВГ? ", "Задържането и заклинване на иглите на разпръсквачите. ", "Износването на иглата и тялото на разпръсквачите по направляващата част. ", "Нарушаването херметичността по уплътняващия конус в разпръсквача. ", "Недопустимото износване на сопловите отвори. ", "В" ,"379 ."],
[ "  Кое от изброените последствия ще предизвика попадането на масло в охладителната система на КДВГ? ", "Покачване на температурата на охлаждащата вода. ", "Нарушаване режима на работа на циркулационните помпи. ", "Покачване температурата на охлажданите детайли. ", "Всичко изброено. ", "В" ,"380 ."],
[ "  Коя от изброените причини предизвиква понижаване на еластичността на буталните пръстени на КДВГ? ", "Недостатъчно мазане при работа. ", "Голямо специфично налягане. ", "Значително нагряване при работа. ", "Ефект на умора на материала. ", "В" ,"381 ."],
[ "  Коя от изброените причини налага гарантирането на чистотата или състава на протекторните сплави? ", "Постигане на добри якостно-механични качества. ", "Постигане на висока корозионна устойчивост. ", "Постигане на определен електроден потенциал. ", "Постигане на определен срок на експлоатация. ", "В" ,"382 ."],
[ "  Детергентно-диспергиращите свойства на маслата отразяват: ", "Тяхната способност за образуване на ниско- и високо-температурни отлагания. ", "Тяхната способност за очистване на ниско- и високо-температурни отлагания. ", "Тяхната способност за неутрализиране въздействието на попадналата в масло вода. ", "Тяхната способност за образуване на повърхностно активни противоизносващи покрития. ", "Б" ,"383 ."],
[ "  Всеки парен котел при всички условия на работа трябва да има независими едно от друго изправни питателни средства не по- малко от: ", "Едно. ", "Две. ", "Три. ", "Не се регламентира. ", "Б" ,"384 ."],
[ "  На всеки парен котел с работно налягане над 5 Bar се монтират водопоказателни стъкла: ", "Едно. ", "Две. ", "Три. ", "Не се регламентира. ", "Б" ,"385 ."],
[ "  Колко манометъра за показване на налягането в парното пространство трябва да има всеки парен котел? ", "Един. ", "Два. ", "Три. ", "Не се регламентира. ", "Б" ,"386 ."],
[ "  Какво е предназначението на невъзвратния клапан в смукателната част на центробежните помпи? ", "Да регулира потока през помпата. ", "Да облекчи старта, като разтоварва ел. мотора. ", "Да предпази помпата от дрениране. ", "Да осигури възможност за работа на помпата в паралел. ", "В" ,"387 ."],
[ "  По каква причина при клапаните на някои двигатели има ротокапи за превъртането им при работа? ", "За да се предпазят клапаните от заклинване. ", "За да разпределят по-добре изгорелите газове и въздуха, като така облекчат изпускането и смесеобразуването. ", "За да подобрят топлообмена с главата на цилиндъра. ", "За да се подобри припасването на уплътнителните повърхности и увеличи времето до ремонт. ", "Г" ,"388 ."],
[ "  От кой параметър зависи най-много дебита на центробежните помпи? ", "От смукателната височина. ", "От нагнетателната височина. ", "Не зависи от нагнетателните височини. ", "От общата височина. ", "Г" ,"389 ."],
[ "  От кой параметър зависи най-много дебита на обемните помпи? ", "От смукателната височина. ", "От нагнетателната височина. ", "От общата височина. ", "Не зависи от нагнетателните височини. ", "Г" ,"390 ."],
[ "  Ако цвета на повърхностния слой на бабита на основен лагер е черен и е с повишена твърдост, като по шийката на КВ има драскотини, каква е вероятната причина? ", "Двигателят е работил без масло. ", "Филтрирането на маслото е било некачествено. ", "Вода в маслото. ", "Антифрикционната композиция е некачествена. ", "В" ,"391 ."],
[ "  Каква е най-вероятната причина за прегряване на основните лагери от посочените? ", "Ниско налягане на маслото в маслената система. ", "Висока температура в МКО. ", "Вода в маслото. ", "Всички изброени. ", "А" ,"392 ."],
[ "  Кой от посочените показатели се изменя чувствително при преминаване от леко на тежко гориво и обратно при експлоатацията на КДВГ? ", "Ъгълът на началото на подаване на горивния клапан. ", "Максималното налягане на горивото. ", "Налягането на отваряне на горивния клапан. ", "Неравномерността на подаване на горивото. ", "Б" ,"393 ."],
[ "  Увеличаването на коя фаза на горивоподаване на КДВГ влошава най- много ефективността на горивния процес? ", "Фазата на задържане на впръскването. ", "Фазата на активно подаване. ", "Фазата на свободно изтичане. ", "Фазите на задържане и на свободно изтичане. ", "В" ,"394 ."],
[ "  Индикаторният КПД на двигателя е с най- голяма стойност, когато горенето започва: ", "Малко преди ГМТ. ", "Точно на ГМТ. ", "Малко след ГМТ. ", "Индикаторният КПД не зависи от началото на горенето. ", "А" ,"395 ."],
[ "  При постоянна мощност на механичните загуби, увеличението на натоварването на двигателя: ", "Увеличава механичният КПД. ", "Намалява механичният КПД. ", "Механичният КПД не се променя. ", "Намалява ефективния КПД. ", "А" ,"396 ."],
[ "  В кой от посочените случаи индикаторния КПД на съвременните главни корабни двигатели се повишава? ", "Ранно впръскване на горивото. ", "Износени бутални пръстени. ", "Износен горивен клапан (дюза). ", "Износена горивна помпа високо налягане. ", "А" ,"397 ."],
[ "  Когато максималното налягане се запазва постоянно с намаление на честотата на въртене: ", "Механичните напрежения нарастват. ", "Механичните напрежения намаляват. ", "Механичните напрежения остават постоянни. ", "Механичните напрежения намаляват, после остават постоянни. ", "А" ,"398 ."],
[ "  При какъв ъгъл на изпреварване на подаване на горивото работят главните корабни двигатели при номинално натоварване? ", "Оптимален за ефективния специфичен разход на гориво. ", "По-малък от оптималния. ", "По-голям от оптималния. ", "Със закъснение. ", "Б" ,"399 ."],
[ "  Каква може да е причината за увеличение на температурата на изгорелите газове само на един цилиндър при нормално работещ двигател: ", "Претоварване на цилиндъра. ", "Повреден разпръсквач на дюзата. ", "Намалено подаване на продухващ въздух в цилиндъра. ", "Всяко от горните. ", "Г" ,"400 ."],
[ "  При постоянна позиция на управляващия цикловата порция орган в ГПВН – кой от посочените показатели е причина за увеличаване цикловата порция при преминаването от леко на тежко гориво при експлоатация на КДВГ? ", "По-високата температура на горивото. ", "По-високата плътност на горивото. ", "Съдържанието на асфалто-смолисти вещества. ", "Цикловата порция не се променя. ", "Б" ,"401 ."],
[ "  Каква може да бъде причината за черния дим, излизащ от димохода на ГД? ", "Горивото не е било достатъчно подгрято. ", "Непълно горене, дължащо се на лошо смесообразуване в двигателя. ", "Горивото е с повишено съдържание на сяра. ", "Горивото е с повишено съдържание на вода. ", "Б" ,"402 ."],
[ "  Тъмен цвят на изгорелите газове на КДВГ може да се получи при: ", "Закъснение на запалването. ", "Вода в горивото. ", "По-висока температура на компресия. ", "Останал отворен стартов клапан. ", "А" ,"403 ."],
[ "  Състоянието на КДВГ може да се определи по цвета на изгорелите газове. Тъмният цвят означава: ", "Недостатъчна стойност на зададените обороти. ", "Претоварване на двигателя. ", "Запушени отвори на маслените сегменти. ", "Пълно горене. ", "Б" ,"404 ."],
[ "  Замърсени или частично запушени изпускателни прозорци при КДВГ могат да причинят: ", "Свръхобороти на КДВГ. ", "Невъзможност да се спре КДВГ. ", "Не променят качествата и параметрите на КДВГ. ", "Висока температура на изгорелите газове. ", "Г" ,"405 ."],
[ "  Може ли да има директна връзка между вала на парна турбина и гребния винт? ", "Може, но не е препоръчително. ", "Такива са начините за свързване при търговски кораби. ", "Няма такава връзка. ", "Такива са начините за свързване при военните кораби. ", "А" ,"406 ."],
[ "  Какво е предназначението на компенсаторите в парните тръбопроводи? ", "Да намалят максимално дължината на паропровода. ", "Осигуряват разширението на тръбопроводите от високите температури и налягания на парата. ", "Осигуряват нормално закрепване на паропроводите. ", "Осигуряват свободно закрепване на паропроводите. ", "Б" ,"407 ."],
[ "  Какво се смазва в парната турбина? ", "Лагерните възли, зъбните предавки на спомагателните механизми. ", "Ротора на турбината. ", "Диафрагмата на турбината. ", "Всичко изброено. ", "А" ,"408 ."],
[ "  Според принципа си на работа маслените системи на газовите турбини се делят на: ", "Системи за ниско и високо налягане. ", "Едноконтурни и двуконтурни. ", "Циркулационна, гравитационна и циркулационно-гравитационна. ", "Смесени системи. ", "В" ,"409 ."],
[ "  Посочете кой механизъм не е елемент от маслената система на газовите турбини? ", "Филтърът. ", "Центробежният сепаратор. ", "Разходната цистерна. ", "Нито едно от изброените. ", "Б" ,"410 ."],
[ "  Какво е предназначението на уплътнителната система на парната турбина? ", "Система, позволяваща отвеждането на пара от парните пространства на уплътнителните кутии. ", "Система, непозволяваща постъпването на масло в диафрагмата. ", "Система, непозволяваща постъпването на вода в направляващия апарат. ", "Система, непозволяваща постъпването на масло в статора. ", "А" ,"411 ."],
[ "  Предназначението на системата за подгряване, продухване и отвеждане на пара на парната турбина е: ", "Да осигури постоянно количество пара в турбината. ", "Да регулира количеството подавана пара. ", "Да осигури топлинно равновесие между неподвижните и подвижни части на парната турбина. ", "Да регулира количеството отвеждана пара. ", "В" ,"412 ."],
[ "  Кога работи системата за подгряване, продухване и отвеждане на пара? ", "Непрекъснато. ", "Включва се преди пускането на турбината. ", "При реверсиране на парната турбина. ", "Включва се при променливи режими на турбината. ", "Б" ,"413 ."],
[ "  Приборите за измерване на оборотите на ротора на главната парна турбина се наричат: ", "Щикмус. ", "Тахометър. ", "Торсиометър. ", "Скоростомер. ", "Б" ,"414 ."],
[ "  Торсиометъра е уред измерващ: ", "Мощността на вала на турбината. ", "Оборотите на парната турбина. ", "Оборотите на гребния вал. ", "Преместването на вала на турбината. ", "А" ,"415 ."],
[ "  Кой е основният начин за повишаване на икономичността на газовата турбина? ", "Повишаване на началната температура на работния газ. ", "Повишаване на количеството постъпващ въздух. ", "Понижаване на началната температура на работния газ. ", "Повишаване на количеството работен въздух. ", "А" ,"416 ."],
[ "  Какво се променя в структурата на материала, от който се изработват лопатките на газовите турбини, вследствие на високите температури при които работят? ", "Промяна на цвета на метала. ", "Появява се остатъчна деформация. ", "Поява на нагар по повърхността на лопатките. ", "Промяна на размерите на лопатките. ", "Б" ,"417 ."],
[ "  Според конструктивните си особености газовите турбини се делят на: ", "Работещи с ниски и високи температури на работното тяло. ", "Осеви и радиални газови турбини. ", "Работещи с ниски, средни и високи температури на работното тяло. ", "Главни и спомагателни. ", "Б" ,"418 ."],
[ "  Коефициента на полезно действие на газовите турбини е: ", "85 - 90 %. ", "45 - 50 %. ", "98 - 99 %. ", "25 - 30 %. ", "Г" ,"419 ."],
[ "  Каква е връзката между оборотите и коефициента на полезно действие на газовите турбини? ", "Обратнопропорционална. ", "Правопропорционална. ", "Няма такава връзка. ", "Квадратична. ", "Б" ,"420 ."],
[ "  Защо се препоръчва доливането на параобразен фреон? ", "По-безопасно е за работата на системата. ", "По-малко вода се вкарва в системата. ", "Може да се получи хидравличен удар при доливането на течен фреон. ", "Няма предимства доливането на парообразен фреон. ", "Б" ,"421 ."],
[ "  Защо е опасно да се долива друго масло в хладилните системи освен препоръчаното? ", "Маслото може да “замръзне” в системата. ", "Съществува опасност от пресичане на маслото. ", "Увеличава се разтворимостта на масло във фреона. ", "Всичко изброено. ", "Г" ,"422 ."],
[ "  Кой индикаторен показател можем директно да измерим от КДВГ? ", "Индикаторното налягане. ", "Средното индикаторно налягане. ", "Индикаторната работа. ", "Всички изброени. ", "А" ,"423 ."],
[ "  Можем ли да представим средното индикаторно налягане като работата извършена от единица работен обем? ", "Да. ", "Не. ", "Само за идеална топлинна машина. ", "Няма връзка между налягане и работа. ", "А" ,"424 ."],
[ "  Какъв е смисъла от снемането на сместената индикаторна диаграма? ", "Да видим как се променя линията на горенето около ГМТ и положението на ГМТ. ", "Получаваме информация за началото на горенето . ", "Получаваме информация за състоянието на цилиндро-буталната група. ", "Всичко изброено. ", "Г" ,"425 ."],
[ "  Коя от мощностите има определящо влияние върху техническата експлоатация на пропулсивния комплекс - MCR или SCR? ", "MCR, защото определя най-големите препоръчвани натоварвания. ", "SCR, защото е съобразена с условията за плаване, дори те да са различни от стандартните. ", "MCR, защото освен мощности, има и икономически приоритети, вложени от фирмите-производителки. ", "А) и В). ", "Б" ,"426 ."],
[ "  Ако при неизменно циклово подаване на горивото намалим оборотите на КДВГ, какви промени в параметрите му ще отчетем? ", "Натоварването ще се намали пропорционално на понижаването на оборотите. ", "Температурите на челото на буталото и цилиндровата втулка ще се повишат. ", "Температурите на челото на буталото и цилиндровата втулка ще се понижат, но натоварването ще се повиши. ", "Температурите на челото на буталото и цилиндровата втулка ще се повишат, механичното натоварване също. ", "Г" ,"427 ."],
[ "  Може ли коефициентът на механични загуби /механичният КПД / да бъде използван за преминаване от индикаторни в ефективни “Р” показатели при всички “n”? ", "Да, той представлява съответно тяхната разлика. ", "Не, както и не може да се получава от тях, защото се изменя силно с промяната на индикаторната мощност. ", "Да, но само при стендови изпитания. ", "Не, в сила е обратното - той се получава от тяхната съответна разлика при снет стендови протокол. ", "Г" ,"428 ."],
[ "  Коя характеристика на КДВГ определяме като скоростна характеристика? ", "Която се снема при постоянно циклово подаване на ГПВН. ", "Функционалната зависимост, която има за независима променлива величина оборотите на двигателя. ", "За която цикловото подаване на гориво се променя при всяко изследване. ", "Всичко изброено. ", "Б" ,"429 ."],
[ "  Кое твърдение не е вярно за винтовите характеристики? ", "Това са характеристики както на винта, който реализира упора, така и на КДВГ. ", "Типът на корабния корпус определя характера на стръмността й в по- голяма степен, отколкото обрастването на корпуса. ", "В първо приближение формата на графиката й е квадратична парабола за водоизместващи корпуси. ", "При “тежка” винтова хактеристика двигателя развива номиналната си мощност без да е достигнал номинални обороти. ", "В" ,"430 ."],
[ "  На кои кораби най-често се монтират двуконтурни парни котли и защо? ", "На пасажерски кораби поради по- голямата безопасност. ", "На ро-ро кораби и контейнеровози, поради по-малката нужда от спомагателна пара - утилизацията работи с много малки спирания. ", "На танкери, за да се избегне замърсяването на котловата вода от нефтопродукти. ", "На всички кораби, когато часовият разход на котела е по-важен от габаритите му. ", "В" ,"431 ."],
[ "  Какво е предназначението на радиалната хлабината между лопатките и външното колело на газовата турбина? ", "Позволява на лопаткита свободно да се разширяват. ", "Хлабината е основен елемент на охлаждащата система. ", "Намалява габаритите и теглото на турбината. ", "Намалява топлинното натоварване на турбината. ", "А" ,"432 ."],
[ "  Какви компресори се използват в газотурбинните уредби /ГТУ /? ", "Осеви, центробежни, винтови. ", "Ежекторни, центробежни. ", "Охлаждаеми, неохлаждаеми. ", "Радиално-бутални. ", "А" ,"433 ."],
[ "  Кои компресори имат най-широко проложение в ГТУ? ", "Охлаждаемите компресори. ", "Осевите компресори. ", "Ежекторните компресори. ", "Центробежните компресори. ", "Б" ,"434 ."],
[ "  Характеристиките на винтовите компресори в ГТУ са аналогични на: ", "Машини обемен тип. ", "Машини динамичен тип. ", "Обемните хидравлични задвижвания. ", "Нямат аналог. ", "А" ,"435 ."],
[ "  Предназначението на горивната камера в ГТУ е: ", "Да осигури необходимото количество пусков въздух. ", "Да съхранява работното тяло. ", "Да създаде газов поток със зададена температура за сметка на изгарянето на гориво във въздушна среда. ", "Да осигури необходимото количество работен въздух. ", "В" ,"436 ."],
[ "  Посочете какви температури приблизително се развиват в горивната камера на ГТУ? ", "1 500 – 2 000 °С. ", "3 000 – 4 000 °С. ", "4 500 – 7 000 °С. ", "5 000 – 10 000 °С. ", "А" ,"437 ."],
[ "  Какво се разбира под устойчивост на горивния процес в горивната камера в ГТУ? ", "Осигуряването на качествен горивен процес по време на работа на турбината. ", "Осигуряването на постоянно количество изгорели газове. ", "Осигуряването на постоянни температури на изгорелите газове. ", "Осигуряването на постоянно количество въздух. ", "А" ,"438 ."],
[ "  Каква е разликата при протичането на процеса на горене в горивните камери на ГТУ и КДВГ? ", "Горивният процес се извършва при голяма скорост на въздуха преминаващ през камерата. ", "В максималните температури на горене. ", "По начина на охлаждане на свежия въздух. ", "Няма такава разлика. ", "А" ,"439 ."],
[ "  Качественото смесообразуване в ГТУ се осигурява от: ", "Горивни помпи с налягане 50-60 МРа. ", "Разпръскващи устройства. ", "Горивни дюзи. ", "Дозиращи устройства. ", "В" ,"440 ."],
[ "  Показателите по които се съди за качествената работа на горивните дюзи на ГТУ са: ", "Механичните качества на материалите от които е направена дюзата. ", "Броя и големината на капките получени при разпръскването на горивото. ", "Температурата на горивото в момента на впръскване. ", "Визкозитета на горивото в момента на впръскване. ", "Б" ,"441 ."],
[ "  Има ли разлика в конструкцията на горивните дюзи при КДВГ и ГТУ? ", "Не, няма разлика. ", "Да, има разлика. ", "Разликата е във вида на използвания материал. ", "Зависи от конструкцията им. ", "Б" ,"442 ."],
[ "  Според вида си горивовпръскващите помпи в ГТУ най-често са: ", "Зъбни, бутални. ", "Динамичен тип. ", "Разпределителен тип. ", "Обемен тип. ", "А" ,"443 ."],
[ "  Устройствата подгряващи постъпващия в горивната камера на ГТУ въздух се наричат: ", "Охладители. ", "Регенератори. ", "Ресивери. ", "Конвертори. ", "Б" ,"444 ."],
[ "  При кои ГТУ имаме междинно охлаждане на въздуха? ", "При всички ГТУ. ", "При ГТУ с няколко степени на сгъстяване. ", "При ГТУ нямаме охлаждане на въздуха. ", "При съставни ГТУ. ", "Б" ,"445 ."],
[ "  Колко контурна е маслената система на ГТУ? ", "Двуконтурна. ", "Едноконтурна. ", "Многоконтурна. ", "Триконтурна. ", "Б" ,"446 ."],
[ "  Според принципа си на действие маслените системи в ГТУ биват: ", "Гравитационни и циркулационни. ", "Затворени/отворени. ", "Системи с ниско и високо налягане на маслото. ", "Гравитационни и байпасни. ", "А" ,"447 ."],
[ "  Кой от посочените елементи е задължителен за маслената система на ГТУ? ", "Центробежен сепаратор. ", "Филтър за грубо и финно очистване. ", "Лубрикаторна помпа. ", "Утаител. ", "Б" ,"448 ."],
[ "  С какво се охлаждат по време на работа частите на ГТУ? ", "Гориво, масло. ", "Масло, вода. ", "Въздух, вода. ", "Въздух, масло. ", "В" ,"449 ."],
[ "  Как ще дефинирате понятието “Правоточен парен котел с кратност на циркулацията равна на единица” ? ", "Каквото количество вода се подава на входа, толкова пара се получава на изхода. ", "Една пълна циркулация на водосъдържанието се извършва за един час. ", "Пламъчнотръбен котел с праволинеен ход на димните газове, с една циркулация на водосъдържанието за час. ", "Няма такива котли. ", "А" ,"450 ."],
[ "  Кой показател характеризира натоварването на утилизационните парни котли? ", "Разходът и температура на изходящите газове. ", "Специфичната паропроизводителност. ", "Кратността на циркулацията. ", "Температурата на питателната вода. ", "А" ,"451 ."],
[ "  Каква е стойността на коефициента на механичните загуби и специфичния ефективен разход на гориво при работа на КДВГ на празен ход? ", "Механичен КПД - 0, специфичен ефективен разход - безкрайно голям. ", "Механичен КПД - максимален, специфичен ефективен разход - безкрайно голям. ", "Механичен КПД - 0, специфичен ефективен разход - минимален. ", "Механичен КПД - минимален, специфичен ефективен разход - безкрайно малък. ", "А" ,"452 ."],
[ "  Цетановото число на дизеловите горива за съвременните среднооборотни КДВГ следва да бъде в границите на: ", "20 до 40. ", "40 до 60. ", "60 до 80. ", "80 до 100. ", "Б" ,"453 ."],
[ "  Какво качество на горивото дефинира Цетановото число? ", "Калоричността на горивото. ", "Детонационната му устойчивост. ", "Показател на възпламеняемостта. ", "Вискозитета на горивото. ", "В" ,"454 ."],
[ "  Помпажът при ТКА на КДВГ се предизвиква от: ", "Намаляването на разхода на въздух при определени обороти на компресора под определен предел. ", "Работа на КДВГ при щормови условия, изключване на цилиндри, замърсяване на продухвателни прозорци. ", "Замърсяване на лопатъчния дифузьор, спираловидния канал на дифузора, въздушни филтри и интеркулер. ", "Всичко изброено. ", "Г" ,"455 ."],
[ "  Кой от посочените конструкционни материали е най-масово използуван в корабостроенето? ", "Цветни метали. ", "Стомани, чугуни. ", "Абразивни материали. ", "Изолационни материали. ", "Б" ,"456 ."],
[ "  Кой е факторът, разделящ желязо – въглеродната система на стомана и чугун? ", "Процентното съдържание на въглерода. ", "Скоростта на кристализационния процес. ", "Фазовите превръщания на системата. ", "Процентното съдържание на кислорода. ", "А" ,"457 ."],
[ "  Какво представлява конструктивната якост на даден материал? ", "Отношение между плътност на материала и якост на срязване. ", "Отношение между плътност на материала и якост на опън. ", "Отношение между якост на опън и якост на огъване. ", "Отношение между плътност на материала и якост на натиск. ", "В" ,"458 ."],
[ "  От какъв материал се отливат голямогабаритните заготовки? ", "Чугун. ", "Цветни метали. ", "Пластмаси. ", "Полимери. ", "А" ,"459 ."],
[ "  Чрез кой от методите на леене се получават заготовки от всякакъв материал с голяма плътност и точност, малка грапавост на повърхнините и сложна конфигурация? ", "Леене с противоналягане. ", "В пясъчни форми. ", "С восъчен модел. ", "В глинени форми. ", "А" ,"460 ."],
[ "  Конструкции от какъв материал се заваряват най-често в общото машиностроене? ", "Чугунени. ", "Стоманени. ", "От цветни материали. ", "Феритни. ", "Б" ,"461 ."],
[ "  Какво целим да получим с цементацията, азотирането хромирането и силицирането, провеждани при високи температури? ", "Твърд повърхностен слой, мека и жилава сърцевина. ", "Мек повърхностен слой, мека сърцевина. ", "Еднородност на структурата на заготовката. ", "Хомогенност на структурата на заготовката. ", "А" ,"462 ."],
[ "  По кой метод се обработват външни конусни повърхнини чрез снемане на стружка? ", "Заваряване. ", "Студено изтегляне. ", "Струговане. ", "Всичко от изброените. ", "В" ,"463 ."],
[ "  Коя наука се занимава с въпросите на кристалния строеж, физичните, механични, химични и технологични свойства на металите? ", "Техническата механика. ", "Металознанието и термична обработка. ", "Неорганичната химия. ", "Физиката. ", "Б" ,"464 ."],
[ "  Коя част от ГТУ се охлажда с вода? ", "Работните лопатки на турбината. ", "Работните лопатки на компресора. ", "Корпуса на турбината. ", "Всичко изброено. ", "В" ,"465 ."],
[ "  Какво осигурява системата за регулиране, управление и защита на ГТУ? ", "Начина на управление, режима на работа и реагиране при нередности. ", "Реверсирането на ГТУ, качеството на горивния процес. ", "Нивата в цистерните на ГТУ. ", "Температурите на работното тяло на ГТУ. ", "А" ,"466 ."],
[ "  При постоянни други условия, ако в края на сгъстяването температурата в горивната камера на КДВГ нарасне, как ще се измени продължителността на индукционния период, мерена като ъгъл по коляновия вал: ", "Ще нарасне. ", "Ще намалее. ", "Няма да се измени. ", "Ще нарасне пропорционално. ", "Б" ,"467 ."],
[ "  При постоянни други условия, ако горивото е с по-високо цетаново число, как ще се измени продължителността на индукционния период, мерена като ъгъл по коляновия вал: ", "Ще нарасне. ", "Ще намалее. ", "Няма да се измени. ", "Ще нарасне пропорционално. ", "Б" ,"468 ."],
[ "  При постоянни други условия, ако честотата на въртене на КДВГ се понижи как ще се измени продължителността на индукционния период, мерена като ъгъл по коляновия вал: ", "Ще нарасне. ", "Ще намалее. ", "Няма да се измени. ", "Ще нарасне пропорционално. ", "Б" ,"469 ."],
[ "  При постоянни други условия, ако честотата на въртене на КДВГ се понижи, как ще се измени началото на горенето по положението на коляновия вал: ", "Ще започне по-рано. ", "Ще закъснее. ", "Няма да се измени. ", "Ще започне по-късно. ", "А" ,"470 ."],
[ "  Ако честотата на въртене на КДВГ е постоянна, и по време на индукционен период с непроменена продължителност се изпари повече гориво, как ще се измени максималното налягане в цилиндъра: ", "Ще се повиши. ", "Ще се понижи. ", "Няма да се измени. ", "Ще се понижи незначително. ", "А" ,"471 ."],
[ "  Ако честотата на въртене на КДВГ е постоянна, и по време на индукционен период с непроменена продължителност се изпари повече гориво, как ще се измени индикаторния КПД: ", "Ще се повиши. ", "Ще се понижи. ", "Няма да се измени. ", "Ще се понижи експоненциално. ", "А" ,"472 ."],
[ "  Ако честотата на въртене на КДВГ е постоянна и по време на индукционен период с непроменена продължителност се изпари повече гориво, как ще се измени механичния КПД: ", "Ще се повиши. ", "Ще се понижи. ", "Няма да се измени. ", "Ще се повиши скокообразно. ", "Б" ,"473 ."],
[ "  Ако честотата на въртене на КДВГ и началото на подаване на гориво са постоянни, с увеличение на цетановото число на горивото скоростта на покачване на налягането в цилиндъра по време на втората фаза на горене: ", "Ще нарасне. ", "Ще намалее. ", "Няма да се измени. ", "Ще намалее пропорционално. ", "А" ,"474 ."],
[ "  Ако честотата на въртене на КДВГ и началото на подаване на гориво са постоянни, с увеличение на цетановото число на горивото, механичната напрегнатост: ", "Ще нарасне. ", "Ще намалее. ", "Няма да се измени. ", "Ще намалее по градиента на Т. ", "А" ,"475 ."],
[ "  Каква е основната форма на развитие на горенето през втората му фаза при КДВГ: ", "Разпространение на пламък. ", "Дифузионно горене. ", "Едновременен взрив. ", "Стехиометрично горене. ", "А" ,"476 ."],
[ "  Каква е основната форма на развитие на горенето през третата му фаза при КДВГ: ", "Разпространение на пламък. ", "Дифузионно горене. ", "Едновременен взрив. ", "Стехиометрично горене. ", "Б" ,"477 ."],
[ "  Каква е основната форма на развитие на горенето през четвъртата му фаза при КДВГ: ", "Разпространение на пламък. ", "Дифузионно горене. ", "Едновременен взрив. ", "Стехиометрично горене. ", "Б" ,"478 ."],
[ "  Каква е причината за специфичния шум на работа дизеловия двигател? ", "Високата скорост на разпространение на пламъка. ", "Високата стойност на максималното налягане. ", "Хлабините между подвижните и неподвижните части. ", "Високата стойност на максималната температура. ", "А" ,"479 ."],
[ "  Едномерните измервателни инструменти се наричат: ", "Калибри. ", "Шублери. ", "Ролетки. ", "Микрометри. ", "А" ,"480 ."],
[ "  Хлабиномерът представлява: ", "Прибор за измерване на контролни размери. ", "Набор от пластини подредени в метална рамка с дебелина 0,02 до 1 mm. ", "Прибор за измерване на гранични размери. ", "Прибор за измерване на вътрешни размери. ", "Б" ,"481 ."],
[ "  Причината за значителната употреба на медта в машиностроенето е: ", "Малкото относително тегло. ", "Голямата и електро и топлопроводимост. ", "Добрите якостни качества. ", "Ниската й цена. ", "Б" ,"482 ."],
[ "  От какво зависят свойствата на металите и металните сплави: ", "Температурите и условията при които работят. ", "Начина на получаване. ", "Химичния състав и структурата им. ", "Физичния състав и структурата им. ", "В" ,"483 ."],
[ "  Кои вещества се наричат аморфни? ", "Тези вещества при които атомите им са разположени хаотично. ", "Тези вещества при които атомите им образуват хомоложен ред. ", "Тези вещества при които атомите им са разположени в строго определена геометрична зависимост. ", "Тези вещества при които атомите им са разположени в строго определена физична зависимост. ", "А" ,"484 ."],
[ "  Процесът на превръщане на металите и сплавите от течно в твърдо състояние се нарича: ", "Кристализация. ", "Деформация. ", "Полимеризация. ", "Закаляване. ", "А" ,"485 ."],
[ "  Свойството на металите да се съпротивляват срещу разрушаващото действие на външните сили се нарича: ", "Киселинноустойчивост. ", "Износоустойчивост. ", "Якост. ", "Устойчивост. ", "В" ,"486 ."],
[ "  Свойството на метала да заема своята първоначална форма се нарича: ", "Еластичност. ", "Коравина. ", "Деформация. ", "Здравина. ", "А" ,"487 ."],
[ "  Свойството на метала да се съпротивлява срещу проникването на твърди тела в него се нарича: ", "Якост. ", "Твърдост. ", "Коравина. ", "Устойчивост. ", "Б" ,"488 ."],
[ "  Диаграмата на двукомпонентната система желязо-въглерод, която служи за определяне на характерните структури на железните сплави се нарича: ", "Диаграма на фазовото съдържание. ", "Аустенитна диаграма. ", "Желязо – въглеродна диаграма. ", "Диаграма на физичното съдържание на графит. ", "В" ,"489 ."],
[ "  Разликата в структурите на чугуна и стоманата е: ", "Различното количество въглерод. ", "По-голямото количество въглерод. ", "Наличието на кислород. ", "Наличието на модификатори. ", "А" ,"490 ."],
[ "  Най-важният елемент в стоманите е: ", "Въглерода. ", "Сярата. ", "Перлита. ", "Кислорода. ", "А" ,"491 ."],
[ "  Кои от посочените химични елементи са вредни за стоманите? ", "Сяра, манган, фосфор. ", "Водород, азот, кислород, сяра. ", "Манган, молибден, въглерод, сяра. ", "Ванадий, молибден, въглерод. ", "Б" ,"492 ."],
[ "  Как се нарича обработката на стоманите, при която те се нагряват до определена температура строго определено време, задържат при тази температура и се охлаждат с определена скорост? ", "Термична обработка. ", "Механична обработка. ", "Първична обработка. ", "Последваща обработка. ", "А" ,"493 ."],
[ "  Процеса на отстраняване на вътрешните напрежения и подобряване на якостните свойства на стоманите се нарича: ", "Кристализация. ", "Нормализация. ", "Поляризация. ", "Графитизация. ", "Б" ,"494 ."],
[ "  Процесът на обогатяване на повърхностния пласт на стоманата с хром с цел да се увеличи устойчивостта срещу износване, корозия и окисляване при високи температури се нарича: ", "Хромиране. ", "Полимеризация. ", "Термомеханично обработване. ", "Цианиране. ", "А" ,"495 ."],
[ "  Сплавта състояща се от мед и калай се нарича: ", "Черна мед. ", "Бронз. ", "Месинг. ", "Калаена мед. ", "Б" ,"496 ."],
[ "  Месингът е сплав на медта с: ", "Цинка. ", "Оловото. ", "Никелът. ", "Алуминият. ", "А" ,"497 ."],
[ "  Отношението между пълния обем на цилиндъра и обема на горивната камера се нарича: ", "Степен на сгъстяване. ", "Работен обем. ", "Цетаново число. ", "Степен на нагнетяване. ", "А" ,"498 ."],
[ "  При съвременните главни корабни двигатели ъгъла на изпреварване на подаване на гориво е оптимизиран с оглед на: ", "Топлинната напрегнатост. ", "Специфичният разход на гориво. ", "Механичната напрегнатост. ", "Всичко изброено. ", "А" ,"499 ."],
[ "  По-ранното или късно от оптималното подаване на гориво при КДВГ: ", "Увеличава топлинната напрегнатост. ", "Увеличава специфичния разход на гориво. ", "Увеличава механичната напрегнатост. ", "Всичко изброено. ", "А" ,"500 ."],
[ "  Площта на затворената нормална индикаторна диаграма при КДВГ съответства на: ", "Средното индикаторно налягане. ", "Индикаторната работа. ", "Работата от единица работен обем. ", "Средното механично налягане. ", "Б" ,"501 ."],
[ "  Средното индикаторно налягане в КДВГ: ", "Може да се измери с максиметър. ", "Може да се измери с механичен индикатор. ", "Не може да се измери. ", "Може да се измери с интерферометър. ", "В" ,"502 ."],
[ "  Центровката на индикаторния привод на КДВГ оказва влияние върху определянето на: ", "Средното индикаторно налягане. ", "Максималното налягане. ", "Налягането на сгъстяване. ", "Не оказва влияние. ", "А" ,"503 ."],
[ "  При неправилно центрован индикаторен привод на КДВГ дължината на индикаторната диаграма: ", "Е по-голяма. ", "Е по-малка. ", "Не се променя. ", "Зависи от привода. ", "В" ,"504 ."],
[ "  При правилна центровка на индикаторния привод, ако се спре подаването на гориво в цилиндъра на КДВГ: ", "Линията на сгъстяване съвпада с линията на разширение. ", "Линията на сгъстяване е над линията на разширение. ", "Линията на сгъстяване е под линията на разширение. ", "Линията на сгъстяване съвпада с линията на разширение в крайните точки. ", "А" ,"505 ."],
[ "  При правилна центровка на индикаторния привод, ако се спре подаването на гориво в цилиндъра на КДВГ средното индикаторно налягане е: ", "Равно на нула. ", "По-голямо от нула. ", "По-малко от нула. ", "Клони към нула. ", "А" ,"506 ."],
[ "  Проверката за правилна настройка на индикаторния привод на работещ КДВГ става чрез снемане на: ", "Нулева диаграма. ", "Диаграма сгъстяване-разширение, без горивоподаване. ", "“а” или “б”. ", "Проверката се прави при неработещ двигател. ", "В" ,"507 ."],
[ "  Сместена (дефазирана) индикаторна диаграма при КДВГ се получава: ", "С механичен индикатор, използвайки привода на съседен цилиндър. ", "С механичен индикатор, чрез издърпване шнура на барабана на ръка. ", "Със специален индикатор. ", "С електронен индикатор. ", "А" ,"508 ."],
[ "  Разгъната индикаторна диаграма при КДВГ се получава: ", "Чрез издърпване шнура на барабана на ръка. ", "С електронен индикатор. ", "Използвайки привода на съседен цилиндър. ", "Със специален индикатор. ", "А" ,"509 ."],
[ "  За определянето на индикаторната мощност на КДВГ е необходимо да измерим: ", "Честотата на въртене и индикаторното налягане. ", "Честотата на въртене и работата. ", "Честотата на въртене и въртящия момент. ", "Индикаторното налягане и въртящия момент. ", "А" ,"510 ."],
[ "  Индикаторната мощност на КДВГ: ", "Може да се измери с ватметър. ", "Може да се измери на стенд. ", "Не може да се измери. ", "Може да се измери с максиметър. ", "В" ,"511 ."],
[ "  Механичните загуби на КДВГ зависят от: ", "Честотата на въртене на КДВГ. ", "Натоварването на КДВГ. ", "“а” и “б”. ", "Нито едно от изброените. ", "А" ,"512 ."],
[ "  Механичните загуби на КДВГ нарастват с увеличение на: ", "Честотата на въртене на КДВГ. ", "Натоварването на КДВГ. ", "“а” и “б”. ", "Нито едно от изброените. ", "А" ,"513 ."],
[ "  Механичният КПД на КДВГ зависи от: ", "Честотата на въртене на КДВГ. ", "Натоварването на КДВГ. ", "“а” и “б”. ", "Нито едно от изброените. ", "В" ,"514 ."],
[ "  При постоянно натоварване с увеличение на честотата на въртене механичния КПД на главен нискочестотен КДВГ: ", "Намалява. ", "Нараства. ", "Се запазва постоянен. ", "Нараства пропорционално. ", "В" ,"515 ."],
[ "  Разстоянията между крайните точки по дължина, широчина и височина на КДВГ се наричат: ", "Основни точки. ", "Реперни точки. ", "Габаритни размери. ", "Масови характеристики. ", "В" ,"516 ."],
[ "  Мощността на КДВГ която съответствува на индикаторната работа на цикъла се нарича: ", "Ефективна мощност. ", "Индикаторна мощност. ", "Механична работа. ", "Цилиндрова мощност. ", "Б" ,"517 ."],
[ "  Мощността на двигателя която се предава на консуматора на енергия /мощността на гребния вал/ се нарича: ", "Ефективна мощност. ", "Механична мощност. ", "Пълна мощност. ", "Валова мощност. ", "А" ,"518 ."],
[ "  На колко основни механизма се делят подвижните части на КДВГ? ", "Коляно-мотовилков и газоразпределителен. ", "Бутална група, горивна апаратура. ", "Газоразпределителен механизъм, колянов вал. ", "Газоразпределителен, горивен. ", "А" ,"519 ."],
[ "  Механизма, който поема газовите сили и преобразува възвратно-постъпателното движение на буталото във въртеливо движение на коляновия вал се нарича: ", "Газоразпределителен механизъм. ", "Коляно-мотовилков механизъм. ", "Бутален механизъм. ", "Цилиндро-мотовилков механизъм. ", "Б" ,"520 ."],
[ "  Как се нарича механизма, предназначен за управление на работния процес – движението и обмена на работното тяло? ", "Газоразпределителен механизъм. ", "Коляно-мотовилков механизъм. ", "Пусков механизъм. ", "Горивен механизъм. ", "А" ,"521 ."],
[ "  Как се нарича частта от КДВГ, която служи за опора на двигателя? ", "Корабен фундамент. ", "Цилиндров блок. ", "Фундаментна рама. ", "Картер. ", "В" ,"522 ."],
[ "  Има ли значение големината на силата с която се затягат гайките на болтовете които свързват фундаментната рама с корабния фундамент? ", "Няма значение. ", "Затягат се няколко пъти с определена сила през определен период от време. ", "Затягат се еднократно, последователно всички болтове с определена сила. ", "Затягат се еднократно, последователно всички болтове с различна сила. ", "Б" ,"523 ."],
[ "  Коя е причината за закрепването на дизелгенераторите към корабния фундамент посредством демпфери? ", "По-проста конструкция на закрепването. ", "ДВГ са среднооборотни и по този начин се предотвратяват повишени вибрации. ", "Изискване на Конвенция SOLAS. ", "По изискване на корабособственика. ", "Б" ,"524 ."],
[ "  Къде се монтират основните лагери на КДВГ? ", "В леглата на фундаментната рама. ", "На надлъжните греди на фундаментната рама. ", "На конзоли закрепени за фундаментната рама. ", "Нито едно от изброените. ", "А" ,"525 ."],
[ "  Какви са основните лагери в КДВГ? ", "Търкалящи лагери. ", "Дробинкови лагери. ", "Плъзгащи лагери. ", "Нито едно от изброените. ", "В" ,"526 ."],
[ "  Какво образуват основните лагери на КДВГ? ", "Леглото на коляновия вал. ", "Основната шийка на коляновия вал. ", "Поемат радиалните сили от реакцията на гребния винт. ", "Линията на коляновия вал. ", "А" ,"527 ."],
[ "  Кое е най-съществено условие за нормална работа на основните лагери на КДВГ? ", "Променливи хидродинамични вибрации. ", "Устойчиво хидродинамично смазване. ", "Понижени температурни натоварвания. ", "Понижени вибрационни натоварвания. ", "Б" ,"528 ."],
[ "  Как влияе вискозитета на устойчивостта на масления слой разделящ повърхностите в основните лагери? ", "Устойчивостта на слоя се увеличава при повишаване на визкозитета. ", "Устойчивостта на слоя се намалява при повишаване на вискозитета. ", "Устойчивостта на слоя не се променя при повишаване на визкозитета. ", "Устойчивостта на слоя не се променя при намаляване на визкозитета. ", "А" ,"529 ."],
[ "  С какво се покриват лагерните черупки? ", "Цветни сплави. ", "Легиращи елементи. ", "Антифрикционни сплави. ", "Маслозадържащи елементи. ", "В" ,"530 ."],
[ "  С каква цел се фиксират лагерните черупки в леглата на лагерите? ", "За осигуряването на износоустойчивост. ", "За осигуряването срещу превъртане. ", "За предотвратяването на температурните разширения. ", "За намаляване на вибрационната корозия. ", "Б" ,"531 ."],
[ "  Понятието “натоварване “ на КДВГ се определя най-точно от: ", "Развиваното от двигателя средното ефективно налягане. ", "Развиваната от двигателя ефективна мощност. ", "“а” и “б”. ", "Развиваните от двигателя обороти. ", "А" ,"532 ."],
[ "  Косвен показател за понятието “натоварване “ на КДВГ може да бъде: ", "Цикловата порция гориво. ", "Оборотите на ТКА. ", "Моментният разход на гориво. ", "Нищо от изброеното. ", "А" ,"533 ."],
[ "  Какво представлява понятието “Максимално продължителна мощност” за един главен КДВГ: ", "Максималната мощност до която двигателя може да се натовари за неограничено време, независимо от параметрите на околната среда. ", "Максималната мощност до която двигателя може да се натовари за неограничено време, при точно определени параметрите на околната среда. ", "Максималната мощност до която двигателя може да се натовари за ограничено време, независимо от параметрите на околната среда. ", "Максималната мощност до която двигателя може да се натовари за ограничено време. ", "Б" ,"534 ."],
[ "  Каква е връзката между понятията “Максимално продължителна мощност” и “Номинална мощност” на Гл.КДВГ: ", "“Максимално продължителната мощност” е по-голяма от “номиналната мощност”. ", "“Максимално продължителната мощност” е по-малка от “номиналната мощност”. ", "“Максимално продължителната мощност” е равна на “номиналната мощност”. ", "Няма такава връзка. ", "В" ,"535 ."],
[ "  Каква е връзката между понятията “Максималнa мощност” и “Номинална мощност” на Гл.КДВГ: ", "“Максималнaта мощност” е по-голяма от “номиналната мощност”. ", "“Максималната мощност” е по-малка от “номиналната мощност”. ", "“Максималната мощност” е равна на “номиналната мощност”. ", "Няма такава връзка. ", "А" ,"536 ."],
[ "  Каква е връзката между понятията “Максимално продължителна мощност” и “Максимална мощност” на Гл.КДВГ: ", "“Максимално продължителната мощност” е по-голяма от “максималната мощност”. ", "“Максимално продължителната мощност” е по-малка от “максималната мощност”. ", "“Максимално продължителната мощност” е равна на “максималната мощност”. ", "Няма такава връзка. ", "Б" ,"537 ."],
[ "  Каква е връзката между понятията “Мощност на претоварване” и “Максимална мощност” на Гл.КДВГ: ", "“Мощността на претоварване” е по- голяма от “максималната мощност”. ", "“Мощността на претоварване” е по- малка от “максималната мощност”. ", "“Мощността на претоварване” е равна на “максималната мощност”. ", "Няма такава връзка. ", "В" ,"538 ."],
[ "  С колко процента мощността на претоварване на КДВГ е по-голяма от номиналната му мощност: ", "0,5%. ", "5%. ", "10%. ", "17%. ", "В" ,"539 ."],
[ "  С колко процента мощността на претоварване на КДВГ е по-голяма от максималната му мощност: ", "0%. ", "10%. ", "5%. ", "15%. ", "А" ,"540 ."],
[ "  С колко процента номиналната честота на въртене на КДВГ може да бъде превишена по време на експлоатация: ", "3%. ", "5%. ", "7%. ", "“а” и “б”. ", "Г" ,"541 ."],
[ "  В какви случаи е допустимо продължително превишение на честотата на въртене на Гл.КДВГ: ", "Когато експлоатационната мощност е най-много равна на максимално продължителната мощност. ", "Когато експлоатационната мощност е най-много равна на максималната мощност. ", "Когато експлоатационната мощност е най-много равна на мощността на претоварване. ", "Не е допустимо. ", "А" ,"542 ."],
[ "  В какви случаи е допустимо кратковременно превишение на честотата на въртене на КДВГ: ", "Когато експлоатационната мощност е най-много равна на максимално продължителната мощност. ", "Когато експлоатационната мощност е най-много равна на максималната мощност. ", "“а” и ”б”. ", "Не е допустимо. ", "В" ,"543 ."],
[ "  Как се променя механичната напрегнатост на КДВГ, когато се запазват постоянни максималното налягане и степента на покачването му, с намаление на честотата на въртене: ", "Намалява. ", "Не се променя. ", "Нараства. ", "Намалява, после остава постоянна. ", "В" ,"544 ."],
[ "  Какъв е броя на основните лагери спрямо броя на цилиндрите в КДВГ? ", "Еднакъв брой са. ", "Основните лагери са с един повече от броя на цилиндрите на КДВГ. ", "Основните лагери са е един по- малко от броя на цилиндрите на КДВГ. ", "Не се определя. ", "Б" ,"545 ."],
[ "  Как се постига осигуряването срещу осовото преместване на коляновия вал на КДВГ? ", "Чрез монтирането на един аксиално- радиален лагер наречен лагер на Митчел. ", "Чрез фиксирането на основните лагери. ", "Чрез монтирането на валолиния с възможно най-малка дължина. ", "Чрез фиксирането на мотилевите лагери. ", "А" ,"546 ."],
[ "  Как се нарича хлабината между лагер и шийка на вал на КДВГ? ", "Аксиална. ", "Радиална. ", "Допустима. ", "Диаметрална. ", "Б" ,"547 ."],
[ "  Какво става с хлабината при износване на основните лагери на КДВГ? ", "Намалява. ", "Променя се структурата на антифрикционния материал. ", "Хлабината се увеличава. ", "Увеличава се масления клин. ", "В" ,"548 ."],
[ "  За коя неподвижна част на КДВГ се закрепват направляващите на кръстоглава? ", "Фундаментната рама. ", "Цилиндровия блок. ", "“ А “ образната стойка. ", "Блок-картера. ", "В" ,"549 ."],
[ "  Какво е предназначението на люковете от двете страни на “А” образната стойка на Гл.КДВГ? ", "За достъп и преглед на коляно- мотовилковия механизъм. ", "За олекотяване на конструкцията. ", "За смазване на коляно- мотовилковия лагер. ", "За достъп и преглед на циндро-буталната група. ", "А" ,"550 ."],
[ "  Какъв клапан е монтиран на люковите капаци на “А” образната стойка на Гл.КДВГ? ", "Спирателен, за маслената система смазваща кръстоглавния възел. ", "Предпазен, задействащ се при повишено налягане на газове в картерното пространство. ", "Дренажен клапан на маслената система. ", "Предпазен, задействащ се при повишено налягане на маслото в картерното пространство. ", "Б" ,"551 ."],
[ "  С какъв механизъм се извършва условното разделяне на Гл.КДВГ на две части? ", "Диафрагма. ", "Напречни прегради. ", "Надлъжни прегради. ", "Ребра. ", "А" ,"552 ."],
[ "  Кои КДВГ имат продухвателни прозорци? ", "Двутактовите. ", "Четиритактовите. ", "Само кръстоглавни с голяма мощност. ", "Само двутактови с голяма мощност. ", "А" ,"553 ."],
[ "  От кои части на КДВГ се образува работното пространство? ", "“А” образна стойка, цилиндрова глава, бутало. ", "Цилиндрова втулка, бутало, цилиндрова глава. ", "Цилиндрова глава, цилиндров блок, цилиндрова втулка. ", "Бутало, цилиндрова глава. ", "Б" ,"554 ."],
[ "  Как се монтира цилиндровата втулка към цилиндровия блок на КДВГ? ", "Чрез болтова връзка. ", "С два уплътнителни пояса. ", "Запресова се в цилиндровия блок. ", "Чрез пас-щифтове. ", "Б" ,"555 ."],
[ "  Защо цилиндровите втулки на КДВГ трябва да имат възможност свободно да се разширяват радиално и осово? ", "Подложени са на големи абразивни натоварвания. ", "Подложени са на големи механични натоварвания. ", "Натоварени са топлинно в широк Т диапазон. ", "Подложени са на вибрационни натоварвания. ", "В" ,"556 ."],
[ "  Как става фиксирането на цилиндровата втулка към цилиндровия блок на КДВГ? ", "Горно фланцево удебеление. ", "Две симетрични уплътнения. ", "Пресова сглобка. ", "Щифтове. ", "А" ,"557 ."],
[ "  В коя част на цилиндровата втулка на КДВГ износването от буталото е максимално? ", "Равномерно по цялата дължина. ", "Горната част на втулката. ", "Долната част на втулката. ", "Средната част на втулката. ", "Б" ,"558 ."],
[ "  Когато тръбите на кондензатора са развалцовани в двете тръбни дъски, различната степен на линейно разширение на материала се компенсира чрез използване на: ", "Чашкообразни съединения в двата края. ", "Резбови бронзови втулки на краищата на тръбите. ", "Гумени уплътнения между тръбната дъска и корпуса на кондензатора. ", "Метални уплътнения, пресовани около краищата на тръбите. ", "А" ,"559 ."],
[ "  Когато рН факторът на котелната вода намалява към “0”, водата става: ", "Мека. ", "С алкална реакция. ", "С неутрална реакция. ", "С кисела реакция. ", "Г" ,"560 ."],
[ "  Как се променя топлинната напрегнатост на КДВГ с увеличение на коефициента на излишен въздух: ", "Намалява. ", "Не се променя. ", "Нараства. ", "Нараства, после остава постоянна. ", "А" ,"561 ."],
[ "  С каква цел коефициентът на излишен въздух при съвременните главни корабни двигатели е висок на номинална мощност: ", "С цел да се намали температурата на изгорелите газове. ", "С цел да се намали топлинната напрегнатост. ", "С цел да намалят топлинните загуби. ", "С цел да намалят механичните загуби. ", "Б" ,"562 ."],
[ "  Какво трябва да се измери за да се определи в корабни условия индикаторния КПД: ", "Разходът на гориво и индикаторното налягане. ", "Разходът на гориво и ефективното налягане. ", "Средното индикаторно налягане и разходът на гориво. ", "Средното ефективно налягане и разходът на гориво. ", "А" ,"563 ."],
[ "  Как се променя индикаторния КПД на КДВГ с намаление продължителността на горенето: ", "Индикаторният КПД нараства. ", "Индикаторният КПД не се променя. ", "Индикаторният КПД намалява. ", "Индикаторният КПД намалява рязко. ", "А" ,"564 ."],
[ "  Как се променя индикаторния КПД на КДВГ когато горенето започне по-рано: ", "Индикаторният КПД нараства. ", "Индикаторният КПД не се променя. ", "Индикаторният КПД намалява. ", "Индикаторният КПД намалява рязко. ", "А" ,"565 ."],
[ "  Какво трябва да се измери за да се определи в корабни условия ефективния КПД на КДВГ: ", "Разходът на гориво и ефективната мощност. ", "Ефективният въртящ момент и разхода на гориво. ", "Средното ефективно налягане и разхода на гориво. ", "Разходът на гориво и моментната мощност. ", "Б" ,"566 ."],
[ "  Как се променя ефективния КПД на КДВГ с намаление продължителността на горенето? ", "Нараства. ", "Не се променя. ", "Намалява. ", "Намалява рязко. ", "А" ,"567 ."],
[ "  Как се променя ефективния КПД при съвременните главни КДВГ когато горенето започне по-рано? ", "Нараства до достигане на оптимум. ", "Намалява до достигане на минимум. ", "Не се променя. ", "Намалява, после остава постоянно. ", "А" ,"568 ."],
[ "  Какво трябва да се измери за да се определи в корабни условия индикаторния специфичен разход на гориво? ", "Разходът на гориво и индикаторното налягане. ", "Индикаторната мощност и разхода на гориво. ", "Средното индикаторно налягане и разхода на гориво. ", "Моментната мощност и разхода на гориво. ", "А" ,"569 ."],
[ "  Как се променя индикаторния специфичен разход на гориво на КДВГ с намаление на продължителността на горенето? ", "Нараства. ", "Не се променя. ", "Намалява. ", "Нараства, после остава постоянен. ", "В" ,"570 ."],
[ "  Как се променя индикаторния специфичен разход на гориво на КДВГ когато горенето започне по рано? ", "Нараства. ", "Не се променя. ", "Намалява. ", "Нараства, после остава постоянен. ", "В" ,"571 ."],
[ "  Какво трябва да се измери за да се определи в корабни условия ефективния специфичен разход на гориво? ", "Разходът на гориво и ефективната мощност. ", "Ефективният въртящ момент и разхода на гориво. ", "Средното ефективно налягане и разхода на гориво. ", "Средното механично налягане и разхода на гориво. ", "Б" ,"572 ."],
[ "  Как се променя ефективния специфичен разход на гориво на КДВГ с намаление продължителността на горенето? ", "Нараства. ", "Нараства, после остава постоянен. ", "Намалява. ", "Не се променя. ", "В" ,"573 ."],
[ "  Как се променя ефективния специфичен разход на гориво при съвременните Гл.КДВГ когато горенето започне по рано? ", "Нараства до достигане на оптимум. ", "Намалява до достигане на минимум. ", "Не се променя. ", "Нараства, после остава постоянен. ", "Б" , "574 ."],
 
 
]; 

var questionOrder = []; 
var maxNumberOfQuestions = questions.length;  // do NOT make BIGGER than number of 'questions' array 
function setmaxNumberOfQuestions() { 
   maxNumberOfQuestions = 60;
}
// var maxNumberOfQuestions = 2;  // do NOT make BIGGER than number of 'questions.length' array 
var maxNumberOfQuestions2 = questions.length;
function setQuestionOrder() { 
  questionOrder.length = 0; 
  for (var i=0; i<maxNumberOfQuestions2; i++) { questionOrder.push(i); } 
 //questionOrder.sort(randOrd);   // alert(questionOrder);  // shuffle display order 
  pos = document.getElementById("numb").value-1;  posn = questionOrder[pos]; 
} 

function setQuestionOrder2() { 
  questionOrder.length = 0; 
  for (var i=0; i<maxNumberOfQuestions2; i++) { questionOrder.push(i); } 
  questionOrder.sort(randOrd);   // alert(questionOrder);  // shuffle display order 
  pos = 0;  posn = questionOrder[pos]; 
} 


function $_(IDS) { return document.getElementById(IDS); } 
function randOrd() { return (Math.round(Math.random())-0.5); } 
function renderResults(){ 
  var test = $_("test"); 
  test.innerHTML = "<h2>Имате "+correct+" от "+maxNumberOfQuestions+" правилно отговорени въпроси</h2>"; 
  test.innerHTML +=  +(correct/maxNumberOfQuestions*100).toFixed(0)+'% правилни отговори<br>';
  $_("test_status").innerHTML = "Приключихте теста"; 
  $_('timeleft').innerHTML = ' '; 
  test.innerHTML += "<br><img src='images/curies.gif' align='bottom' width='500' height='247' alt='Lubopitko'><br><br>";
  test.innerHTML += "<button  class= 'button' onclick='location.reload()'>Повторете теста</button>"; 
  
 
  setQuestionOrder(); 
  correct = 0; 
  clearInterval(myVar); 
  return false; 
} 




function renderQuestion() { 
  var test = $_("test"); 
  $_("test_status").innerHTML = "Въпрос "+(pos+1)+" от "+maxNumberOfQuestions; 
  //if (rscore != 0) { $_("test_status").innerHTML += '<br>Текущ въпрос: '+(correct/rscore*100).toFixed(0)+'% правилни отговори'; } 
   if (rscore != 0 && correct == 1 && maxNumberOfQuestions != 60) { $_("test_status").innerHTML += '<br>Имате '+correct+' правилeн отговор'; }
    if (rscore != 0 && correct > 1 && maxNumberOfQuestions != 60) { $_("test_status").innerHTML += '<br>Имате '+correct+' правилни отговора'; } 
  var question = questions[posn][0]; 
  var chA = questions[posn][1]; 
  var chB = questions[posn][2]; 
  var chC = questions[posn][3];
  var chD = questions[posn][4];
  var chЕ = questions[posn][6];
  if (maxNumberOfQuestions != 60) { test.innerHTML = "<h3>"+chЕ+question+"</h3>"; } 
  else  {test.innerHTML = "<h3>"+question+"</h3>"}; 
  test.innerHTML += "<label><input type='radio' name='choices' value='А'> А) "+chA+"</label><br>"; 
  test.innerHTML += "<label><input type='radio' name='choices' value='Б'> Б) "+chB+"</label><br>"; 
  test.innerHTML += "<label><input type='radio' name='choices' value='В'> В) "+chC+"</label><br>"; 
  test.innerHTML += "<label><input type='radio' name='choices' value='Г'> Г) "+chD+"</label><br><br><br><br>";
   
  test.innerHTML += "<button  id='btn3'  class= 'button' onclick='checkAnswer3()'>Назад</button>"
  test.innerHTML += "<button  id='btn1' class= 'button' onclick='checkAnswer()'>Напред</button><br><br>";
  test.innerHTML += "<button id='btn2'  class= 'button' onclick='checkAnswer2()' >Верен отговор</button>" ;
  ;
}
  //  setupTimer();  // for indivisible timer for each question
  function setupTimer() {
  timelimit = maxtimelimit; 
  clearInterval(myVar); 
  startTimer(); 
} 

function checkAnswer2(){ 
	//var answer = $_GET("answer");
	//var btn = $_GET("check");
	var choices = document.getElementsByName("choices"); 
  for (var i=0; i<choices.length; i++) { 
    if (choices[i].checked) { choice = choices[i].value; } 
  } 
	rscore++; 
	if (choice == questions[posn][5] || choice != questions[posn][5]){
		btn1.style.visibility="hidden";
		btn2.style.visibility="hidden";
		btn3.style.visibility="hidden"
		answer.style.visibility="visible";
		answer.innerHTML = "<h3>Правилен отговор: "+questions[posn][5] +"<br></h3>";
		answer.innerHTML += "<button class='button'  onclick='proceed()' >Продължи</button>"; 
		}
	} 

function proceed() {
	//var answer = $_GET("answer");
	//var btn = $_GET("check");
	answer.style.visibility="hidden";
	btn1.style.visibility="visible";
	btn2.style.visibility="visible";
	btn3.style.visibility="visible";
	pos++;  posn = questionOrder[pos];
	if (pos < maxNumberOfQuestions) { renderQuestion(); } else { renderResults(); } 
	}

function checkAnswer3(){ 
  var choices = document.getElementsByName("choices"); 
  for (var i=0; i<choices.length; i++) { 
    if (choices[i].checked) { choice = choices[i].value; } 
  } 
  rscore++; 
  if (choice == questions[posn][5] && timelimit > 0) { correct--; } 
  pos--;  posn = questionOrder[pos]; 
  if (pos < maxNumberOfQuestions) { renderQuestion(); } else { renderResults(); } 
} 

function checkAnswer(){ 
  var choices = document.getElementsByName("choices"); 
  for (var i=0; i<choices.length; i++) { 
    if (choices[i].checked) { choice = choices[i].value; } 
  } 
  rscore++; 
  if (choice == questions[posn][5] && timelimit > 0) { correct++; } 
  pos++;  posn = questionOrder[pos]; 
  if (pos < maxNumberOfQuestions) { renderQuestion(); } else { renderResults(); } 
} 

window.onload = function() { 
  Start() ;
    // for total time for entire quiz
} 