function getOption() {
    var obj = document.getElementById("mySelect");
	if (obj.options[obj.selectedIndex].value == "A") {  Learn() };
	if (obj.options[obj.selectedIndex].value == "B") { Exam() };
};

function Start(){

	java.style.display="none";
	numb.style.display="none";
	btn4.style.display="none";
	test_status.style.display="none";
	timeleft.style.display="none";
	test.style.display="none";
};
function Learn() {
	form1.style.display="none";
	setFirstQuestion();
	
	};
	
	function Exam() {
		
	form1.style.display="none";
	test_status.style.display="block";
    test.style.display="block";
	timeleft.style.display="block";
	
	setmaxtimelimit() ;
	setmaxNumberOfQuestions();
	setQuestionOrder2(); 
    renderQuestion(); 
    setupTimer();
	};
	
function setFirstQuestion() {
    var x, text;

    // Get the value of the input field with id="numb"
    x = document.getElementById("numb").value;

    // If x is Not a Number or less than one or greater than 10
    if (isNaN(x) || x < 1 || x > maxNumberOfQuestions2) {
        text = "<h5>Въведете стойност между 1 и "+maxNumberOfQuestions+"</h5>";
		
		java.style.display="block";
	numb.style.display="inline";
	btn4.style.display="inline";
		
		
		
    } else {
        text = "Input OK";
		test_status.style.display="block";
		test.style.display="block";
		//timeleft.style.visibility="visible";
		java.style.display="none";
	numb.style.display="none";
	btn4.style.display="none";
	demo.style.display="none";
		setQuestionOrder(); 
        renderQuestion(); 
		//setupTimer();
    }
    document.getElementById("demo").innerHTML = text;
}

var myVar; 
function startTimer() { 
  myVar = setInterval(function(){myTimer()},1000); 
  timelimit = maxtimelimit; 
} 

function myTimer() { 
  if (timelimit > 0) { 
    curmin=Math.floor(timelimit/60); 
    cursec=timelimit%60; 
    if (curmin!=0) { curtime="остават "+curmin+" минути и "+cursec+" секунди"; } 
              else { curtime="остават "+cursec+" секунди"; } 
    $_('timeleft').innerHTML = curtime; 
  } else { 
    $_('timeleft').innerHTML = timelimit+' - Просрочихте времето - няма да получите точки за този отговор'; 
 //clearInterval(myVar); 
    //checkAnswer(); 
	renderResults()
	{   
  $_("test_status").innerHTML = "Просрочихте времето. Приключихте теста"; 
} ;
  } 
  timelimit--; 
}   



var pos = 0, posn, choice, correct = 0, rscore = 0; 
var maxtimelimit = 6000, timelimit = maxtimelimit;  // 20 seconds per question 
function setmaxtimelimit() { 
   maxtimelimit = 3600;
}




var questions = [ 
 [ "  Ако имате разлив на палубата и в резултат на това сте замърсили околната среда, какво трябва да направите?", "Незабавно уведомете капитана, така че той да може да информира съответните власти да се заемат с ликвидиране последствията от разлива.", "С помощта на пожарните шлангове измийте палубата за да отстраните последствията от разлива.", "С помощта на химикали се опитайте да се справите със замърсяването, за избягване на разходи и глоби за кораба.", "Много правила са прекалено строги, затова ще използвам моята преценка за да се справя с възникналата ситуация.", "А" ,"1 ."],
[ "  В кои райони могат да се изхвърлят пластмаси зад борд?", "На 100 мили от брега.", "Никъде не е разрешено.", "В специални райони описани в MARPOL.", "В крайбрежни води.", "Б" ,"2 ."],
[ "  В случай, че всеки пожарен кран не е оборудван с пожарен шланг и струйник, какво е изискването? ", "Пълна взаимозаменяемост на съединителните звена на пожарните шлангове и струйниците.", "Пожарни шлангове и струйници за всеки пожарен кран да бъдат налични в противопожарните пунктове.", "Във всеки пожарен пункт, достатъчен брой пожарни шлангове и струйници за пожарните кранове в района.", "Пожарни шлангове с монтирани струйници, готови за използване, да бъдат съхранявани на видно място в близост до пожарните кранове.", "А" ,"3 ."],
[ "  Разрешено ли е в района на Черно и Средиземно море да се изхвърлят материали замърсени с масла или други  нефтопродукти(парцали, дървени пилки и др.)?", "Да, ако корабът е на ход и на повече от 50 мили от брега.", "Да, но само в открито море на разстояние по-голямо от 12 мили.", "Не, събират се на кораба в отделни контейнери или се изгарят.", "Да, но само ако са в малки количества до 1-2 килограма.", "В" ,"4 ."],
[ "  EEBD e:", "Въздушно-кислородно устройство от одобрен тип, което се използва за напускане на помещения с опасна атмосфера.", "Устройство с продължителност на работа до 5 минути.", "Въздушно-кислородно устройство от одобрен тип, което се използва за гасене на пожар и за напускане на помещения с опасна атмосфера.", "Вид противопожарно средство за използване в краен случай за гасене на пожар.", "А" ,"5 ."],
[ "  Предаването на сантинни води на нефтосъбирач или на брегово съоръжение се отразява в:", "Дневника за товарни операции.", "Дневника за нефтените операции.", "Дневника за баластни операции.", "Машинния дневник.", "Б" ,"6 ."],
[ "  Кое е най-критичното време при бункероване на гориво по отношение на опасността от замърсяване и разлив на нефтопродукти: ", "Шланговането на системите.", "Запълването на танковете.", "Началото на бункероването.", "Меренето на танковете.", "Б" ,"7 ."],
[ "  За да избегнете разлив на гориво при запълване на танковете трябва:", "Да се притвори входящият кран за да се намали дебита.", "Да се затворят отдушните тръби на танковете.", "Да не се напълват танковете повече от нивото на дъното на преливния танк.", "Да се предупреди помпената станция да намали дебита поради запълване на танковете.", "Г" ,"8 ."],
[ "  Изхвърлянето на нераздробени хранителни отпадъци, метал, стъкло, порцелан и др. се разрешава ако:", "Корабът се намира най-малко на 20 мили от брега.", "Корабът се намира най-малко на 4 мили от брега.", "Корабът се намира най-малко на 12 мили от брега.", "Отпдъците са опаковани в добре завързани полиетиленови торби.", "В" ,"9 ."],
[ "  Аварийният сантинен смукателен кран обикновено се използва за:", "Да вкара почистващи препарати когато сантините са мръсни.", "Допълнително охлаждане.", "Да свърже осушителната система с независим сантинен смукател.", "Осушаване на сантините ако няма друг начин.", "Г" ,"10 ."],
[ "  Всяко преминаване от дистанционно на ръчно управление на главния двигател се:", "Записва в машинния  дневник.", "Докладва на старши-помощник капитана.", "Докладва на вторият механик.", "Не се докладва.", "А" ,"11 ."],
[ "  Всички врати във водонепроницаемите прегради на кораба трябва да осигуряват: ", "Добра вентилация на съседните помещения.", "Свободно преминаване на хора по всяко време.", "Херметично затваряне.", "Комфорт на екипажа.", "В" ,"12 ."],
[ "  При експлозия или пожар в картера на дизеловия ДВГ Вие трябва да спрете двигателя и:", "Веднага да отворите капаците на картера за по-бързо охлаждане.", "Включите на пълна скорост вентилаторите в режим “изсмукване”.", "Изчакате ДВГ да се охлади по естесвен път.", "Включите вентилаторите на подбуталните пространства да се проветрят неизгорелите газове.", "В" ,"13 ."],
[ "  Кое от изброените оборудвания не е част от комплекта на противопожарното облекло?", "Защитно облекло.", "Брадва.", "Ел. обезопасена лампа.", "Кожени обувки и ръкавици", "Г" ,"14 ."],
[ "  Съгласно MARPOL оборудването за сепариране на нефтоводни смеси трябваше да е сертифицирано за:", "15 ppm.", "50 ppm.", "25 ppm.", "10 ppm.", "А" ,"15 ."],
[ "  Какви са първите действия при обезточване на кораба/Black-Out/?", "Информираме главния механик.", "Информираме мостика за причините и вероятното време за рестарт.", "Разследваме причината.", "Изключваме алармата.", "Б" ,"16 ."],
[ "  Кой от изброените детектори ще използваме за да установим, че водонепроницаемите врати се отварят?", " Тензодатчици.", "Фотоклетка.", "Контактен ключ.", "Пиезодатчик.", "В" ,"17 ."],
[ "  От коя мрежа се захранва аварийното осветление по канижелите?", " Осветителна мрежа.", "  Аварийна осветителна мрежа.", "Малоаварийна осветителна мрежа.", "Мрежа за аварийна сигнализация.", "Г" ,"18 ."],
[ "  Какви предварителни действия трябва да се предприемат, ако поради включена аларма или за рутинна проверка се налага да се влезе в МКО работещо в UMS режим?", "Да се информира мостика.", "Да се превключи в Manual режим и да се включи  Dead man alarm.", "Достатъчно е да се превключи  на Manual режим.", "Селекторния ключ остава  в UMS mode.", "Б" ,"19 ."],
[ "  Може ли аварийният дизелгенератор, в аварийна ситуация, да се ползва за захранване на неаварийни вериги?", "Не.", "Да, във всички случаи.", "Само в изключителни случаи.", "Само в изключителни случаи, за кратко време, при съответни предпазни мерки.", "Г" ,"20 ."],
[ "  Колко време трябва да бъде осигурено аварийно захранване на една от пожарните помпи, които се изискват от правило ІІ-2/4.3.1 и 4.3.3 на SOLAS ?", "36 часа.", "12 часа.", "18 часа.", "24 часа.", "В" ,"21 ."],
[ "  С каква температура на възпламеняване на горивото може да работи аварийния ДГ?", "Не по-ниска от 60 °С.", "Не по-ниска от 43 °С.", "Не по-ниска от 80 °С.", "Не по-ниска от 63 °С.", "Б" ,"22 ."],
[ "  Каква продължителност най-много може да има режима на пуск и поемане на товара на аварийния дизелгенератор?", "Не повече от 45 сек.", "Не повече от 55 сек.", "Не повече от 65 сек.", "Не повече от 75 сек.", "А" ,"23 ."],
[ "  С какъв запас на енергия е пусковото устройство на аварийния дизелгенератор?", "Достатъчен за най-малко четири последователни пускания.", "Достатъчен за най-малко три последователни пускания от основния източник и три от допълнителен за 30 мин.", "Достатъчен за най-малко четири последователни пускания от основния източник и четири от допълнителен за 30 мин.", "Достатъчен за най-малко 2 последователни пускания от основния източник и 2 от допълнителен за 30 мин.", "Б" ,"24 ."],
[ "  Кога не се изисква допълнителен източник за енергия за пускане на АДГ?", "Никога.", "При малки кораби.", "При възможност за ръчен пуск на АДГ.", "Когато няма АДГ.", "В" ,"25 ."],
[ "  Откритите метални части на електрическите машини трябва да се заземяват, освен в случаите когато машините :", "Се захранват с постоянен ток, чието напрежение не превишава 50 V.", "Се захранват с ток, чието напрежение не превишава 250 V, от разделителни трансформатори, захранващи само един потребител.", "Са конструирани в съответствие с принципа за двойна изолация.", "Всичко описано в A), Б) и В).", "Г" ,"26 ."],
[ "  Колко градуса е лимитиращата температура на външната страна на стената за определяне на типа на помещения с клас на пожаробезопасност  “А” ?", "180 °С.", "280 °С.", "160 °С.", "260 °С.", "А" ,"27 ."],
[ "  Кои повърхностти, върху които може да попадне гориво в резултат на повреда на горивната система, трябва да бъдат подходящо изолирани топлинно?", "С температура над 120 °С.", "С температура над 320 °С.", "С температура над 220 °С.", "С температура над 420 °С.", "В" ,"28 ."],
[ "  Кога следва да бъде проверено рулевото устройство?", "Веднага след завършване на рейса.", "До 12 часа преди отплаване.", "До 12 часа след завършване на рейса.", "Непосредствено преди отплаване.", "Б" ,"29 ."],
[ "  Кое е функционалното изискване за задържане на разпространението на пожар на мястото на възникването му?", "Корабът се разделя чрез термични и конструктивни гранични прегради.", "Термичната изолация на граничните прегради отчита пожарния риск на пространството и на съседните пространства.", "Пожароустойчивостта на граничните прегради се поддържа през отворите и проходите.", "Всичко описано в А), Б) и В).", "Г" ,"30 ."],
[ "  Разписка или удостоверение от оператора на приемните устройства се съхраняват заедно с “Дневника за нефтени операции” и служат за:", "Финансов отчет на операцията.", "Могат да помогнат на капитана на кораба да докаже, че корабът не е замесен в инцидент като източник на замърсяване.", "Определят количеството на нефтопродукта, с който е оперирано.", "Задължителни са за доказване на спазване правилата на конвенцията.", "Б" ,"31 ."],
[ "  Какво се вписва в “Дневника за нефтени операции” за определяне състоянието на системата за наблюдение и контрол над изхвърлянето на нефт?", "Време, когато системата е била извън строя.", "Време, когато е възстановена работата на системата.", "Причини за неизправността.", "Всичко описано в А), Б) и В).", "Г" ,"32 ."],
[ "  В одобреният в съответствие с Анекс I на MARPOL от Администрацията “Корабен план за борба с аварийни нефтени разливи - SOPEP”:", "Капитанът няма право да внася допълнения и корекции, т.к. вече е одобрен.", "Капитанът може да внася допълнения след разрешение от компанията.", "Капитанът може да внася допълнения след разрешение от Администрацията на знамето.", "Капитанът е длъжен да внася изменения и допълнения в съответните раздели.", "Г" ,"33 ."],
[ "  Какви допълнителни действия/след евакуацията на хора/ се предприемат преди да се включи стационарната противопожарна СО<sub>2</sub> система?", "Информира се бреговия офис.", "Спират се всички КДВГ и котли.", "Херметизира се максимално възможно МКО.", "Нищо от изброеното не е съществено.", "В" ,"34 ."],
[ "  Коя от системите е подходяща за противопожарна защита на помещенията за съхранение на боя на борда според SOLAS част С 6.3.1 ?", "Водооросителна или спринклерна система, проектирана за 5 л/м² за минута.", "Система с въглероден двуокис, предназначена да осигурява минимален обем свободен газ равен на 40% от общия обем на защитаваното помещение.", "Система със сухо прахообразно вещество, проектирана за най-малко 0.5 кг прахообразно вещество за 1 м³.", "Всичко описано в А), Б) и В).", "Г" ,"35 ."],
[ "  На какво разстояние от пламъка е ефективен  въгледвуокисния пожарогасител?", "От 1.0  до 2.5 метра.", "От 2.0 до 3.5 метра.", "От 3.0  до 3.5 метра.", "От 4.0 до 5.5 метра.", "А" ,"36 ."],
[ "  Кое от твърденията за въгледвуокисния  пожарогасител не е вярно?", "Въглеродният диоксид е негорим газ, който отнема достъпа на кислород като елемент от Триъгълника на пожара.", "Гасят чрез образуване на тънък  слой над горящите материали.", "СО<sub>2</sub> излиза във вид на сняг при температура около минус 68 °С  и отнема част от топлината на пожара.", "Пазете незащитените части на тялото си при работа с такъв тип пожарогасители.", "Б" ,"37 ."],
[ "  Какъв химически елемент е праха в праховите пожарогасители?", "Амониев фосфат.", "Калиев нитрат.", "Натриев бикарбонат.", "А)  и  В).", "Г" ,"38 ."],
[ "  Кое основно правило трябва да спазваме преди всичко при гасенето на пожар?", "Движим струята на пожарогасителя от единия край до другия.", "Да се доближим максимално, но безопасно до огъня.", "Да не допускаме пожарът да се озове между нас и изхода.", "Да херметизираме обема на помещението.", "В" ,"39 ."],
[ "  Защо трябва да се изчака до охлаждане на херметизираното помещение в което е бил пожара преди да се влиза в него?", "За да се предотврати опасността от взрив.", "За да се предотврати наново запалване на пожара.", "А) и Б)", "За да не се рискува прекалено с влизащите в помещението.", "В" ,"40 ."],
[ "  Какво ще обявите първо в съобщението към мостика за открит пожар?", "Мястото на пожара.", "Името си.", "Какъв материал гори.", "Степента на развитие на пожара.", "Б" ,"41 ."],
[ "  Колко пъти и как трябва да се натисне ръкохватката на прахов пожарогасител за да започне да разпръсква съдържанието си?", "Разкъсва се пломбата, изважда се щифтът, натиска се палецът и струята се насочва към мястото на пожара.", "Натиска се ръкохватката до крайно положение, след това се отпуска. Изчаква се 10-15 секунди и повторно се натиска за да заработи.", "Разкъсва се пломбата, изважда се щифтът, натиска се палецът изчаква се, натиска се пак  и струята се насочва към мястото на пожара.", "Указано е в инструкцията към пожарогасителя.", "Г" ,"42 ."],
[ "  Колко е процентният състав на кислорода в теоретично инертирана среда?", "5%.", "7%.", "9%.", "11%.", "Г" ,"43 ."],
[ "  Какви са симптомите при понижена до 17% концентрация на кислород в атмосферата?", "Загуба на съзнание.", "Липса на координация, учестено дишане.", "Тревожност, главоболие, силна депресия.", "Няма ясно забелижими симптоми, но се чувства неразположение.", "Б" ,"44 ."],
[ "  От какво зависи вида и количеството на токсичните газове при пожара?", "От химичният състав на горящите материали.", "От температурата на горене.", "От количеството на кислорода в помещението.", "Всичко описано в А), Б) и В).", "Г" ,"45 ."],
[ "  Кой от изброените токсични газове има най-тежко въздействие върху човека - едно вдишване предизвиква моментална смърт?", "Водороден хлорид.", "Азотен двуокис.", "Водороден цианид.", "Серен двуокис.", "Б" ,"46 ."],
[ "  Разпределително табло, което се захранва директно от главния източник на електроенергия, и е предназначено да разпределя електрическата енергия на кораба се нарича:", "Главно разпределително табло.", "Авариен източника на електроенергия.", "Централен пулт за управление.", "Местно разпределително табло.", "А" ,"47 ."],
[ "  Могат ли горивни танкове да се използуват за приемане на баласт?", "Не може, защотото противоречи на Конвенция MARPOL.", "Може, ако има система за сепарация на нефтоводни смеси.", "Зависи само от предназначението на кораба.", "Зависи само от класа на кораба.", "Б" ,"48 ."],
[ "  В какви помещения са поместени дейдвудните тръби?", "Във водонепроницаеми помещения.", "Помещения с блиндирани люкове.", "Помещения с клас А-15.", "Помещения с клас А-50.", "А" ,"49 ."],
[ "  Достъпът до кофердами, баластни танкове, товарни танкове и други помещения в товарното пространство трябва да се осъществява непосредствено от:", "Двойното дъно.", "Клинкетната врата на машинно отделение.", "Открита палуба, позволяваща извършването на цялостно обслужване.", "Помпено отделение.", "В" ,"50 ."],
[ "  Вертикалната надлъжна равнина, която минава по средата на ширината на кораба се нарича:", "Диаметрална равнина.", "Хоризонтална равнина.", "Средна равнина.", "Работна равнина.", "А" ,"51 ."],
[ "  Вертикалната напречна равнина, която дели кораба на две части – носова и кърмова, се нарича:", "Средна равнина.", "Равнина на средното ребро.", "Диаметрална равнина.", "Работна равнина.", "Б" ,"52 ."],
[ "  Пресечените линии на повърхността на кораба с равнини, успоредни на диаметралната равнина са наричат:", "Батокси.", "Средно ребро.", "Кници.", "Ребра.", "А" ,"53 ."],
[ "  Изображенията на пресечените линии на трите групи равнини с корпуса на кораба върху теоретичния чертеж се наричат: ", "Главни водолинии.", "Теоретични линии.", "Средни водолинии.", "Работни водолинии.", "Б" ,"54 ."],
[ "  Диаметралната равнина  минава през .....?....на кораба и го разделя на............ /част/.", "Средата, на лява и дясна част.", "Средата, на предна/нос/ и задна /кърма/ част.", "Главната палуба, надводна и подводна част.", "Главната палуба и подводна част.", "А" ,"55 ."],
[ "  Разстоянията по море се измерват в:", "Морски мили.", "Километри.", "Мили.", "Футове.", "А" ,"56 ."],
[ "  Разликата в газенето на кораба на носа и кърмата при плаване се нарича:", "Теоретичен диферент.", "Крен.", "Експлоатационен диферент.", "Проектен диферент.", "В" ,"57 ."],
[ "  Разстоянието, изминато в морски мили от търговски кораб за един час се нарича:", "Бързоходност.", "Маневреност.", "Скорост.", "Мореходност.", "В" ,"58 ."],
[ "  Единицата за измерване на скоростта на търговския кораб се нарича :", "Км/ч.", "Възел.", "М/с.", "Кб/сек.", "Б" ,"59 ."],
[ "  Уредът, служещ за измерване на скоростта на кораба се нарича:", "Лаг.", "Ехолот.", "Тахометър.", "Спидометър.", "А" ,"60 ."],
[ "  Източник на мощност на търговските кораби са:", "Енергетичните уредби.", "Корабната спомагателна уредба.", "Рулевото устройство.", "Всичко изброено.", "А" ,"61 ."],
[ "  Отворите за проникване в двойното дъно се наричат:", "Гърловини.", "Илюминатори.", "Комингси.", "Люкове.", "А" ,"62 ."],
[ "  Има ли условия за правене на отвори във водонепроницаемите прегради?", "Разрешава се само в краен случай.", "Единственото условие е отвора да се затваря с капак от същия материал.", "Само ако отвора се затваря дистанционно.", "Само ако отвора се затваря автоматично.", "А" ,"63 ."],
[ "  Централизираното затваряне на вратите на машинно отделение е необходимо за:", "Осигуряване на сигурността на кораба.", "Осигуряване на безопасна работа на екипажа.", "Противопожарна гледна точка.", "Не се изисква.", "Г" ,"64 ."],
[ "  Механизмите на кораба се монтират върху специални конструкции наречени:", "Ребра.", "Фундаменти.", "Кници.", "Легла.", "Б" ,"65 ."],
[ "  Къде се закрепват палубните механизми?", "На корабния набор.", "На комингси.", "На палубата, като под тях се прави усилване с допълнителни греди.", "На удобни за работа места.", "В" ,"66 ."],
[ "  С какво трябва да бъдат снабдени всички врати във водонепроницаемите прегради, SOLAS част В пр.22.1 /?", "Индикатори, показващи дали вратите са отворени или затворени.", "Илюминатори, позволяващи да се види какво има от другата страна на вратата.", "Звукова сигнализация.", "Всяко от изброените.", "А" ,"67 ."],
[ "  В зависимост от мястото на възникване на пожарите те биват:", "Вътрешни, външни.", "Ограничени, неограничени.", "Повърхностни, цялостни.", "Периферни ограничени.", "А" ,"68 ."],
[ "  Основните принципи за осигуряване на безопасността срещу появата на пожари е регламентирана в:", "SCTW 78/95.", "SOLAS /78 II-2.", "MARPOL ANEX VI.", "Всичко изброено.", "Б" ,"69 ."],
[ "  Под пожароопасност разбираме:", "Вземането на адекватни противопожарни мерки.", "Периодични освидетелствувания.", "Склонността на превозвания товар към запалване.", "Няма такова определение.", "В" ,"70 ."],
[ "  Под пожар разбираме:", "Сложен физически процес.", "Сложен физико-химичен процес.", "Неорганизиран процес на горене, протичащ на нежелани места и водещ до материални щети.", "Сложен термичен процес.", "В" ,"71 ."],
[ "  Горенето зависи и протича в:", "Само в кислородна среда.", "Зависи от химичният състав на веществото, горенето може да протече в друга среда.", "Горенето зависи само от температурата на околната среда.", "Горенето зависи само от структурата на веществото.", "Б" ,"72 ."],
[ "  Скоростта на изгаряне на твърдите материали зависи от:", "Относителното тегло на материала.", "От структурата на материала.", "От влажността на материала.", "От вида на материала.", "В" ,"73 ."],
[ "  Според организацията на горивният процес пожарите биват:", "Хомогенни и дифузни.", "Хетерегенни.", "А) и Б).", "Нееднородни.", "В" ,"74 ."],
[ "  Температурата на възпламеняване е:", "Основно химично свойство на веществата.", "Показател, характеризиращ запалимостта на веществата.", "Свойство на твърдите вещества.", "Основно физично свойство на веществата.", "Б" ,"75 ."],
[ "  Самовъзпламеняването бива:", "Естествено, изкуствено.", "Топлинно, химично, микробиологично.", "Термично.", "Физично.", "Б" ,"76 ."],
[ "  Под разпространение на пожарите разбираме:", "Промяната на температурата в централната му зона.", "Изменение на параметрите му в пространството и времето.", "А) и Б).", "Промяната на температурата в околната му зона.", "Б" ,"77 ."],
[ "  С въгледвуокисната система гасим пожари в:", "Корабната надстройка.", "Складовите помещения.", "МКО, котелно отделение, товарни помещения.", "Хладилни помещения.", "В" ,"78 ."],
[ "  Водонепроницаемите закрития се затварят:", "Всеки ден при приключване на товаро-разтоварните работи.", "Когато има щормово предупреждение.", "При подготовка на кораба за отплаване и при тревога.", "Само по нареждане на капитана.", "В" ,"79 ."],
[ "  Кое е най-важното от изброените действия при пожар в товарен трюм, касаещо устойчивостта на кораба? ", "Да се осигури работата на главната и аварийната пожарни помпи.", "Да се маневрира така, че пожарът да остане от подветрената страна.", "Да се изпомпва зад борд водата, използвана за гасене на пожара.", "Да се отделят и изхвърлят зад борд отломките от пожара.", "В" ,"80 ."],
[ "  Сантините се замерват за установяване на: ", "Количеството на кондензацията в хамбара.", "Наличието на  течове от товара.", "Постъпването на вода в корпуса на кораба.", "Всичко изброено в отговори А), Б) и В).", "Г" ,"81 ."],
[ "  Ако кораб наруши изискванията на МАРПОЛ на територията на друга страна по конвенцията, санкциите се определят от:", "Разпоредбите на Конвенцията.", "Нормите на международното морско право.", "Законодателството на държавата на знамето.", "Законодателството на страната, където е извършено нарушението.", "Г" ,"82 ."],
[ "  В дневника за нефтени операции се вписват данни и за следните действия в машинно отделение:", "Инцидентно изхвърляне на нефт, превключване системата за автоматично изхвърляне в режим автоматична/ръчна работа, баластиране на товарен трюм.", "Изхвърляне на мръсен баласт от горивните танкове, изгаряне на течни отпадъци, изхвърляне на мръсен баласт от баластни танкове.", "Приемане на гориво, изхвърляне на сантинни води, прехвърляне на горива и масла между танкове.", "Изхвърляне на мръсен баласт от горивните танкове, изхвърляне на мръсен баласт от баластни танкове.", "В" ,"83 ."],
[ "  Противопожарният шлем е:", "Индивидуално средство за противопожарна защита.", "Персонално средство за противопожарна защита.", "Колективно средство за противопожарна защита.", "Всичко изброено.", "А" ,"84 ."],
[ "  По време на кораборемонт противопожарните системи са:", "Консервирани.", "Стоят в готовност за евентуално пускане.", "Намират се извън строя.", "Тяхното състояние не се определя.", "Б" ,"85 ."],
[ "  Според агрегатното си състояние гасящите вещества биват:", "Въздушни, прахови.", "Течни, пеногасене.", "А) и Б).", "Водни, прахови.", "В" ,"86 ."],
[ "  Корабната пожарна сигнализация бива:", "Пожарооткриваща, пожароуказваща.", "Аварийна.", "Предупредителна.", "Сигнална.", "А" ,"87 ."],
[ "  Съхранението на противопожарното оборудване трябва да е такова, че да осигурява:", "Удобна работа на екипажа.", "Да бъде винаги изправно и годно за незабавна употреба.", "Няма специални изисквания към него.", "Зависи от класа на кораба.", "Б" ,"88 ."],
[ "  Основна причина за самозапалването на електрическите механизми е:", "Лоша изолация, претоварване по сила на тока.", "Големи вибрации в механизмите.", "Консервиране на електрическите механизми.", "Висока температура на околната среда.", "А" ,"89 ."],
[ "  На кораба е разрешено пушенето:", "На строго регламентирани от капитана места.", "Само на открита палуба.", "В салета и канижелите.", "Само в салета.", "А" ,"90 ."],
[ "  На местата за пушене трябва да има:", "Добра изолация.", "Съд с вода или преносим пожарогасител.", "Добро осветление.", "Добра видимост.", "Б" ,"91 ."],
[ "  На лошо осветени места като допълнително осветление може да се използва:", "Открит огън.", "Факли, свещи.", "Взривообезопасени фенери, взривобезопасни преносими лампи.", "Фенери.", "В" ,"92 ."],
[ "  Начините за гасене на пожари биват:", "Повърхностен.", "Обемен.", "И по двата начина.", "Равнинен.", "В" ,"93 ."],
[ " Конструктивните мерки за осигуряване на пожарна безопасност се изпълняват при:", "Проектирането и постройката на кораба.", "Ремонт на корабният корпус.", "А) и Б).", "Обслужване на корабният корпус.", "А" ,"94 ."],
[ " Пожароопасни се смятат тези вещества които:", "Се изпаряват при температури около 100  ºС.", "Са способни да се запалят под въздействието на пламък или химична реакция.", "Променят агрегатното си състояние при загряване.", "Променят състава си при загряване.", "Б" ,"95 ."],
[ " Под взрив разбираме:", "Неконтролируем горивен процес при който за единица време се отделя огромно количество топлина.", "Екзотермична реакция.", "Ендотермична реакция.", "Хексотермична реакция.", "А" ,"96 ."],
[ " Водната противопожарна система работи с:", "Сладка вода.", "Водата от котела.", "Задбордна вода.", "Питева вода.", "В" ,"97 ."],
[ " Горенето е:", "Химичен процес на окисляване с отделяне на голямо количество топлина.", "Физичен процес.", "Биохимичен процес.", "Биотермичен процес.", "А" ,"98 ."],
[ " Начините на натравяне на човешкия организъм при гасене на пожари са:", "По пътя на вдишването, при попадане на горящо вещество върху кожата.", "При поглъщане.", "А) и Б).", "При стоене близко до пожара.", "А" ,"99 ."],
[ "  Изискванията за пожарна безопасност са дадени в:", "Конвенция SOLAS 78 III.", "Конвенция SOLAS ’78 II-2.", "Конвенция MARPOL ‘78.", "SCTW 78/95.", "Б" ,"100 ."],
[ "  При възникване на пожар трябва да има:", "Система за автоматична предупредителна сигнализация.", "Система за плавно регулиране на вентилацията.", "Система за даване на сигнал SOS.", "Система за даване на сигнал до офиса на компанията.", "А" ,"101 ."],
[ "  В района на Черно и Средиземно море е разрешено да се изхвърлят от корабите в морето:", "Всякакви отпадъци на разстояние не по-малко от 12 мили от брега.", "Само хранителни отпадъци на разстояние не по-малко от 12 мили от брега .", "Само раздробени отпадъци на разстояние не по-малко от 2 мили от брега.", "Само хранителни отпадъци и остатъци от риба в найлонови торби.", "Б" ,"102 ."],
[ "  Главното рулево устройство на кораба трябва да може да премества руля:", "От 35º на единия борд до 35º на другия борд при нормални условия.", "От 35º на единия борд до 35º на другия борд, при максимално газене и максимална скорост напред.", "От 15º на единия борд до 15º на другия борд при максимално газене и скорост по-голяма от 7 възла, за 60 сек.", "От 35º на единия борд до 30ºна другия борд, при максимално газене и максимална скорост напред, за 28 сек.", "Г" ,"103 ."],
[ "  Изпълнителният директор на ИА “МА” ограничава временно правото на правоспособно морско лице да изпълнява задълженията си при употреба на алкохол за срок:  ", "До 1 година.", "До 2 години.", "От 1 до 5 години.", "От 6 месеца до 1 година.", "Г" ,"104 ."],
[ "  Кой има право да проверява корабния план за сигурност?", "Капитанът на кораба.", "Офицерът по сигурността на компанията.", "Офицерът по сигурността на пристанището.", "Верни са отговори А) и Б).", "Г" ,"105 ."],
[ "  Колко нива на сигурност са определени в SOLAS Ch.XI-2.?", "3 нива.", "5 нива.", "4 нива.", "2 нива.", "А" ,"106 ."],
[ "  “Дневниците за нефтени операции” на корабите са:", "1 вид – за всички кораби.", "2 вида – за танкери и за всички останали.", "3 вида - за танкери, за химикаловози и за всички останали.", "За всеки вид кораби.", "Б" ,"107 ."],
[ "  На какво разстояние от най-близкия бряг и при какви условия могат да се изхвърлят отпадни води, които не са от събирателен танк?", "На повече от 3 мили, когато са раздробени, дезинфекцирани и се изхвърлят през одобрено от Администрацията устройство.", "На повече от 12 мили, когато не са раздробени и дезинфекцирани.", "На повече от 4 мили, когато са раздробени и дезинфекцирани.", " А) и Б).", "Г" ,"108 ."],
[ "  На кои кораби трябва да има “Дневник за нефтените операции”?", "Танкери и химикаловози над 500 GT.", "На всички кораби над 500 GT на танкери над 150 GT и всички останали над 400 GT.", "На танкери над 150 GT, на химикаловози над 300 GT и на сухотоварни над 500 GT.", "На танкери над 150 GT и всички останали над 400 GT.", "Г" ,"109 ."],
[ "  Отпадни води по смисъла на Анекс ІV на МАРПОЛ са:", "Отточни води и отпадъци от тоалетни, писуари, медицинския лазарет и хоспитал или води смесени с предходните.", "Отточни води и отпадъци от тоалетни, писуари, медицинския лазарет и хоспитал, помещенията, в които има живи животни или води смесени с предходните.", "Отточни води от тоалетни, писуари, медицинския лазарет и хоспитал.", "Отточни води от тоалетни, писуари.", "Б" ,"110 ."],
[ "  Отпадни води, когато не са от събирателния танк, се изхвърлят при спазване на следните условия:", "Корабът е на ход, намира се извън специален район, изхвърлянето се извършва през одобрено устройство.", "Изхвърлянето се извършва през одобрено устройство за обработка и няма видими твърди частици и оцветяване на околната вода.", "Корабът е на ход, намира се на разстояние >12 морски мили от най-близкия бряг.", "Изхвърлянето се извършва през одобрено устройство за обработка, резултатите от теста му са вписани в ISPPC.", "Б" ,"111 ."],
[ "  Проверката на рулевото устройство, преди отплаване, трябва да включва:", "Почистване и смазване на зъбните предавки.", "Пълно развъртане на перото на руля с всяка рулева машина според изискваните възможности на устройството.", "Визуален оглед на перото на руля.", "Проверка защитата на ел. двигателите на рулевата машина от претоварване.", "Б" ,"112 ."],
[ "  Машинното отделение спада към:", "Товарните корабни помещения.", "Общокорабните помещения.", "Специализираните корабни помещения.", "А) и Б).", "В" ,"113 ."],
[ "  Системите за обемно гасене трябва да имат:", "Дублиращи източници за захранване.", "Трябва да имат статично задвижване.", "Няма такова изискване.", "Независими източници за захранване.", "А" ,"114 ."],
[ "  Вентилацията в затворените помещения бива:", "Нагнетателна, изсмукваща.", "Само нагнетателна.", "Само изсмукваща.", "Естествена.", "А" ,"115 ."],
[ "  Задължителни за машинно отделение са следните противопожарни системи:", "Въгледвуокисна, водна.", "Водна, парогасене.", "Водна.", "Парогасене.", "А" ,"116 ."],
[ "  Преграда с клас А-60 означава :", "Стоманена конструкция с усилени ребра и термоизолация, която издържа 60 минути на темп. разлика 927 ºС.", "Стоманена конструкция с усилени ребра, без термоизолация.", "Стоманена конструкция с усилени ребра и термоизолация, която издържа 15 минути на темп. разлика повече от 500  ْС.", "Стоманена конструкция с усилени ребра и термоизолация, която издържа 30 минути на темп. разлика повече от 300  ْС.", "А" ,"117 ."],
[ "  Всички пожароопасни помещения на кораба са направени с клас на пожароопасност:", "Клас А.", "Клас В.", "Клас С.", "Клас F.", "А" ,"118 ."],
[ "  Пожароизвестителите реагират  на:", "Топлина.", "Димна концентрация.", "А) и Б).", "Удар.", "В" ,"119 ."],
[ "  Системите за откриване на дим и огън се състоят от:", "Захранващо устройство, ел.траса.", "Захранващо, свързващо устройство, ел. траса, приемна станция и известители.", "Приемна станция и клемореди.", "Захранващо устройство, приемна станция и известители.", "Б" ,"120 ."],
[ "  Пожарогасителите са:", "Елемент на лична екипировка на пожарникаря.", "Местни средства за локално потушаване на пожари.", "А) и Б).", "Всичко изброено.", "Б" ,"121 ."],
[ "  Разузнаването при възникнал пожар се извършва от:", "Един човек, екипиран надежно.", "От противопожарна група.", "Не се прави такова разузнаване.", "Който пристигне пръв на мястото.", "Б" ,"122 ."],
[ "  Спазването на противопожарните мерки е:", "Абсолютно задължително условие при гасене на пожари.", "Препоръчително условие.", "Зависи от големината на пожара.", "Зависи от правилата на компанията.", "А" ,"123 ."],
[ "  Удължаването на шлангове по време на гасене на пожар с вода става при:", "Спряно захранване с вода от магистралата.", "Намалява се налягането на водата в магистралата.", "Няма изисквания.", "Както е бързо и удобно за екипажа.", "А" ,"124 ."],
[ "  MARPOL Annex VI “Правила за предпазване на въздуха” съдържа:", "Ограничения само за сярното съдържание в горивото.", "Само технически спецификации за инсенераторите.", "Ограничения за пет вида емисии.", "Ограничения само за азотното съдържание в горивото.", "В" ,"125 ."],
[ "  Условията за изхвърляне на корабни отпадъци съгласно Annex V на MARPOL73/78 за специални райони са следните:", "Има ограничения за изхвърляне на отделните категории до 12 мили от брега.", "Има ограничения за изхвърляне на отделните категории до 3 мили от брега.", "Разрешено е изхвърлянето само на хранителни отпадъци над 12 мили от брега.", "Има ограничения за изхвърляне на отделните категории до 7 мили от брега.", "В" ,"126 ."],
[ "  “Garbage Management Plan” e:", "Пристанищен документ за управление на отпадъците от корабите.", "Документ на корабна компания по ISM Code.", "Корабен план изготвян по MARPOL Annex V.", "Корабен план изготвян по SOLAS Annex 1.", "В" ,"127 ."],
[ "  Инерт-газ системата се използва :", "За гасене на пожар в товарните помещения на кораба.", "За гасене на пожар в машинното отделение.", "В експлоатационната дейност на танкерите.", "За гасене на запалени нефтопродукти в товарните танкове.", "В" ,"128 ."],
[ "  Ученията на екипаж, подновен с 25% и повече, се провеждат:", "След напускане на пристанището.", "Преди напускане на пристанището.", "До 24 часа от напускане на пристанището.", "До една седмица от напускане на пристанището.", "В" ,"129 ."],
[ "  Всички спасителни средства, след сигнал за напускане на товарен кораб, трябва да бъдат спуснати с хора и снабдяване за не повече от: ", "30 минути.", "10 минути.", "15 минути.", "20 минути.", "Б" ,"130 ."],
[ "  Как се насочва пенната струя към горящи хоризонтални повърхности?", "Към средата на повърхността.", "Към най-близкия край на огнището.", "Към краищата на огнището и постоянно се премества към центъра.", "Облива се с кръгови движения по часовата стрелка.", "В" ,"131 ."],
[ "  Кога трябва да бъде извършван визуален оглед на лодбалката на спасителна лодка на товарен кораб?", "При месечните инспекции и тренировки.", "Всяка седмица.", "На всеки три месеца.", "При необходимост.", "Б" ,"132 ."],
[ "  Конструктивната пожарна защита включва обособяването на:", "Хоризонтални и вертикални противопожарни зони.", "Начина на откриване на пожарите.", "Противопожарни инсталации и съоръжения.", "Пожарообезопасени помещения.", "А" ,"133 ."],
[ "  Парогасенето е най-ефективно при гасене на пожари в:", "Товарни трюмове.", "Машинни помещения.", "Горивни танкове и цистерни.", "Жилищни и служебни помещения.", "В" ,"134 ."],
[ "  При пожар в кухнята, електрическата инсталация, навигационни и други средства под ел.напрежение, най-подходящото средство за гасене е:", "Химическа пяна.", "Прахови средства.", "Въглероден двуокис.", "Плътна водна струя.", "В" ,"135 ."],
[ "  Приоритетни цели на ISM Code са:", "Сигурността на кораба и пристанищата.", "Компетентност и квалификация на екипажа.", "Изисквания към радиооборудването на новите кораби.", "Безопасната експлоатация на кораба и избягване на нанасяне на щети на околната среда.", "Г" ,"136 ."],
[ "  Системата за СО<sub>2</sub> гасене трябва да може да изпусне в машинното отделение 85% от газа за:", "8 минути.", "5 минути.", "3 минути.", "2 минути.", "Г" ,"137 ."],
[ "  Съгласно SOLAS, гл. ІІІ, лодъчните двигатели се пускат пробно за по три минути:", "Всеки месец.", "Всяка седмица.", "По време на ремонт.", "На всеки три месеца.", "Б" ,"138 ."],
[ "  Съгласно SOLAS, Глава III спасителните средства трябва да бъдат готови за използване:", "Преди всяко отплаване и по време на преход.", "По всяко време, когато корабът е в експлоатация.", "Не се регламентира.", "Винаги с изключение на плаване в реки.", "А" ,"139 ."],
[ "  Съдържанието на кислород в инертния газ след инерт-газ системата не трябва да превишава:", "5 %.", "8 %.", "10 %.", "12 %.", "А" ,"140 ."],
[ "  Съдържанието на кислород в атмосферата на инертиран товарен танк не трябва да превишава:", "5 %.", "8 %.", "10 %.", "12 %.", "Б" ,"141 ."],
[ "  Аварийният източник на ел. енергия на пътническите кораби трябва да осигурява захранване за основните корабни средства и помещения за:", "18 часа.", "24 часа.", "36 часа.", "48 часа.", "В" ,"142 ."],
[ "  В спасителна лодка, спускана по метода “свободно падане”, спасителните ризи се обличат:", "След спускане на лодката.", "Преди спускане на лодката.", "След влизане, но преди спускане на лодката.", "Преди влизане в лодката.", "А" ,"143 ."],
[ "  В териториални води може да се изхвърлят отпадъчни води през корабната система ако са изпълнени следните условия: ", "Има сертифицирана система съгласно правило 3 от този Annex.", "А) + липса на видими частици или променен цвят на водата.", "А) и Б). + изискванията на държавата да не са по строги.", "Има сертифицирана система съгласно правило 6 от този Annex.", "В" ,"144 ."],
[ "  Annex III на MARPOL 73/78  “Правила за предотвратяване на замърсяването с вредни вещества, превозвани по море в опаковка” влиза в сила:", "На 01 Юли 1992 г.", "Не е в сила.", "На 02 Октомври 1983 г. ", "На 01 Юли 2002 г.", "А" ,"145 ."],
[ "  Изискванията по Annex III на MARPOL 73/78 валидни ли са за корабното оборудване и запаси?", "Да.", "Да, ако оборудването е в опаковка.", "Не.", "Да, ако оборудването не е опасно.", "В" ,"146 ."],
[ "  Annex II на MARPOL 73/78 “Правила за предотвратяване на замърсяването с вредни вещества, превозвани по море в опаковка” влиза в сила на:", "Не е в сила.", "През 1987 г.", "При подписването на Annex III, IV, V.", "При подписването на Annex  V.", "Б" ,"147 ."],
[ "  Съгласно Annex II на MARPOL 73/78 изхвърлянето на вредни течни вещества в 12 милната зона е разрешено, ако са спазени следните условия:", "Корабът има филтрираща система.", "Корабът има филтрираща система и е сертифициран за превоз на такива товари.", "Не е разрешено при никакви условия.", "Зависи от класа на кораба.", "В" ,"148 ."],
[ "  Annex I на MARPOL 73/78 “Правила за предпазване от замърсяване с нефтопродукти” влиза в сила на :", "На Международната конференция на ИМО през 1973 г.", "На 02 Октомври 1983 г.", "На Международната конференция на ИМО през 1978 г.", "На 02 Октомври 1988 г.", "Б" ,"149 ."],
[ "  За какво служи “Дневника за плавателна практика” /Training record book/ съгласно STCW 78/95 Reg.III/1:", "За отчитане на стажанта пред учебното заведение.", "За отчитане, регистриране и оценка на плавателният стаж от ИА“МА”.", "Само за самообучение на стажанта.", "За отчитане на стажанта пред капитана.", "Б" ,"150 ."],
[ "  Каква навършена възраст се изисква, съгласно STCW 78/95 Reg.III/1, за получаване на правоспособност вахтен механик на кораб с пропулсивна мощност над 750 кW:", "16 години.", "18 години.", "21 години.", "23 години.", "Б" ,"151 ."],
[ "  Личните предпазни средства в машинно отделение се осигуряват и са под контрола на: ", "Главният механик.", "Вторият механик.", "Палубният боцман.", "Машинният боцман.", "А" ,"152 ."],
[ "  Използването на палубен кран за товаро-разтоварни операции се допуска когато:", "Крана е в експлоатация до 5 години след производството му.", "Крана има сертификат от изпитване, намиращ се на борда на кораба.", "Крана е в изправност и има сертификат от изпитване намиращ се в компанията.", "Крана е в експлоатация до 3 години след производството му.", "Б" ,"153 ."],
[ "  Преносимите ръчни ел.инструменти и осветителни тела на борда на кораба е разрешено да са с напрежение до :", "12 волта.", "220 волта.", "42 волта.", "36 волта.", "В" ,"154 ."],
[ "  При бункероване на гориво е необходимо да бъдат взети следният брой проби:", "Една в началото на бункероването.", "Три броя.", "Една в началото и една в края на бункероването.", "Пет броя.", "Б" ,"155 ."],
[ "  При бункероване на масло е необходимо да бъдат взети следният брой проби :", "Не е необходимо.", "Три броя.", "Един брой.", "Пет броя.", "В" ,"156 ."],
[ "  Ръководител на аварийната партия за гасене на пожари в машинно отделение е:", "Вторият механик.", "Третият пом.капитан.", "Главният механик.", "Ст.пом. капитана.", "В" ,"157 ."],
[ "  Глава VIII от STCW 78/95 изисква почивките на вахтените лица за седмица да са не по-малко от:", "84 часа.", "77 часа.", "48 часа.", "62 часа.", "Б" ,"158 ."],
[ "  Водната пожарогасителна система трябва да осигурява за всяка част от кораба най-малко:", "4 струи вода.", "3 струи вода.", "2 струи вода.", "1 струя вода.", "В" ,"159 ."],
[ "  Водната противопожарната система за Ро-Ро помещенията трябва да осигурява до всяка точка от помещението:", "4 струи вода.", "3 струи вода.", "2 струи вода.", "1 струя вода.", "А" ,"160 ."],
[ "  Възможността за възникване на пожар се определя от едновременното наличие на:", "Горимо вещество, кислород и източник на запалване.", "Кислород, въглероден диоксид и азот.", "Горива и масла, огън и въглероден диоксид.", "Дървени предмети, хартия и огън.", "А" ,"161 ."],
[ "  Дежурната лодка трябва да може да се спуска при следната скорост на кораба:", "При скорост на кораба до 5 възла.", "При скорост на кораба до 9 възла.", "При скорост на кораба до 7 възла.", "Без ход на кораба.", "А" ,"162 ."],
[ "  Ефектът на действие на водата върху пожара се увеличава, ако се използва:", "Плътна водна струя.", "Като факел.", "В дисперсно състояние.", "При високо налягане.", "В" ,"163 ."],
[ "  Наръчник за ученията трябва да има:", "На мостика и в машинното отделение.", "В каютите.", "На места, където се носи вахта.", "Във всеки салон за хранене и почивка или във всяка кабина на екипажа.", "Г" ,"164 ."],
[ "  Общокорабната аварийна сигнализация се проверява:", "Всяка седмица.", "Веднъж на две седмици.", "Всеки месец.", "При корабни учения.", "А" ,"165 ."],
[ "  Плътната водна струя при гасене на възпламенени нефтопродукти се използва за:", "Директно гасене на пожара.", "Охлаждане на стените, бордовете или палубите, граничещи с пожара.", "Създаване на водна преграда между пожара и пожарникарите.", "Гасене на пожар в служебните помещения.", "Б" ,"166 ."],
[ "  Спусковото устройство трябва да вдига натоварена с хора и снабдяване спасителна лодка със скорост не по-малка от: ", "0,2 метра в секунда.", "0,3 метра в секунда.", "0,4 метра в секунда.", "0,5 метра в секунда.", "Б" ,"167 ."],
[ "  Тренировките със спасителни салове, спускаеми с устройства, трябва да се провеждат на интервали не по-дълги от: ", "2 месеца.", "3 месеца.", "4 месеца.", "6 месеца.", "В" ,"168 ."],
[ "  Указания за безопасност при влизане в затворени пространства ще намерим в:", "В отделното издание на IMO за бърза медицинска помощ - MFAG.", "В приложението (Suppliment) към IMDG Code.", "В приложение към BC Code.", "В резолюция A. 720 (20).", "В" ,"169 ."],
[ "  Администрацията може да разреши на правоспособно морско лице да заеме една длъжност по-висока за период:", "До 3 месеца.", "До 6 месеца.", "До 9 месеца.", "До 1 година.", "А" ,"170 ."],
[ "  STCW 78/95 изисква следната допълнителна подготовка за типове кораби като пътнически, Ро-Ро и фериботи:", "Медицински грижи.", "Управление на тълпата.", "Гасене на пожари със съвременни методи.", "Спасителни средства.", "Б" ,"171 ."],
[ "  При носене на ходова вахта в машинното отделение вахтеният механик трябва:", "Да присъства в ЦПУ или машинното отделение по време на вахтата.", "Да бъде на мостика според разпорежданията на капитана.", "Да бъде в кабината си, като  бъде винаги на разположение за повикване.", "Да бъде на разположение за повикване.", "А" ,"172 ."],
[ "  Двигателят на спасителните лодки трябва да бъде в състояние да работи след пускането му, когато спасителната лодка е извън водата, в продължение на:", "3 минути.", "5 минути.", "7 минути.", "10 минути.", "Б" ,"173 ."],
[ "  За да запази правоспособността си морското лице трябва да има през последните 5 години плавателен стаж най-малко:", "1 година.", "2 години.", "2,5 години.", "3 години.", "А" ,"174 ."],
[ "  Застъпващият нощна вахта механик видимо е употребил алкохол в неразрешено количество. Действията на вахтения механик трябва да са:", "Предава вахтата и на следващият ден уведомява гл.механик.", "Предава вахтата и му казва, ако има проблеми да му се обади.", "Не предава вахтата и информира незабавно гл.механик.", "Предава вахтата и му казва къде ще се намира.", "В" ,"175 ."],
[ "  За кого се изисква подготовка и сертификат по “Fire fighting and fire prevention” съгласно STCW 78/95 reg.VI/1 :", "Само за главни механици.", "От всички членове на екипажа.", "Само от навигационните офицери.", "Само за втори механици.", "Б" ,"176 ."],
[ "  За кого се изисква допълнителна подготовка и сертифициране за работа на борда на танкер, съгласно STCW 78/95:", "За капитана и главният механик само.", "Само за тези, които са ангажирани в товаро-разтоварните операции.", "За всички членове на екипажа.", "За ст.пом.капитана и главният механик само.", "Б" ,"177 ."],
[ "  Съгласно Наредба №6 за компетентност на морските лица, подновяването на свидетелството за компетентност се извършва от ИА“МА” след като лицето представи:", "Старото свидетелство.", "Медицинско свидетелство за годност + свидетелство за правоспособност + удостоверение за плавателен стаж най-малко една година през последните пет.", "Автоматично.", "Заявление и медицинско свидетелство.", "Б" ,"178 ."],
[ "  Какво е максималното работно време за едно денонощие на кораб съгласно конвенцията ILO 180?", "10 часа.", "14 часа.", "8 часа.", "16 часа.", "Б" ,"179 ."],
[ "  Инертни газове, използвани като огнегасящи средства са:", "Въгледвуокис и изгорели газове от котли и ДВГ.", "Азот.", "А) и Б).", "Аргон.", "В" ,"180 ."],
[ "  ISM кодът изисква :", "Документирани процедури за характерни опасности.", "Сертификати за безопасност и качество.", "Документи за качество на работния процес.", "Няма такива изисквания.", "А" ,"181 ."],
[ "  При възникване на пожар на кораба първо се:", "Обявява тревога.", "Докладва на капитана.", "Започват действия по гасенето.", "Докладва на гл.механик.", "А" ,"182 ."],
[ "  От противопожарна гледна точка най-устойчиви са следните конструкции:", "А.", "В.", "С.", "F.", "А" ,"183 ."],
[ "  Кратност на пяната се нарича:", "Способността и да се противопоставя на разрушаващи процеси.", "Отношението между обема на пяната и обема на помещението за гасене.", "Отношението между обема на получената пяна и обема на изходния разтвор.", "Отношението между обема на пяната и обема на пожара.", "В" ,"184 ."],
[ "  Най–често въздушномеханичната пяна се използва за гасене на пожари от:", "Дървесни материали.", "Метали.", "Гориво – смазочни материали.", "Текстилни материали.", "В" ,"185 ."],
[ "  Универсалните противопожарни средства са :", "Праховите.", "Водата.", "Няма такива.", "Въгледвуокисните.", "В" ,"186 ."],
[ "  Двигателите на спасителните лодки трябва да стартират при 15 ºС за по-малко от:", "2 минути.", "10 минути.", "15 минути.", "Времето не е от значение.", "А" ,"187 ."],
[ "  EEBD / дихателни апарати за аварийно напускане / трябва да имат време за употреба:", "1 час.", "Неограничено.", "Минимум 10 минути.", "Времето не е от значение.", "В" ,"188 ."],
[ "  Съгласно STCW 78/95 пълна забрана за употреба на алкохол има:", "4 часа преди вахта.", "Няма значение, важно да не е пиян.", "12 часа преди вахта.", "8 часа преди вахта.", "А" ,"189 ."],
[ "  Времето за престой в задимен отсек с дихателен апарат се определя от:", "Показанията на манометъра.", "Звуковата предупредителна сигнализация на уреда.", "От гореспоменатите две възможности.", "Възможностите на човека.", "В" ,"190 ."],
[ "  Какви нива на отговорност въвежда STCW 78/ 95 Convention?", "Управленско, оперативно, изпълнителско.", "Командно и изпълнителско.", "Висше, средно и изпълнителско.", "Командно, управленско и изпълнителско.", "А" ,"191 ."],
[ "  Когато оказвате помощ на човек с трета степен изгаряне, вие трябва:", "Да потопите обгорелите места в студена вода.", "Да обработите обгорелите места с дезинфекциращ разтвор.", "Да изправите пострадалия и го накарате да ходи за да ускори кръвообращението си.", "Да покриете обгорелите места с дебели, стерилни наметки.", "Г" ,"192 ."],
[ "  Сигналът за общокорабна тревога се разпространява чрез корабна сирена и в допълнение с електрически звънци и се състои от:", "Три кратки звука 5 пъти в минута.", "Три кратки, три продължителни и три кратки звука.", "Седем или повече кратки звука последване от един продължителен.", "Последователни звуци, определят се от капитана и се вписват в разписанието за тревоги.", "В" ,"193 ."],
[ "  Спирачките на спусковото устройство трябва да могат да спират спускането на лодката с хора и снабдяване:", "За 5 секунди от спускането.", "За 2 секунди от спускането.", "По всяко време на спускането.", "На един метър от разстоянието на спускането.", "В" ,"194 ."],
[ "  Алкохолът има:", "Наркотичен ефект.", "Депресивен ефект.", "Обезболяващ ефект.", "Изброеното в отговори А) и Б).", "Г" ,"195 ."],
[ "  Какъв е регламентираният от STCW минимален период за почивка на екипажа за период от 24 часа?", "6 часа.", "12 часа.", "14 часа.", "10 часа, които могат да бъдат разделени на два периода, единият от които да е не по-малък от 6 часа.", "Г" ,"196 ."],
[ "  Аварийният източник на ел. енергия на товарните кораби трябва да осигурява захранване за основните средства и помещения за пероид от:", "12 часа.", "18 часа.", "24 часа.", "36 часа.", "Б" ,"197 ."],
[ "  Главният двигател и механизмите със съществено значение за безопасността на кораба трябва да могат да работят:", "При всякакви условия на бордово и килево клатене.", "При бордово клатене до 22,5º и едновременно килево клатене до 7,5º.", "При изправено положение и статичен крен до 15º.", "При крен до 20º и диферент 10º.", "Б" ,"198 ."],
[ "  На спасителната лодка трябва да има гориво за непрекъснат ход на двигателя при скорост 6 и повече възла за:", "10 часа.", "12 часа.", "18 часа.", "24 часа.", "Г" ,"199 ."],
[ "  Постовете за ръчна сигнализация при пожар се разполагат така, че от всяка част на коридорите до поста да има не повече от:", "10 метра.", "15 метра.", "20 метра.", "25 метра.", "В" ,"200 ."],
[ "  Скоростта на спасителната лодка с хора и снабдяване трябва да е не по-малка от:", "2 възла.", "4 възла.", "6 възла .", "7 възла.", "В" ,"201 ."],
[ "  Колко време “Bunker Delivery Note” се съхранява на борда на кораба?  ", "1 година.", "2 години.", "3 години.", "4 години.", "В" ,"202 ."],
[ "  Как ще дефинирате понятието “стрингер”?", "Напречни на корпуса греди.", "Надлъжни на корпуса греди.", "Бордови килове.", "Греди за повишаване здравината на палубата в зоната на комингсите.", "Б" ,"203 ."],
[ "  Каква най-ниска пламна точка се позволява за горива на КДВГ по СОЛАС II-2 /14.1.1?", "88 ºС.", "43 ºС.", "60 ºС.", "78 ºС.", "В" ,"204 ."],
[ "  В пристанищата на ЕС съдържанието на сяра  в използваните на кораба горива не може да надвишава :", "0,01 %.", "0,1 %.", "0,0001 %.", "0,015 %.", "Б" ,"205 ."],
[ "  Класификационните организации инспектират предпазните клапани на корабните котли за да:", "Видят най-високото налягане на котела, при което се отварят клапаните.", "За да проверят достатъчна ли е разтоварващата им способност като цяло.", "За да сравнят конструкцията и техническото им състояние с изискуемите.", "Всичко изброено.", "Б" ,"206 ."],
[ "  Конвенцията SOLAS 1974 се отнася за:", "Предпазване на моретата от замърсяване.", "Предпазване на човешкия живот на море и сигурност на корабоплаването.", "Подготовка и дипломиране на моряците и носене на ходова вахта.", "А) и В)", "Б" ,"207 ."],
[ "  Конвенцията MARPOL 1973/78 се отнася за:    ", "Предпазване на моретата от замърсяване.", "Предпазване на човешкия живот на море и сигурност на корабоплаването.", "Подготовка и дипломиране на моряците и носене на ходова вахта.", "Б) и В)", "А" ,"208 ."],
[ "  Конвенцията STCW 1978/95 се отнася за:    ", "Предпазване на моретата от замърсяване.", "Предпазване на човешкия живот на море и сигурност на корабоплаването.", "Подготовка и дипломиране на моряците и носене на ходова вахта.", "STCW 78/95.", "В" ,"209 ."],
[ "  Всеки член на екипажа трябва да притежава свидетелство за правоспособност съгласно изискванията на международнатата конвенция:", "SOLAS 74/78.", "MARPOL 73/78.", "STCW 78/95.", "ILO 78/95", "В" ,"210 ."],
[ "  Притежателят на правоспособност “корабен механик трета степен” след 24 месеца стаж като трети механик може да заема длъжност на:", "Втори механик на кораби с мощност на пропулсивната уредба до 3 000 kw.", "Главен механик на кораби с мощност на пропулсивната уредба до 1 850 kw.", "А) и Б).", "Главен механик на кораби с мощност на пропулсивната уредба до 1 500 kw.", "В" ,"211 ."],
[ "  Съгласно STCW 1978/95  IV механик е от ниво:", "Оперативно.", "Изпълнителско.", "Управленско.", "Командно.", "А" ,"212 ."],
[ "  Продължителността на работния ден на кораба при извънредни условия на експлоатация не трябва да превишава:", "14 часа.", "10 часа.", "8 часа.", "18 часа.", "А" ,"213 ."],
[ "  Продължителността на работния ден при нормални условия на експлоатация не трябва да превишава:", "12 часа.", "8 часа.", "10 часа.", "10 часа.", "Б" ,"214 ."],
[ "  Общата продължителност на работната седмица на кораба не трябва да превишава:", "77  часа.", "56 часа.", "98 часа.", "82  часа.", "А" ,"215 ."],
[ "  В кои случаи на експлоатация на кораба не се изисква задължително присъствие на механик в машинното отделение ?:", "Когато корабът е с клас на автоматизация А1.", "Когато корабът е на котва или на кей.", "А) и Б).", "Няма такова изискване.", "В" ,"216 ."],
[ "  Когато корабът се намира на открита рейдова стоянка  екипажът  може да слезе на брега, като на кораба се формират  минимум:", "Една ходова вахта.", "Три ходови вахти.", "Две ходови вахти.", "Зависи от класа на кораба.", "В" ,"217 ."],
[ "  Нормалната продължителност на ходовата вахта на кораба е:", "2 часа.", "4 часа.", "6 часа.", "Зависи от класа на кораба.", "В" ,"218 ."],
[ "  Съставът на вахтата в МКО се определя :", "От капитана, независимо от типа на кораба и условията на плаване.", "От вторият механик.", "От главният механик, в зависимост от типа на кораба, външните условия и квалификацията.", "От разписанието за носене на вахтената служба.", "Г" ,"219 ."],
[ "  Дежурният механик има право да почива:", "Облечен в кабината си след 24 часа.", "Осем часа в денонощието в удобно за целта време.", "Нормално разсъблечен от 22 до 06 часа през нощта.", "Няма такова изискване.", "Г" ,"220 ."],
[ "  При  повреда или нарушаване на нормалната работа на главния двигател вахтения механик:", "Намалява хода.", "Докладва незабавно на  вахтения помощник и след това уведомява гл. механик.", "Уведомява незабавно главния механик.", "Уведомява незабавно капитана.", "Б" ,"221 ."],
[ "  Защо преди бункероване на гориво трябва да изпразним преливния танк?", "За да не смесваме старо с ново гориво.", "За да не го препълним.", "За да проверим за утечки.", "За по-лесно отчитане на количествата.", "Б" ,"222 ."],
[ "  При нормална експлоатация, аварийното разпределително табло се захранва от:", "Зарядно устройство.", "Независими аварийни източници.", "Авариен дизелгенератор.", "Главно разпределително табло.", "Г" ,"223 ."],
[ "  Какви превантивни мерки ще предприемете, за да обезопасите работата в картера на кръстоглавен КДВГ?", "Зацепваме валоповоротката и затваряме клапаните на въздушно-пусковата система.", "Зацепваме валоповоротката и поставяме табели “Не включвай-работят хора” на всички точки за управление на КДВГ.", "Осигуряваме присъствие в пулта за управление, за да се спре всеки, който иска да пусне машината.", "Зацепваме валоповоротката, изключваме компресорите за пускови въздух и дренираме бутилките.", "Б" ,"224 ."],
[ "  Индикатор от противодимната (противопожарната) система сигнализира пожар в товарно помещение с генерален товар. Какво е първото нещо което трябва да направите?", "Да пуснете пожарна помпа, да отворите капаците и да започнете да гасите пожара с морска вода.", "Да затворите вентилационните и всички други отвори на хамбара за да спрете притока на кислород.", "Да използвате централнта газова противопожарна система за да загасите пожара.", "Да проверите ситуацията на място преди да вземете решение за начина на гасене на пожара.", "Б" ,"225 ."],
[ "  Какво е изискването за спиране на вентилацията на принудително вентилираните жилищни помещения, товарни помещения, машинно отделение, служебни помещения и контролните постове за управление?", "Трябва да може лесно да се спре отвън вентилираното помещение.", "Да бъде дистанционно контролирано от централния протовопожарен контролен панел.", "Автоматично да се контролира затварянето във всяка секция, която е активирана от пожароизвестителната аварийна система.", "Само механично затваряне на механизмите е разрешено.", "А" ,"226 ."],
[ "  Какво е основното изискване за затварящите механизми на входящите и изходящи клапи на вентилационните системи? ", "Клапите трябва да могат да се затварят отвън вентилираното помещение.", "Да бъдат дистанционно контролирани от центалния противопожарен контролен панел.", "Автоматично да се контролира затварянето във всяка секция която е активирана от пожароизвестителната аварийна система.", "Само механично затваряне на механизмите е разрешено.", "А" ,"227 ."],
[ "  Какъв е сигналът, ако има такъв, определен в SOLAS като напускане на кораб “Abandon ship” сигнал?", "Шест къси сигнала последвани от един дълъг.", "Няма отделен сигнал за напускане на кораб “Abandon ship”, само сигнал за общокорабна тревога е определен.", "Седем къси сигнала.", "Четири дълги сигнала.", "Б" ,"228 ."],
[ "  Като основно правило къде могат да се държат бутилки с пожарогасително вещество, различно от пара?", "В помещението, което трябва да бъде гасено.", "Извън помещението, което трябва да бъде гасено.", "Над главна плауба.", "В студено помещение..", "Б" ,"229 ."],
[ "  Кога трябва да са готови за използване автоматичната спринклер система, пожароизвестителната и алармената система?", "По всяко време.", "Само през нощта.", "По време на преход.", "Когато няма компетентни офицери и не се носи противопожарна вахта.", "А" ,"230 ."],
[ "  В присъствието на главния механик в машинното отделение вахтения механик:", "Прекратява изпълнението на задълженията си.", "Продължава да носи отговорност, докато главния механик не му съобщи лично, че поема отговорността.", "Изпълнява задълженията си под отговорността на главния механик.", "Действа по собствена преценка.", "Б" ,"231 ."],
[ "  Вахтеният (дежурният) механик има право да напусне машинното отделение:", "След като остави заместник от състава на вахтата и уведоми мостика.", "На кораби с клас на автоматизация А1.", "Когато почувствува, че не е в състояние да продължи носенето на вахтата (дежурството).", "Действа по собствена преценка.", "Б" ,"232 ."],
[ "  Съгласно Закона за здравословни и безопасни условия на труд работата свързана с риск за живота и здравето на хората се:", "Забранява категорично.", "Компенсира с по-високо заплащане.", "Организира, като се оценява степента на риска и се вземат всички мерки той да бъде сведен до минимум.", "Компенсира с по-висок трудов стаж.", "В" ,"233 ."],
[ "  Противопожарните конструкции клас “С” не трябва да пропускат пламък и дим в продължение на:", "30 минути.", "1 час.", "Нито А), нито Б).", "Овладяването на пожара.", "В" ,"234 ."],
[ "  Пожарна тревога се обявява от:", "Вахтеният помощник капитан.", "Лицето, забелязало първо пожара.", "Капитана на кораба.", "Ст.пом. капитана.", "Б" ,"235 ."],
[ "  При коя от посочените тревоги обявяването и става само от капитана  и екипажът се подготвя за напускане на кораба?", "При  общо корабна тревога.", "При лодъчна тревога.", "При химическа тревога.", "При пожарна тревога.", "Б" ,"236 ."],
[ "  Системите за инертен газ на нефтените танкери служат за:", "Гасене на пожар в затворени  помещения.", "Създаване на атмосфера с определено съдържание на О<sub>2</sub> в товарните танкове на танкерите.", "Нито А), нито Б).", "Потушаване на пожар в товарните танкове.", "Б" ,"237 ."],
[ "  За гасене на пожари по електрооборудването се използува:", "Пеногасене.", "Парогасене.", "СО<sub>2</sub> пожарогасител.", "Прахов пожарогасител.", "В" ,"238 ."],
[ "  При активиране на сигнала за включена СО<sub>2</sub> система, вахтения механик трябва незабавно:", "Да докладва на мостика.", "Да осигури незабавната евакуация на всички лица намиращи се в машинно-котелното отделение.", "Да се опита да установи кой и защо е включил сигнала.", "Да провери изправността на системата.", "Б" ,"239 ."],
[ "  Изхвърлянето в морето на нефтени утайки (sluge):", "Се разрешава ако корабът се намира в особен район на 50 мили от брега.", "Не се разрешава.", "Се разрешава ако корабът се намира извън особен район на 12 мили от брега.", "Се разрешава ако корабът се намира в особен район на 24 мили от брега.", "Б" ,"240 ."],
[ "  Изхвърлянето на сантинни води от машинните отделения на всички кораби в особени райони е разрешено, ако корабът има съответното пречистващо оборудване и съдържанието на нефт не превишава:", "15 ррм и във водите няма остатъци от товара на танкера.", "50 ррм.", "Не се разрешава.", "Зависи от класа на кораба.", "А" ,"241 ."],
[ "  Всяка операция с горива, баластни води приети в горивни танкове, или нефтоводни смеси се отразява в:", "Корабния дневник.", "Дневника за нефтените операции.", "Машинния дневник.", "Дневника за товарните операции.", "Б" ,"242 ."],
[ "  Корабите, които не са съоръжени с трюмен сепаратор изхвърлят(предават) нефтоводни смеси както следва:", "Извън 50 милната зона.", "Извън териториалните води.", "Предават на нефтосъбирач или брегово приемно устройство.", "Извън 24 милната зона.", "В" ,"243 ."],
[ "  Когато се качите за пръв път на кораб, от къде ще разберете правилата за безопасност, инструкциите в случай на тревога и собствените си задължения в случай на тревога?", "От инструкции, във всяка корабна кабина, в случай на тревога.", "От устни инструкции от капитана.", "От папка раздадена на всеки член от екипажа.", "От разписанието за тревогите изложено на видни места, ръководствата по SOLAS.", "Г" ,"244 ."],
[ "  Колко пълни комплекта пожарникарско оборудване трябва да има на танкер?", "Най-малко три.", "Най-малко един.", "Най-малко два.", "Най-малко четири.", "Г" ,"245 ."],
[ "  Къде трябва да са разположени в жилищните помещения ръчно задействаните постове на пожарооткриващата и пожароизвестителна системи?", "В салетите, офисите и други обществени места.", "Във всички кабини на екипажа и пътниците.", "На изходите и в коридорите.", "На стълбищата и пътищата за евакуация.", "В" ,"246 ."],
[ "  Кой общокорабен авариен сигнал се подава с корабната сирена и с общокорабната аварийно-алармена сигнализация в случай на бедствие?", "Непрекъснат сигнал с корабната сирена и общокорабната аварийно-алармена сигнализация.", "Седем къси сигнала последвани от един дълъг.", "Серия от къси сигнали.", "Серия от дълги сигнали.", "Б" ,"247 ."],
[ "  Как ще се погрижите за лице страдащо от морска болест?", "Ще го поставите да легне или ще го изведете навън да вдиша свеж въздух.", "Ще го накарате да яде някаква мазна храна.", "Ще го окуражите да изпие голямо количество хладка морска вода.", "Давайте му хапчета против морска болест, докато спре да повръща.", "А" ,"248 ."],
[ "  Как ще се погрижите за лице което е било изложено на горещо?", "Ще му дам студени напитки и сол.", "Ще му дам топла и пикантна храна.", "Ще му дам само топла вода.", "Ще му дам силен коктейл с много лед.", "А" ,"249 ."],
[ "  Как ще се погрижите за лице което е било изложено на студ?", "Ще му дам свинско и мазна риба.", "Ще му дам топли хранителни напитки.", "Ще му дам само плодове и заленчуци.", "Ще му дам коняк, уиски или други силни питиета.", "Б" ,"250 ."],
[ "  Наранявания в следствие на подхлъзвания и падания съставляват огромна част от инцидентите случващи се в домакинска команда. Какво трябва да бъде направено за да се намали високият процент на тези инциденти? ", "Да се поддържат подовете и палубите чисти, без мазнини и грес по тях.", "Да се инсталират термостати за да се избегне заледяването.", "Да не се измива целият боклук за да се предотврати подхлъзването на лицата.", "Да се убедите, че няма оставени хлъзгави субстанции там където се очаква да има повече хора.", "А" ,"251 ."],
[ "  Кое е най-важно когато хора работят в танкове или затворени пространства?", "Да са безопасно екипирани.", "Да бъдат държани под постоянно наблюдение.", "Да работят по двойки.", "Пожарната магистрала да е под налягане и описаните действия в А), Б) и В).", "В" ,"252 ."],
[ "  Колко продължително трябва да бъде вентилиран танк, когато вътре работят хора?", "Толкова, че да се поддържа 8% концентрация на кислорода в атмосферата.", "За период от време най-малко 60 минути.", "Толкова дълго колкото прецени ст.пом.капитана.", "Докато в танка работят хора.", "В" ,"253 ."],
[ "  Колко често трябва да се смазват или гресират кранчетата за кислород и заваръчните инструменти?", "Всяка седмица.", "Никога.", "Два пъти годишно.", "Когато се сметне за необходимо.", "Б" ,"254 ."],
[ "  Какво трябва да бъде направено преди влизане в помпено отделение?", "Да се издаде разрешение за влизане в затворени пространства.", "Да се уведоми ст.пом.капитана или  офицера по сигурността.", "Да се вентилира най-малко 15 минути предварително.", "Да се уведоми ст.пом.капитана или дежурния офицер.", "А" ,"255 ."],
[ "  “Отпадни” се наричат всички води, които се изхвърлят от:", "Машинното отделение.", "Тоалетни, бани, санитарни помещения и други подобни.", "А) и Г).", "Помпените отделения.", "Б" ,"256 ."],
[ "  Изхвърлянето на нераздробени стъклени, метални и др. потъващи отпадъци в особени райони:", "Не се разрешава.", "Разрешава се, ако корабът се намира на  разстояние 12 мили от брега.", "Разрешава се, ако корабът се намира на разстояние 4 от брега.", "Разрешава се, ако корабът се намира на  разстояние 50 мили от брега.", "А" ,"257 ."],
[ "  Изхвърлянето на раздробени стъклени и др. твърди отпадъци опаковани в полиетиленови торби:", "Не се разрешава.", "Разрешава се, ако корабът се намира на повече от 4 мили от брега.", "Разрешава се ако корабът се намира извън особен район.", "Разрешава се, ако корабът се намира на повече от 12 мили от брега.", "А" ,"258 ."],
[ "  Замърсяването на въздуха от корабите се причинява от:", "Емисиите на  газовете от КДВГ и парни котли, съдържащи SO2, NO2 и емисиите от инсенераторите.", "Озоноразрушаващите газове от хладилните и противопожарни уредби и леките фракции, които се отделят в танковете при превоз на суров нефт.", "А) и Б).", "Нито едно от трите.", "В" ,"259 ."],
[ "  Пепелта от инсинераторите се:", "Изхвърля се зад борда.", "Предава на брегови съоръжения.", "Предава на брега тази от пластмасовите отпадъци, а от другите видове отпадъци се изхвърля в морето.", "Предава на нефтосъбирач.", "В" ,"260 ."],
[ "  Спринклерната система е: ", "Система за инертни газове, която се прилага само при танкерите.", "Водна оросителна система, която се включва автоматично.", "Водна противопожарна система, която се задейства ръчно.", "Система за инертни газове, която се прилага само при пасажерите.", "Б" ,"261 ."],
[ "  Кое е най-критичното време при бункироване на гориво по отношение на опасноста от замърсяване и разлив на нефтопродукти : ", "Шланговането на системите.", "Запълването на танковете.", "Началото на бункероването.", "Измерването на танковете.", "Б" ,"262 ."],
[ "  Корабите които не са съоръжени с трюмен сепаратор:", "Изхвърлят нефтоводни смеси извън 50 милната зона.", "Изхвърлят нефтоводни смеси извън териториалните води.", "Изхвърлят нефтоводни смеси извън  икономическата зона.", "Сдават нефтоводни смеси на нефтосъбирач.", "Г" ,"263 ."],
[ "  Изхвърлянето на нефтени отпадъци (sludge) в морето се:", "Разрешава в 200 милната зона.", "Разрешава извън 200 милната зона.", "Разрешава извън 12 милната зона.", "Не се разрешава.", "Г" ,"264 ."],
[ "  Изхвърлянето зад борд на вредни вещества в опаковка се: ", "Разрешава в 200 милната зона.", "Разрешава в 50 милната зона.", "Не се разрешава.", "Разрешава само в зоната на Антарктида.", "В" ,"265 ."],
[ "  Съхраняването на ацетиленови и кислородни бутилки се разрешава:", "В машинното отделение.", "В складовете на палубния боцман.", "В отделни помещения извън машинното отделение.", "Не се разрешава.", "В" ,"266 ."],
[ "  Работата на корабните товарни устройства се забранява при установяване скъсване на нишки повече от:", "1%.", "3%.", "10%.", "20%.", "В" ,"267 ."],
[ "  Какво ще направите ако по време на работа с оксижен ви се случи обратно запалване в шланговете?", "Ще побягна да се спасявам.", "Първо ще затворя кранчето за приток на кислород.", "Ще използвам преносим пожарогасител.", "Ще охладя бутилките с вода.", "Б" ,"268 ."],
[ "  Какво ще направите, ако трябва да използвате непознато механично оборудване?", "Ще потърся съвет от прекия си началник преди да се опитам да го използвам.", "Ще се уверя, че всички предпазни защити и механизми са изключени.", "Тъй като времето е пари, ще използвам метода проба-грешка.", "Не използвайте машината, докато не прочетете инструкциите преди това и докладвате на началника на вашата команда.", "Г" ,"269 ."],
[ "  Какъв вид разрешение трябва да бъде взето за започване на “cold work in tanks“?", "Cold work permit + Alcohol test permit.", "Hot + Cold work permit.", "Cold work permit.", "Cold work permit + Permit for entry.", "Г" ,"270 ."],
[ "  Какъв вид разрешение трябва да бъде взето за започване на “hot work in tanks“?", "Hot work permit + Alcohol test permit.", "Hot work permit.", "Permit for entry.", "Hot work permit + Permit for entry.", "Г" ,"271 ."],
[ "  Kакви рутинни процедури би трябвало да се направят преди започването на огневи работи?", "Капитана трябва да бъде уведомен.", "Всички на кораба трябва да бъдат уведомени най-малко 24 часа предварително.", "Главния механик трябва да бъде уведомен.", "Процедурите се изпълняват съгласно инструкциите за огневи работи.", "Г" ,"272 ."],
[ "  Ако член на екипажа установи злоупотреба с алкохол и наркотици на кораба, на кого следва да докладва?", "На менажера.", "На Администрацията на флага.", "На капитана на кораба.", "На портовите власти.", "В" ,"273 ."],
[ "  Какво е препоръчително за лицата които влизат в заключено с катинар хладилно помещение?", "Да се убеди, че е осигурено отварянето на вратата отвътре и сигнализацията за човек в камерата работи.", "Лицето трябва да остави катинара от външна страна на вратата за да бъде видян от всички.", "Лицето трябва да се убеди, че има достатъчно куки за месо в хладилника, така че в случай на авария да могат лесно да бъдат намерени.", "Лицето не трябва да маха лед или остатъци от лед, които са необходими да поддържат необходимата температура в хладилника.", "А" ,"274 ."],
[ "  Kакви рутинни процедури би трябвало да се направят преди започването на “cold work”?", "Главният механик трябва да бъде уведомен.", "Да се подготвят и поставят в района дихателни апарати.", "Да се активира общокорабната аларма и да се проведат процедурите за “cold work”, включително да се попълнят и разпишат и съответните чек листи.", "Процедурите се изпълняват съгласно инструкциите за “cold work”.", "Г" ,"275 ."],
[ "  При инцидентен разлив на нефтени продукти от слоп-танк на танкер, кой от следните факти не е необходимо да бъде записано в дневника за нефтените операции?", "Името на лицето отговорно за разлива.", "Времето когато е станал разлива.", "Позицията на кораба когато е станал разлива.", "Приблизително количеството на разлива и вида на нефтеният продукт.", "А" ,"276 ."],
[ "  По време на приемане на бункер в чужди териториални води забелязвате маслени петна около кораба. Спирате приемането на гориво и:", "Започвате операции по почистване на петната.", "Уведомявате капитана на кораба.", "Напускате района.", "Уведомявате местните власти.", "Б" ,"277 ."],
[ "  По време на товарене на нефтопродукти, забелязвате мазни петна около кораба. Какво ще направите първо?", "Ще огледам кораба за течове.", "Ще спра товаренето.", "Ще информирам палубата.", "Ще информирам местните власти.", "Б" ,"278 ."],
[ "  Повечето малки разливи са причинени от:", "Човешка грешка.", "Неизправно оборудване.", "Големи случайности.", "Непредвидими обстоятелства.", "А" ,"279 ."],
[ "  При възникване на пожар в жилищните, товарните помещения или на палубата кой ръководи гасенето на пожара?", "Капитана.", "Старши-помощник капитана.", "Вахтеният помощник капитан.", "Първият член от екипажа, който пристигне в района на пожара.", "А" ,"280 ."],
[ "  При възникване на пожар в машинно отделение, кой ръководи гасенето на пожара?", "Капитана.", "Главният механик.", "Дежурният механик.", "Първият член от екипажа, който пристигне в района на пожара.", "А" ,"281 ."],
[ "  Кое е най-вероятното място където нефта ще прелее по бордовете в случай на препълване на танк по време на товарни/разтоварни операции?", "В задната част на  главната палуба.", "Близо до товарния манифолд.", "Близо до люка на танка който се товари/разтоварва.", "Близо до мерителната тръба на танка който се товари/разтоварва.", "А" ,"282 ."],
[ "  Кое от следните действия най-ефективно ще предпази кабината от възникване на пожар?", "Да се убедим, че всички лица избягват да пушат в леглата.", "Да изискваме хората да се въздържат от пушене.", "Да приберем всички пепелници.", "Да се инсталира пожаро-известителна сигнализация.", "А" ,"283 ."],
[ "  Кое твърдение/я е вярно при разлив на бензин?", "Не е обхванат от законодателството за замърсяване с нефтени продукти.", "Разлива на бензин е видим за по-кратко време от разлива на тежко гориво.", "Негативният ефект върху морската фауна е малък.", "Ще потъне по-бързо отколкото суровия нефт.", "Б" ,"284 ."],
[ "  Кои от следните действия имат най-голям ефект при борба с пожар?", "Всички противопожарни групи са организирани по възможно най-бързия начин.", "Всички възможни средства за гасене на пожара са донесени на място.", "Гасенето на пожара е започнало веднага.", "Старши-помощник капитанът е известен.", "А" ,"285 ."],
[ "  Какъв е най-важният начин за предотвратяване от замърсяване с нефтопродукти при малки разливи по време на товарни операции на танкер?", "Всички шпигати да са затворени.", "Да има оборудвани помпи в задната част на палубата.", "Да има дървени стърготини близо до манифолда.", "Да има достатъчно обем в тавата под манифолда.", "А" ,"286 ."],
[ "  Какъв е най-добрият начин за да се предотврати замърсяване на водата при малки разливи с нефтопродукти на борда на кораба?", "Да има разпръскващи химикали готови за употреба в случай на нефтен разлив.", "Да се постави боново заграждение около кораба.", "Ограничете разлива на борда на кораба.", "Да има дървени стърготини готови за употреба.", "В" ,"287 ."],
[ "  Какъв е недостатъка при използване на химикали при разлив от нефтени продукти във водата?", "Химикалите правят трудно отстраняването на нефтопродуктите от водата.", "Водата променя цвета си в бял, което прави лесно установяването на разлива от нефтопродукти.", "Ако нефтеното петно е отнесено от борда на кораба, трудно е да се използват химикали.", "Трудно е използването на химикали при ветровито време.", "А" ,"288 ."],
[ "  Какъв е общокорабният сигнал за тревога съгласно SOLAS?", "Продължително звънене на корабните звънци.", "Шест или повече къси сигнали последвани от един дълъг.", "Един дълъг сигнал последван от шест къси сигнали.", "Седем или повече къси сигнали последвани от един дълъг.", "Г" ,"289 ."],
[ "  Какъв сигнал трябва да се подаде с корабната сирена при “човек зад борда”?", "5 дълги сигнала няколко пъти.", "6 дълги сигнала няколко пъти.", "3 дълги сигнала няколко пъти.", "4 дълги сигнала няколко пъти.", "В" ,"290 ."],
[ "  Какъв сигнал трябва да се подаде с корабният звънец при пожар на кораба?", "Серия от къси звукови сигнали.", "Един дълъг следван от седем къси звукови сигнали.", "Серия от дълги звукови сигнали.", "Серия от последователно редуване на дълъг и къс звукови сигнали.", "А" ,"291 ."],
[ "  Защо трябва да имаме на борда международен фланец?", "Да свържем товарните шлангове към брега.", "Да свържем корабните и бреговите противопожарни линии.", "Да свържем шланговете за бункероване с кораб/бряг.", "Да свържем утаечните танкове с корабен/брегови приемник.", "Б" ,"292 ."],
[ "  Какво трябва да бъде направено, преди да бъде пусната централната СО<sub>2</sub> система за гасене на пожар в МКО или друго затворено помещение?", "Да се спрат всички машини.", "Всички отвори на помещението да се проверят.", "Да се провери дали всички членове на екипажа са напуснали помещението.", "Да се изгасят котлите.", "В" ,"293 ."],
[ "  Какво ще вземете в спасителната лодка, ако напускате кораба?", "Топли дрехи, одеала и спасителни жилетки.", "Колкото е възможно бисквити и консерви.", "Всички налични ценности като пари, бижута и др.", "Вода и напитки.", "А" ,"294 ."],
[ "  Какво ще направите ако видите човек да пада зад борд?", "Ще облека спасителна риза.", "Ще спусна спасителна лодка.", "Ще хвърля спасителен пояс и ще докладвам на мостика незабавно.", "Ще викам за помощ.", "В" ,"295 ."],
[ "  Кои от следните проверки трябва да бъдат направени задължително при всяка противопожарна тревога?", "Проверка състоянието на водонепроницаемите врати, противопожарните врати, противопожарни клапи и съответното оборудване за връзка.", "Проверка състоянието на протипожарните врати, окомплектоването на противопожарното снаряжение.", "Всичко изброено в А), Б) и Г).", "Проверка състоянието на механизмите за затваряне на вентилационните и други отвори в настройката, МКО и товарните помещения.", "В" ,"296 ."],
[ "  Кой е най добрият начин за качване в спасителен плот плаващ близо до кораба, ако позволяват условията?", "Да се облече спасителна риза и да се скочи във водата близо до сала след което да се доплува до него.", "Да се използва въженият трап за да се слезе до сала и да се качи на него.", "Да се скочи върху спасителния сал.", "Да се скочи във водата без спасителна риза, за да се доплува по-лесно до сала и да се качи на него.", "Б" ,"297 ."],
[ "  Кой метод за почистване от екипажа на разлив от нефтопродукти обикновено не е разрешен?", "Наемане на бонови заграждения.", "Използване на потъващи агенти.", "Използване на смукателно оборудване.", "Всичко изброено.", "Г" ,"298 ."],
[ "  Ако използвате химикали за почистване на разлив от нефтопродукти във водата, какво трябва да е действието на химикала? ", "Да отстрани нефтопродуктите от водата.", "Да абсорбира нефтопродуктите за да може по-лесно да се събере.", "Да разпръсне и разтвори нефтопродуктите във водата.", "Да ограничи замърсяването с нефтопродукти в малък периметър.", "Б" ,"299 ."],
[ "  Един от следните райони не е специален район съгласно  MARPOL по отношение на замърсяването с нефтопродукти. Кой район?", "Мексиканският залив.", "Средиземно море.", "Червено море и Аденския залив.", "Балтийско море.", "А" ,"300 ."],
[ "  Напуснали сте кораба със спасителен сал. Кое от следните действия би трябвало да направите? ", "Да се организира наблюдение и по възможност да се присъедини към другите спасителни средства. Да се пусне морската котва(sea anchor).", "Да се организира наблюдение.", "Да се гребе в посока към най-близкия бряг.", "Да се присъедини към други спасителни средства. Да се пусне морската котва(sea anchor).", "А" ,"301 ."],
[ "  Къде трябва да се държи Международният фланец?", "Лесно достъпен до парадния трап.", "В машинното отделение.", "В надстройката.", "Заедно с товарните шлангове.", "А" ,"302 ."],
[ "  На кои кораби пожарните шлангове трябва да бъдат свързани към пожарните кранове вътре в надстройката през цялото време?", "Пътнически кораби превозващи повече от 36 пътника.", "Пътнически кораби превозващи повече от 12 пътника.", "Пътнически кораби превозващи повече от 100 пътника.", "Пътнически кораби плаващи на кратки разстояния.", "А" ,"303 ."],
[ "  Намирате се на 10 мили от брега на Нигерия, Западна Африка. Имате ли право да изхвърлите зад борд празни стъклени бутилки?", "Да, бутилките могат да бъдат хвърлени зад борд, ако са стрити така, че частиците да могат да минават през мрежа с отвори 25 мм. ", "Не, стъклени бутилки не могат да бъдат хвърляни зад борд.", "Да, стъклени бутилки могат да бъдат хвърлени зад борд.", "Да, бутилките могат да бъдат хвърлени зад борд, ако са стрити така че частиците да могат да минават през мрежа с отвори 50 мм.  ", "А" ,"304 ."],
[ "  Намирате се на 10 мили от най-близкия бряг на Алжир, Средиземно море. Имате ли право да изхвърлите зад борд хранителни отпадъци?", "Да, хранителни отпадъци могат да бъдат хвърлени зад борд, ако са смляни така че частиците да могат да минават през мрежа с отвори 50 мм.  ", "Да, всякакъв вид хранителни отпадъци могат да бъдат хвърлени зад борд.", "Да, хранителни отпадъци могат да бъдат хвърлени зад борд, ако са смляни така че частиците да могат да минават през мрежа с отвори 25 мм.  ", "Не, хранителни отпадъци не могат да бъдат хвърляни зад борд.", "Г" ,"305 ."],
[ "  Кой от следните факти не е необходимо да бъде записан в “Дневника за нефтени операции”?", "Количеството на баласта изхвърлен от segregated ballast tanks.", "Скоростта на кораба по време на изхвърляне на мръсен баласт в морето.", "Времето на започване и край на вземане на баласт в товарни танкове.", "Използваният метод за установяване, че товарните танкове са сухи след миене със суров нефт.", "А" ,"306 ."],
[ "  Колко болта трябва да има на фланеца затварящ магистралата за бункероване, когато не се използва?", "4 болта.", "Не е необходимо да бъде затворена магистралата.", "2 болта.", "Болт във всеки отвор.", "Г" ,"307 ."],
[ "  Какъв тип конструктивни материали трябва да се избягват, с цел противопожарна безопасност?  ", "Всички съставни материали.", "Всички  материали с открити дървени части.", "Всички пластмасови материали.", "Всички запалими материали.", "Г" ,"308 ."],
[ "  Когато кораб наруши правилата за предпазване на морето от замърсяване с нефтопродукти, кой е държан отговорен?", "Само капитана.", "Всеки един взел участие в действията нарушаващи правилата.", "Само корабособственика.", "Само офицерите.", "Б" ,"309 ."],
[ "  Кое от следните изисквания не е задължително да бъде описано в процедурите за нефтени операции?", "Разположението и капацитета на всички горивни и товарни танкове на кораба.", "Схемата на корабната магистрала за нефтени операции.", "Броят на лицата които трябва да вземат участие по време на нефтени операции.", "Всички специални процедури за завършване товаренето на товарен танк.", "А" ,"310 ."],
[ "  Какво трябва да направите с пепелта от инсенератора при изгарянето на твърди отпадъци, които съдържат пластмаси?", "Да се сдадат на брегови приемателен пункт.", "Да се хвърлят зад борд когато кораба е на повече от 25 мили от брега.", "Да се хвърлят зад борд когато кораба е на повече от 12 мили от брега.", "Да се хвърлят зад борд, ако кораба не е в река или в устието на река.", "А" ,"311 ."],
[ "  Защо е необходимо да държим товарната и бункер магистрали заглушени, когато не се използват?", "За да сме сигурни, че товара няма да се смеси.", "За да сме сигурни, че не влиза въздух в танковете.", "За да предотвратим неочакван разлив.", "За да предотвратим замърсяване на товара.", "В" ,"312 ."],
[ "  Системите за обемно гасене трябва да имат:", "Дублиращи източници за захранване.", "Трябва да имат статично задвижване.", "Няма такова изискване.", "Независими източници за захранване.", "В" ,"313 ."],
[ "  Международно свидетелство за предотвратяване замърсяването с корабни отпадъци (International Garbage Pollution Prevention Certificate) се изисква:", "за всички кораби, извършващи международни рейсове", "не се изисква", "за корабите над 400 GT", "само за корабите от каботажно плаване", "Б" ,"314 ."],
[ "  С План за управление на корабните отпадъци (Garbage Management Plan) по смисъла на MARPOL Annex V трябва да са снабдени:", "всички кораби с тонаж ≥100 GT", "всички кораби, освидетелствани да превозват  ≤ 15 души", "всички кораби с тонаж ≥100 GT, както и тези, освидетелствани да превозват ≥ 15 души ","всички кораби с тонаж  ≥ 400 GT", "В" ,"315 ."],
[ "  Планът за управление на корабните отпадъци (Garbage Management Plan) трябва да съдържа информация за:", "ограниченията за изхвърляне на отпадъци зад борд и лицето, което трябва да контролира изхвърлянето зад борда", "мерките, които следва да се предприемат при допуснат от кораба нефтен разлив", "обемите и местоположението на борда на контейнерите за събиране на различни видове отпадъци", "ограниченията за изхвърляне на отпадъци зад борд, правилата за разделяне и обработка ва видовете отпадъци,обемите и местоположението на борда на контейнерите за събиране на различни видове отпадъци, отговорно лице за прилагане на плана", "Г" ,"316 ."],
[ "  Наличието на машина за раздробяване на твърди отпадъци (garbage comminuter) трябва да е документирано в: ", "Плана за управление на корабните отпадъци (Garbage Management Plan)", "Дневника за операциите с твърдите корабни отпадъци (Garbage Record Book)", "Приложението към Международното свидетелство за предотвратяване замърсяването с твърди корабни отпадъци (Supplement to the International Garbage Pollution Prevention Certificate)", "в нито един от изброените документи", "А" ,"317 ."],
[ "  Дневник за операциите с твърдите корабни отпадъци (Garbage Record Book) трябва да се води на корабите, които са: ", "с тонаж  ≥ 400 GT","с тонаж  ≥ 100 GT ",  "освидетелствани да превозват  ≥ 12 души", "с тонаж ≥ 400 GT и/или  освидетелствани да превозват  ≥ 15 души", "Г" ,"318 ."],
[ "  В Дневник за операциите с твърдите корабни отпадъци (Garbage Record Book) трябва да се вписват дейностите по: ", "разделно събиране на отпадъците", "предаване на отпадъци в пристанищни приемни съоръжения", "изгаряне на нефтени утайки (sludge)", "количествата доставени на кораба мазнини за готвене (cooking oil)", "Б" ,"319 ."],
[ "  Плакати с означение на ограниченията за изхвърляне на твърди отпадъци зад борд се изискват за:", "всички кораби с тонаж ≥100 GT", "всички кораби с тонаж ≥ 400 GT", "само за пътнически кораби", "всички плаващи и/или стационарни платформи, както и всички кораби с дължина  ≥ 12 метра", "Г" ,"320 ."],
[ "  Съгласно ревизирания MARPOL Annex V (Resolution MEPC 201.(62)) корабните отпадъци са разделени на: ", "девет категории (A, B, C, D, E, F, G, H, I)", "твърди, течни и газообразни", "пластмасови, хранителни и други", "шест категории (1, 2, 3, 4, 5, 6)", "А" ,"321 ."],
[ "  Съгласно ревизирания MARPOL Annex V (Resolution MEPC 201.(62)) в отделни категории са класифицирани следните отпадъци: ", "стъклени отпадъци", "животински трупове", "омаслени парцали", "отпадъчни води от мивки и душове", "Б" ,"322 ."],
[ "  Особени райони (special areas) по смисъла на MARPOL Annex V са следните морета:", "Йонийско море", "Средиземно и Каспийско море", "Средиземно и Северно море", "нито едно от изброените морета", "В" ,"323 ."],
[ "  Извън особените райони (special areas) се разрешава изхвърлянето на следните видове корабни отпадъци:", "всякакъв вид хранителни отпадъци, генерирани на кораба, независимо от това дали са смлени/раздробени, или не", "всякакъв вид пластмасови отпадъци, включително синтетични въжета и найлонови торби", "хранителни отпадъци, смесени с мазнини за готвене (cooking oil)", "изхвърлянето на каквито и да е корабни отпадъци е забранено", "А" ,"324 ."],
[ "  Разрешено ли е изхвърлянето на мазнини за готвене (cocking oil) в особените райони (special areas)?", "Да, когато корабът е на ход", "Не", "Да, но само от корабите, превозващи повече от 12 души на борда, когато са на ход.", "Разрешено е само от плаващи и стационарни платформи", "Б" ,"325 ."],
[ "  Изискванията на MARPOL Annex V не се отнасят за:", "пътнически кораби", "кораби на подводни криле", "плаващи и стационарни платформи", "военните и гранично-полицейските кораби", "Г" ,"326 ."],
[ "  Къде е разрешено изхвърлянето на пластмасови отпадъци?", "На разстояние ≥ 12 морски мили от най-близкия бряг", "На разстояние ≥ 3 морски мили от най-близкия бряг", "Не е разрешено", "Извън особените райони (special areas)", "В" ,"327 ."],
[ "  Изхвърлянето на животински трупове от кораби, плаващи в особен район (special area):", "се разрешава, ако труповете са смлени/раздробени (на частици < 25 мм.)", "се разрешава на разстояние ≥ 12 морски мили от най-близкия бряг", "е забранено", "се разрешава на разстояние ≥ 12 морски мили от най-близкия бряг, ако труповете са смлени/раздробени (на частици < 25 мм.)", "В" ,"328 ."],
[ "  Изхвърлянето на смлени/раздробени хранителни отпадъци от кораби в особени райони (special areas) е разрешено:", "Изхвърлянето на смлени/раздробени хранителни отпадъци от кораби в особени райони (special areas) е разрешено:", "в териториалните води на крайбрежните държави", "само ако са в найлонови торби", "на разстояние ≥ 12 морски мили от най-близкия бряг", "Г" ,"329 ."],
[ "  Забранено е изхвърлянето в морето на смес от:", "пластмаси и хранителни отпадъци", "животински трупове и пластмасови бутилки", "синтетични въжета и хартиени опаковки", "всичко изброено в останалите отговори", "Г" ,"330 ."],
[ "  Смес от хранителни отпадъци и мазнини за готвене може да бъде изхвърлена зад борд:", "навсякъде, само ако е необходимо за обезпечаване  безопасността на кораба и хората на борда или за спасяване на човешки живот на море", "ако корабът плава извън особен район (special area)", "ако корабът се намира в особен район (special area)", "на разстояние ≥ 3 морски мили от най-близкия бряг, ако е раздробена/смляна", "А" ,"331 ."],
[ "  С ревизирания MARPOL Annex V (Resolution MEPC 201.(62)) се въвеждат: ", "по-облекчени изисквания относно изхвърлянето на корабните отпадъци (garbage)", "нови категории отпадъци (garbage)", "по-строги изисквания относно изхвърлянето на хранителни отпадъци зад борд ", "нови категории отпадъци (garbage) и по-строги изисквания относно изхвърлянето на хранителни отпадъци зад борд ", "Г" ,"332 ."],
[ "  В особените райони (special areas) по MARPOL Annex V на разстояние повече от 12-мили от най-близкия бряг се допуска изхвърлянето на следните видове отпадъци: ", "мазнини за готвене (cooking oil)", "хартиени и стъклени отпадъци", "смлени/раздробени хранителни отпадъци", "пепел от изгарянето на корабни отпадъци в инсинератор", "В" ,"333 ."],
[ "  В каква мерна единица се изчислява конструктивния индекс за енергийна ефективност ? ", "gCO2/tonne.mile", "gSO2/mile.", "kgCO2/tone.", "tonne GHG emissions/NM.", "А" ,"334 ."],
[ "  По силата на кой нормативен документ се изисква специализирано обучение за екипна работа и лидерски умения?", "SOLAS", "MARPOL", "STCW", "Евродиректива 106/2008", "В" ,"335 ."],
[ "  Ако възникнат спорове по различни управленски алтернативи, то екипът следва да ги:", "Пренебрегне и да следва решения по смисъла на добрата морска практика.", "Поставя за обсъждане.", "Възложи за преценка на хората с най-голям професионален опит.", "Екипната работа не допуска воденето на спорове относно управленските решения.", "Б" ,"336 ."],
[ "  Основните елементи на динамичното управление са: ", "Общуване, Мотивиране, Водене.", "Нареждане, Проверка, Наказание.", "Нареждане, Проверка, Награждаване.", "Общуване, Проверка, Оценяване.", "А" ,"337 ."],
[ "  “Колелото” на управление започва с:", "Определяне на целите.", "Планиране.", "Мислене.", "Оценка.", "В" ,"338 ."],
[ "  “Колелото” на управление завършва с:", "Предефиниране.", "Измерване.", "Оценка.", "Постигане.", "А" ,"339 ."],
[ "  Авторитарния тип лидер е загрижен основно за:", "Укрепване на властта си в групата.", "Постигане на поставените цели.", "Укрепване на духа на екипа.", "Спазване на установените правила и процедури.", "Б" ,"340 ."],
[ "  Социалния тип лидер е загрижен основно за:", "Спазване на установените правила и процедури.", "Създаване на атмосфера на сътрудничество.", "Постигане на поставените цели.", "Укрепване на властта си в групата.", "Б" ,"341 ."],
[ "  Организационния тип лидер е загрижен основно за:", "Спазване на установените правила и процедури.", "Укрепване на властта си в групата.", "Създаване на атмосфера на сътрудничество.", "Постигане на поставените цели.", "А" ,"342 ."],
[ "  Х- стил на управление означава:", "Хармония, загриженост за индивидуалните способности.", "Пресичане интересите на ръководството и персонала. ", "Авторитарен и репресивен стил, съчетан със стриктен контрол.", "Хаос в управлението, противоречащи си заповеди.", "В" ,"343 ."],
[ "  Y- стил на управление означава:", "Освободен и развиващ се, с увеличаваща се свобода и отговорности.", "Освободен и развиващ се, в съчетание със стриктен контрол.", "Свобода в процеса на планиране, но стриктно следване на плана.", "Нито едно от изброените.", "А" ,"344 ."],
[ "  При определяне на целите се започва с:", "Определяне къде сме в момента.", "Наличните ресурси.", "Определяне къде искам да бъда.", "Избиране на успешна стратегия.", "В" ,"345 ."],
[ "  В етапа на оформяне на екипа хората са:", "Гъвкави и толерантни.", "Организирани и акуратни.", "Учтиви и внимателни.", "Сърдити и скарани.", "В" ,"346 ."],
[ "  В етапа на експериментиране хората от екипа са склонни към:", "Конфронтация.", "Определяне на правила.", "Взаимна подкрепа.", "Самозащита.", "А" ,"347 ."],
[ "  В етапа на консолидиране  хората от екипа са склонни към:", "Взаимна подкрепа.", "Изолиране на членове.", "Развиване на умения.", "Взаимно опознаване.", "В" ,"348 ."],
[ "  Зрелия екип е характерен с:", "Атакуване на целите.", "Идентификация на членовете с екипа.", "Управляване на конфликтите.", "Учтиви маниери.", "Г" ,"349 ."],
[ "  Ролевия модел “Plant” е най-подходящ при:", "Оценка на наличните ресурси.", "Рутинни дейности за продължителен период от време.", "Екип от силно различаващи се индивиди.", "Проблеми, изискващи нестандартен подход.", "Г" ,"350 ."],
[ "  Ролевия модел Resource investigator  е най-подходящ при:", "Установяване на обратна връзка.", "Прецизиране на целите.", "Оценка на потенциалните опасности.", "Изследване на потенциални възможности.", "Г" ,"351 ."],
[ "  Ролевия модел monitor/evaluator  е най-подходящ при:", "Поддържане на ентусиазъм при продължителни неуспехи.", "Определяне на силните и слабите страни на проекта.", "Необходимост от експертна оценка.", "Прецизиране на довършителните дейности.", "Б" ,"352 ."],
[ "  Ролевия модел coordinator  е най-подходящ при:", "Екип от силно различаващи се индивиди.", "Оценка на наличните ресурси.", "Поддържане на ентусиазъм при продължителни неуспехи.", "Необходимост от прецизиране на цели и взимане на решения.", "Г" ,"353 ."],
[ "  Ролевия модел shaper  е най-подходящ при:", "Оценка на потенциалните опасности.", "Трудни задачи с множество препятствия.", "Оценка на наличните ресурси.", "Рутинни дейности за продължителен период от време.", "Б" ,"354 ."],
[ "  Ролевия модел team worker  е най-подходящ при:", "Поддържане на ентусиазъм при продължителни неуспехи.", "Екип от силно различаващи се индивиди.", "Определяне на рисковете.", "Установяване на обратна връзка.", "Б" ,"355 ."],
[ "  Ролевия модел implementer е най-подходящ при:", "Екип от силно различаващи се индивиди.", "Оценка на потенциалните опасности.", "Рутинни дейности за продължителен период от време.", "Създаване на контакти със снабдители и клиенти.", "В" ,"356 ."],
[ "  Ролевия модел completer/finisher  е най-подходящ при:", "Прецизиране на довършителните дейности.", "Поддържане на ентусиазъм при продължителни неуспехи.", "Установяване на обратна връзка.", "Оценка на наличните ресурси.", "А" ,"357 ."],
[ "  Ролевия модел specialist  е най-подходящ при:", "Оценка на потенциалните опасности.", "Рутинни дейности за продължителен период от време.", "Поддържане на ентусиазъм при продължителни неуспехи.", "Необходимост от експертна оценка.", "Г" ,"358 ."],
[ "  Основния мотив за извършване на определена дейност е:", "Икономическите ползи.", "Вътрешното удовлетворение.", "Нуждите и очакванията свързани с тази дейност.", "Социалните контакти.", "В" ,"359 ."],
[ "  При удовлетворяване на нуждите най-висок приоритет имат:", "Самоуважението.", "Физиологичните нужди.", "Чувството за принадлежност.", "Нуждата от закрила и  сигурност.", "Б" ,"360 ."],
[ "  При комуникацията най-висок приоритет има:", "Предаваната информация.", "Точността на изразите.", "Не-вербалните сигнали - поза, изражение.", "Начина на изразяване.", "В" ,"361 ."],
[ "  Първият етап от развитието на екипа изисква изясняване на:", "Стандартите на компанията.", "Утвърдените традиции в компанията.", "Кой, кой е, какво следва да се прави и как.", "Основните процедури на мостика (в машинното отделение).", "В" ,"362 ."],
[ "  Етапът на разрешаване на вътрешните противоречия в екипа предполага:", "Предварително изясняване на стандартите за работа.", "Внимателно отношение към дейността на другите, за недопускане на конфликти.", "Идентифициране на противоречията и конфликтите и разрешаването им.", "Изясняване на вътрешните противоречия и конфликти. ", "В" ,"363 ."],
[ "  Културогичният шок в много националните компании се предизивиква от :", "Поведение, което е коренно различно от това в собствената култура.", "Религиозните различия при моряците.", "Различния в традициите по хранене и използване на свободното време.", "Различните нагласи на представителите на различните култури.", "А" ,"364 ."],
[ "  Груповите норми на формиран екип на мостика са:", "Утвърдените в компанията стандарти.", "Ценности на групата относно очакваното поведение в специфичните за групата ситуации.", "Процедурите на мостика, разпоредени от капитана и съдържащи се в различните му заповеди.", "Очакванията към всеки член от екипажа относно качеството на работата.", "Б" ,"365 ."],
[ "  Кое от посочените условия способства най-пълно за изграждане на ефективен екип?", "Само хората със значителен опит имат способности и възможности да участват в екипна работа.", "Членовете на екипа имат доверие един на друг и вярват в способностите на  всеки един от тях.", "Взаимното доверие между членовете на екипа не е съществено условие за тяхната реализация при екипна работа.", "Екипната работа има категорични алтернативи при организиране на съвместни дейности между специалисти на борда на кораба.", "Б" ,"366 ."],
[ "  Посочете най-благоприятните измежду посочените условия за вземане на решение при екипна работа.", "При вземането на решение участват само членовете на екипа с доказано най-високо ниво на експертни знания.", "Целите на екипа не могат да бъдат развивани като групов процес, при условие че в организацията на работа на корабния екипаж има установени строги йерархични взаимоотношения по вертикала.", "Вземането на решения от екипа е процес, който стимулира активното участие на всички членове. ", "Предложението за решение е право на лицата от управленскито ниво, по смисъла на Конвенция STCW 78.", "В" ,"367 ."],
[ "  Решаването на конфликтите е начин за :", "Подобряване на резултатите на екипа.", "Способ за утвърждаване ролята и авторитета на най-старшия по длъжност в екипа.", "Условие за ранжиране на отговорностите на отделните членове на екипа.", "Екипната работа не предполага възникването на конфликтни ситуации.", "А" ,"368 ."],
[ "  Основните умения, които екипът трябва да овладее, включват: ", "Управленски умения.", "Умения за междуличностно общуване.", "Управленски и междуличностни умения.", "Нещо друго.", "В" ,"369 ."],
[ "  Основните елементи на механично управление са: ", "Планиране, Снабдяване, Производство.", "Организиране, Производство, Пласмент.", "Планиране, Организиране, Контрол.", "Проучване, Логистика, Планиране.", "В" ,"370 ."],
[ "  Правилата на Анекс VI на MARPOL 73/78 се отнасят за: ", "Предотвратяване замърсяването на морето с нефт.", "Предотвратяване замърсяването на въздуха от кораби.", "Преноса на видове-пришълци с корабните баластни води.", "Предотвратяване замърсяването на морската среда от кораби.", "Б" ,"371 ."],
[ "  Конструктивен индекс за енергийна ефективност се изчислява за: ", "Корабите с тонаж <400 GT, извършващи международни рейсове.", "“новите пътнически кораби” по смисъла на Анекс IV на MARPOL 73/78.", "Корабите с тонаж >100 GT, извършващи международни рейсове.", "“новите кораби” по смисъла на ревизирания Анекс VI на MARPOL 73/78.", "Г" ,"372 ."],
[ "  Морски райони, в които се контролират SОx-емисиите (ECA-SOx) са: ", "Северно море и Балтийско море.", "Средиземно море и Черно море.", "Нито едно от изброените.", "Черно море и Азовско море.", "А" ,"373 ."],
[ "  За района на Северна Америка Анекс VI на MARPOL 73/78 налага по-строги изисквания към корабите по отношение на: ", "Разрушаващите озоновия слой вещества.", "NОx- и SOx-емисиите. ", "Летливите органични съединения.", "Нито едно от изброените.", "Б" ,"374 ."],
[ "  Анекс VI на MARPOL 73/78 въвежда изискване за воденето на:  ", "Дневник за операциите в машинното отделение на корабите.", "Дневник за управление на корабните отпадъци.", "Дневник за разрушаващите озоновия слой вещества.", "Дневник за баластните операции на кораба.", "В" ,"375 ."],
[ "  Максимално допустимото съдържание на сяра в горивата на корабите, плаващи в Балтийско море, не бива да превишава: ", "3,5 % m/m.", "1,0 % m/m.", "0,1 % m/m.", "4,5 % m/m.", "Б" ,"376 ."],
[ "  При плаване в Черно море корабите следва да използват горива с максимално допустимо съдържание на сяра: ", "4,5 % m/m.", "0,1 % m/m.", "3,5 кг/тон.", "3,5 % m/m.", "Г" ,"377 ."],
[ "  При престой на кораб в българско пристанище не се разрешава използването на горива, чието съдържание на сяра превишава:  ", "0,2 % m/m.", "0,1 % m/m.", "1.0 kg/tonne.", "3,5 % m/m.", "Б" ,"378 ."],
[ "  Операциите по снабдяване на кораба с фреони се записват в: ", "Машинният дневник.", "Дневник за разрушаващите озоновия слой вещества.", "Тези операции не изискват запис.", "Дневника за нефтените операции - част II.", "Б" ,"379 ."],
[ "  План за управление на летливите органични съединения се изисква за следните типове кораби: ", "Само за корабите без система за пречистване на изходящите газове.", "Всички кораби, независимо от типа им.", "Кораби за генерални и насипни товари.", "Танкери.", "Г" ,"380 ."],
[ "  Глава 4 на Анекс VI на MARPOL 73/78 се отнася за: ", "Енергийната ефективност на корабоплаването.", "NOx .", "Качеството на корабните горива.", "Sox .", "А" ,"381 ."],
[ "  Правилата за енергийна ефективност на корабоплаването влизат в сила на: ", "1 януари 2014 г.", "1 май 2013 г. ", "1 януари 2013 г.", "20 август 2013 г. ", "В" ,"382 ."],
[ "  Абревиатурата EEDI означава: ", "Environmental Effectiveness of the newely Designed Incinerators.", "Emergency Escape Device Indicator.", "Environmental EDucation for Inspectors.", "Energy Efficiency Design Index. ", "Г" ,"383 ."],
[ "  “Attained EEDI” е: ", "Референтната стойност на конструктивния индекс за енергийна ефективност на даден кораб.", "Максимално допустимата стойност на конструктивния индекс за енергийна ефективност на конкретен тип  кораб.", "Конкретният конструктивен индекс за енергийна ефективност на даден кораб, изчислен съгласно специално Ръководство на IMO и потвърден от Администрацията на флага или призната класификационна организация.", "Нито едно от изброените.", "В" ,"384 ."],
[ "  В каква мерна единица се изчислява конструктивния индекс за енергийна ефективност ? ", "gCO2/tonne.mile", "gSO2/mile.", "kgCO2/tone.", "tonne GHG emissions/NM.", "А" ,"385 ."],
[ "  Правилата за енергийна ефективност не се отнасят за: ", "Танкери.", "Фериботи.", "Пътнически кораби.", "Кораби с турбинно задвижване и дизел-електроходи.", "Г" ,"386 ."],
[ "  Международно свидетелство за енергийна ефективност се изисква съгласно правилата на: ", "Глава II-2 на SOLAS 74/78.", "Анекс III на MARPOL 73/78.", "Анекс VI на MARPOL 73/78.", "MLC '2006.", "В" ,"387 ."],
[ "  По отношение на “съществуващите кораби” (existing ships) Глава 4 на Анекс VI на MARPOL 73/78 изисква: ", "Международно свидетелство за екологична енергийна безопасност. ", "Корабен план за управление на енергийната ефективност.", "Конструктивен индекс за енергийна ефективност по-малък от максимално допустимия, определен от IMO. ", "Свидетелство за съответствие с ISO-стандартите, издадено от Администрацията на флага.", "Б" ,"388 ."],
[ "  Корабите в обхвата на Анекс VI на MARPOL 73/78 трябва да имат: ", "Международно свидетелство за енергийна ефективност. ", "Международно свидетелство за предотвратяване замърсяването на въздуха.", "Нито едно от тези свидетелства.", "И двете международни свидетелства.", "Г" ,"389 ."],
[ "  Анекс VI на MARPOL 73/78 се прилага към:  ", "Корабите, плаващи под флага на държава-страна по Анекс VI на MARPOL 73/78.", "Корабите, посещаващи пристанища на държава-страна по Анекс VI на MARPOL 73/78.", "Всички кораби, независимо от техния флаг.", "Корабите, плаващи под флага на държава-страна по Анекс VI на MARPOL 73/78 или посещаващи пристанища на такава държава.", "Г" ,"390 ."],
[ "  Кое е най-вероятното място където нефта ще прелее по бордовете в случай на препълване на танк по време на товарни/разтоварни операции?", "В задната част на  главната палуба.", "Близо до товарния манифолд.", "Близо до люка на танка който се товари/разтоварва.", "Близо до мерителната тръба на танка който се товари/разтоварва.", "А" ,"391 ."],
[ "  Кое е най-вероятното място където нефта ще прелее по бордовете в случай на препълване на танк по време на товарни/разтоварни операции?", "В задната част на  главната палуба.", "Близо до товарния манифолд.", "Близо до люка на танка който се товари/разтоварва.", "Близо до мерителната тръба на танка който се товари/разтоварва.", "А" ,"392 ."],
 
]; 

var questionOrder = []; 
var maxNumberOfQuestions = questions.length;  // do NOT make BIGGER than number of 'questions' array 
function setmaxNumberOfQuestions() { 
   maxNumberOfQuestions = 60;
}
// var maxNumberOfQuestions = 2;  // do NOT make BIGGER than number of 'questions.length' array 
var maxNumberOfQuestions2 = questions.length;
function setQuestionOrder() { 
  questionOrder.length = 0; 
  for (var i=0; i<maxNumberOfQuestions2; i++) { questionOrder.push(i); } 
 //questionOrder.sort(randOrd);   // alert(questionOrder);  // shuffle display order 
  pos = document.getElementById("numb").value-1;  posn = questionOrder[pos]; 
} 

function setQuestionOrder2() { 
  questionOrder.length = 0; 
  for (var i=0; i<maxNumberOfQuestions2; i++) { questionOrder.push(i); } 
  questionOrder.sort(randOrd);   // alert(questionOrder);  // shuffle display order 
  pos = 0;  posn = questionOrder[pos]; 
} 


function $_(IDS) { return document.getElementById(IDS); } 
function randOrd() { return (Math.round(Math.random())-0.5); } 
function renderResults(){ 
  var test = $_("test"); 
  test.innerHTML = "<h2>Имате "+correct+" от "+maxNumberOfQuestions+" правилно отговорени въпроси</h2>"; 
  test.innerHTML +=  +(correct/maxNumberOfQuestions*100).toFixed(0)+'% правилни отговори<br>';
  $_("test_status").innerHTML = "Приключихте теста"; 
  $_('timeleft').innerHTML = ' '; 
  test.innerHTML += "<br><img src='images/curies.gif' align='bottom' width='500' height='247' alt='Lubopitko'><br><br>";
  test.innerHTML += "<button  class= 'button' onclick='location.reload()'>Повторете теста</button>"; 
  
 
  setQuestionOrder(); 
  correct = 0; 
  clearInterval(myVar); 
  return false; 
} 




function renderQuestion() { 
  var test = $_("test"); 
  $_("test_status").innerHTML = "Въпрос "+(pos+1)+" от "+maxNumberOfQuestions; 
 // if (rscore != 0) { $_("test_status").innerHTML += '<br>Текущ въпрос: '+(correct/rscore*100).toFixed(0)+'% правилни отговори'; } 
   if (rscore != 0 && correct == 1 && maxNumberOfQuestions != 60) { $_("test_status").innerHTML += '<br>Имате '+correct+' правилeн отговор'; }
    if (rscore != 0 && correct > 1 && maxNumberOfQuestions != 60) { $_("test_status").innerHTML += '<br>Имате '+correct+' правилни отговора'; } 
  var question = questions[posn][0]; 
  var chA = questions[posn][1]; 
  var chB = questions[posn][2]; 
  var chC = questions[posn][3];
  var chD = questions[posn][4];
  var chЕ = questions[posn][6];
  if (maxNumberOfQuestions != 60) { test.innerHTML = "<h3>"+chЕ+question+"</h3>"; } 
  else  {test.innerHTML = "<h3>"+question+"</h3>"}; 
  test.innerHTML += "<label><input type='radio' name='choices' value='А'> А) "+chA+"</label><br>"; 
  test.innerHTML += "<label><input type='radio' name='choices' value='Б'> Б) "+chB+"</label><br>"; 
  test.innerHTML += "<label><input type='radio' name='choices' value='В'> В) "+chC+"</label><br>"; 
  test.innerHTML += "<label><input type='radio' name='choices' value='Г'> Г) "+chD+"</label><br><br><br><br>";
   
  test.innerHTML += "<button  id='btn3'  class= 'button' onclick='checkAnswer3()'>Назад</button>"
  test.innerHTML += "<button  id='btn1' class= 'button' onclick='checkAnswer()'>Напред</button><br><br>";
  test.innerHTML += "<button id='btn2'  class= 'button' onclick='checkAnswer2()' >Верен отговор</button>" ;
  ;
}
  //  setupTimer();  // for indivisible timer for each question
  function setupTimer() {
  timelimit = maxtimelimit; 
  clearInterval(myVar); 
  startTimer(); 
} 

function checkAnswer2(){ 
	//var answer = $_GET("answer");
	//var btn = $_GET("check");
	var choices = document.getElementsByName("choices"); 
  for (var i=0; i<choices.length; i++) { 
    if (choices[i].checked) { choice = choices[i].value; } 
  } 
	rscore++; 
	if (choice == questions[posn][5] || choice != questions[posn][5]){
		btn1.style.display="none";
		btn2.style.display="none";
		btn3.style.display="none";
		answer.style.display="block";
		answer.innerHTML = "<h3>Правилен отговор: "+questions[posn][5] +"<br></h3>";
		answer.innerHTML += "<button  class= 'button'  onclick='proceed()'>Продължи</button>"; 
		}
	} 

function proceed() {
	//var answer = $_GET("answer");
	//var btn = $_GET("check");
	answer.style.display="none";
	btn1.style.display="block";
	btn2.style.display="block";
	btn3.style.display="block";
	pos++;  posn = questionOrder[pos];
	if (pos < maxNumberOfQuestions) { renderQuestion(); } else { renderResults(); } 
	}

function checkAnswer3(){ 
  var choices = document.getElementsByName("choices"); 
  for (var i=0; i<choices.length; i++) { 
    if (choices[i].checked) { choice = choices[i].value; } 
  } 
  rscore++; 
  if (choice == questions[posn][5] && timelimit > 0) { correct--; } 
  pos--;  posn = questionOrder[pos]; 
  if (pos < maxNumberOfQuestions) { renderQuestion(); } else { renderResults(); } 
} 

function checkAnswer(){ 
  var choices = document.getElementsByName("choices"); 
  for (var i=0; i<choices.length; i++) { 
    if (choices[i].checked) { choice = choices[i].value; } 
  } 
  rscore++; 
  if (choice == questions[posn][5] && timelimit > 0) { correct++; } 
  pos++;  posn = questionOrder[pos]; 
  if (pos < maxNumberOfQuestions) { renderQuestion(); } else { renderResults(); } 
} 

window.onload = function() { 
  Start() ;
    // for total time for entire quiz
} 